theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*
 * Constants & macros for individual LCD_GCR bitfields
 */

/*!
 * @name Register LCD_GCR, field DUTY[2:0] (RW)
 *
 * Selects the duty cycle of the LCD controller driver.
 *
 * Values:
 * - 000 - Use 1 BP (1/1 duty cycle).
 * - 001 - Use 2 BP (1/2 duty cycle).
 * - 010 - Use 3 BP (1/3 duty cycle).
 * - 011 - Use 4 BP (1/4 duty cycle). (Default)
 * - 100 -
 * - 101 -
 * - 110 -
 * - 111 - Use 8 BP (1/8 duty cycle).
 */
/*@{*/
#define BP_LCD_GCR_DUTY      (0U)          /*!< Bit position for LCD_GCR_DUTY. */
#define BM_LCD_GCR_DUTY      (0x00000007U) /*!< Bit mask for LCD_GCR_DUTY. */
#define BS_LCD_GCR_DUTY      (3U)          /*!< Bit field size in bits for LCD_GCR_DUTY. */

/*! @brief Read current value of the LCD_GCR_DUTY field. */
#define BR_LCD_GCR_DUTY(x)   (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_DUTY, BS_LCD_GCR_DUTY))

/*! @brief Format value for bitfield LCD_GCR_DUTY. */
#define BF_LCD_GCR_DUTY(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_DUTY) & BM_LCD_GCR_DUTY)

/*! @brief Set the DUTY field to a new value. */
#define BW_LCD_GCR_DUTY(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_DUTY), BP_LCD_GCR_DUTY, 3))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCLK[5:3] (RW)
 *
 * Used as a clock divider to generate the SLCD frame frequency. LCD controller
 * duty cycle configuration is used to determine the LCD controller frame
 * frequency. LCD controller frame frequency calculations are provided in SLCD base
 * clock and frame frequency . LCD controller frame frequency = LCD clock/((DUTY + 1)
 * * 8 * (4 + LCLK[2:0]) * Y) where: 30 < LCD clock < 39.063 kHz Y = 2, 2, 3, 3,
 * 4, 5, 8, 16 chosen by module duty cycle configuration
 */
/*@{*/
#define BP_LCD_GCR_LCLK      (3U)          /*!< Bit position for LCD_GCR_LCLK. */
#define BM_LCD_GCR_LCLK      (0x00000038U) /*!< Bit mask for LCD_GCR_LCLK. */
#define BS_LCD_GCR_LCLK      (3U)          /*!< Bit field size in bits for LCD_GCR_LCLK. */

/*! @brief Read current value of the LCD_GCR_LCLK field. */
#define BR_LCD_GCR_LCLK(x)   (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_LCLK, BS_LCD_GCR_LCLK))

/*! @brief Format value for bitfield LCD_GCR_LCLK. */
#define BF_LCD_GCR_LCLK(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_LCLK) & BM_LCD_GCR_LCLK)

/*! @brief Set the LCLK field to a new value. */
#define BW_LCD_GCR_LCLK(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_LCLK), BP_LCD_GCR_LCLK, 3))
/*@}*/

/*!
 * @name Register LCD_GCR, field SOURCE[6] (RW)
 *
 * This bit is used to select which clock source is the basis for LCD clock. The
 * clock sources are chip-specific. For the clock source assignments, see the
 * chapter that describes how modules are configured. Alternate clock can be only
 * MCGIRCLK, and therefore when SOURCE=1, SIM_SOPT1[OSC32KSEL] bit plays no role.
 * Default clock can be either MCGIRCLK, ERCLK32K, OSC32KCLK, according to the
 * selection in SIM_SOPT1[OSC32KSEL].
 *
 * Values:
 * - 0 - Selects the default clock as the LCD clock source.
 * - 1 - Selects output of the alternate clock source selection (see ALTSOURCE)
 *     as the LCD clock source.
 */
/*@{*/
#define BP_LCD_GCR_SOURCE    (6U)          /*!< Bit position for LCD_GCR_SOURCE. */
#define BM_LCD_GCR_SOURCE    (0x00000040U) /*!< Bit mask for LCD_GCR_SOURCE. */
#define BS_LCD_GCR_SOURCE    (1U)          /*!< Bit field size in bits for LCD_GCR_SOURCE. */

/*! @brief Read current value of the LCD_GCR_SOURCE field. */
#define BR_LCD_GCR_SOURCE(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_SOURCE, BS_LCD_GCR_SOURCE))

/*! @brief Format value for bitfield LCD_GCR_SOURCE. */
#define BF_LCD_GCR_SOURCE(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_SOURCE) & BM_LCD_GCR_SOURCE)

/*! @brief Set the SOURCE field to a new value. */
#define BW_LCD_GCR_SOURCE(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_SOURCE), BP_LCD_GCR_SOURCE, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDEN[7] (RW)
 *
 * Starts LCD controller waveform generator.
 *
 * Values:
 * - 0 - All front plane and back plane pins are disabled. The LCD controller
 *     system is also disabled, and all LCD waveform generation clocks are stopped.
 *     V LL3 is connected to V DD internally. All LCD pins, LCD_Pn, enabled
 *     using the LCD Pin Enable register, output a low value.
 * - 1 - LCD controller driver system is enabled, and front plane and back plane
 *     waveforms are generated. All LCD pins, LCD_Pn, enabled if PAD_SAFE is
 *     clearusing the LCD Pin Enable register, output an LCD driver waveform. The
 *     back plane pins output an LCD driver back plane waveform based on the
 *     settings of DUTY[2:0]. Charge pump or resistor bias is enabled.
 */
/*@{*/
#define BP_LCD_GCR_LCDEN     (7U)          /*!< Bit position for LCD_GCR_LCDEN. */
#define BM_LCD_GCR_LCDEN     (0x00000080U) /*!< Bit mask for LCD_GCR_LCDEN. */
#define BS_LCD_GCR_LCDEN     (1U)          /*!< Bit field size in bits for LCD_GCR_LCDEN. */

/*! @brief Read current value of the LCD_GCR_LCDEN field. */
#define BR_LCD_GCR_LCDEN(x)  (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_LCDEN, BS_LCD_GCR_LCDEN))

/*! @brief Format value for bitfield LCD_GCR_LCDEN. */
#define BF_LCD_GCR_LCDEN(v)  ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_LCDEN) & BM_LCD_GCR_LCDEN)

/*! @brief Set the LCDEN field to a new value. */
#define BW_LCD_GCR_LCDEN(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_LCDEN), BP_LCD_GCR_LCDEN, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDSTP[8] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Stop mode.
 *
 * Values:
 * - 0 - Allows the LCD driver, charge pump, resistor bias network, and voltage
 *     regulator to continue running during Stop mode.
 * - 1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Stop mode.
 */
/*@{*/
#define BP_LCD_GCR_LCDSTP    (8U)          /*!< Bit position for LCD_GCR_LCDSTP. */
#define BM_LCD_GCR_LCDSTP    (0x00000100U) /*!< Bit mask for LCD_GCR_LCDSTP. */
#define BS_LCD_GCR_LCDSTP    (1U)          /*!< Bit field size in bits for LCD_GCR_LCDSTP. */

