theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the BLINK field to a new value. */
#define BW_LCD_AR_BLINK(x, v) (BME_BFI32(HW_LCD_AR_ADDR(x), ((uint32_t)(v) << BP_LCD_AR_BLINK), BP_LCD_AR_BLINK, 1))
/*@}*/

/*******************************************************************************
 * HW_LCD_FDCR - LCD Fault Detect Control Register
 ******************************************************************************/

/*!
 * @brief HW_LCD_FDCR - LCD Fault Detect Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_fdcr
{
    uint32_t U;
    struct _hw_lcd_fdcr_bitfields
    {
        uint32_t FDPINID : 6;          /*!< [5:0] Fault Detect Pin ID */
        uint32_t FDBPEN : 1;           /*!< [6] Fault Detect Back Plane Enable */
        uint32_t FDEN : 1;             /*!< [7] Fault Detect Enable */
        uint32_t RESERVED0 : 1;        /*!< [8] Reserved */
        uint32_t FDSWW : 3;            /*!< [11:9] Fault Detect Sample Window Width */
        uint32_t FDPRS : 3;            /*!< [14:12] Fault Detect Clock Prescaler */
        uint32_t RESERVED1 : 17;       /*!< [31:15] Reserved */
    } B;
} hw_lcd_fdcr_t;

/*!
 * @name Constants and macros for entire LCD_FDCR register
 */
/*@{*/
#define HW_LCD_FDCR_ADDR(x)      ((uint32_t)(x) + 0x8U)

#define HW_LCD_FDCR(x)           (*(__IO hw_lcd_fdcr_t *) HW_LCD_FDCR_ADDR(x))
#define HW_LCD_FDCR_RD(x)        (HW_LCD_FDCR(x).U)
#define HW_LCD_FDCR_WR(x, v)     (HW_LCD_FDCR(x).U = (v))
#define HW_LCD_FDCR_SET(x, v)    (BME_OR32(HW_LCD_FDCR_ADDR(x), (uint32_t)(v)))
#define HW_LCD_FDCR_CLR(x, v)    (BME_AND32(HW_LCD_FDCR_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_FDCR_TOG(x, v)    (BME_XOR32(HW_LCD_FDCR_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_FDCR bitfields
 */

/*!
 * @name Register LCD_FDCR, field FDPINID[5:0] (RW)
 *
 * Specifies the LCD pin to be checked by pullup fault detection.
 *
 * Values:
 * - 0 - Fault detection for LCD_P0 pin.
 * - 1 - Fault detection for LCD_P1 pin.
 */
/*@{*/
#define BP_LCD_FDCR_FDPINID  (0U)          /*!< Bit position for LCD_FDCR_FDPINID. */
#define BM_LCD_FDCR_FDPINID  (0x0000003FU) /*!< Bit mask for LCD_FDCR_FDPINID. */
#define BS_LCD_FDCR_FDPINID  (6U)          /*!< Bit field size in bits for LCD_FDCR_FDPINID. */

/*! @brief Read current value of the LCD_FDCR_FDPINID field. */
#define BR_LCD_FDCR_FDPINID(x) (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDPINID, BS_LCD_FDCR_FDPINID))

/*! @brief Format value for bitfield LCD_FDCR_FDPINID. */
#define BF_LCD_FDCR_FDPINID(v) ((uint32_t)((uint32_t)(v) << BP_LCD_FDCR_FDPINID) & BM_LCD_FDCR_FDPINID)

/*! @brief Set the FDPINID field to a new value. */
#define BW_LCD_FDCR_FDPINID(x, v) (BME_BFI32(HW_LCD_FDCR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDCR_FDPINID), BP_LCD_FDCR_FDPINID, 6))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDBPEN[6] (RW)
 *
 * Enables "back plane" timing for the fault detect circuit. FDBPEN = 0
 * generates front plane timing. This bit specifies the type of pin selected under fault
 * detect test.
 *
 * Values:
 * - 0 - Type of the selected pin under fault detect test is front plane.
 * - 1 - Type of the selected pin under fault detect test is back plane.
 */
/*@{*/
#define BP_LCD_FDCR_FDBPEN   (6U)          /*!< Bit position for LCD_FDCR_FDBPEN. */
#define BM_LCD_FDCR_FDBPEN   (0x00000040U) /*!< Bit mask for LCD_FDCR_FDBPEN. */
#define BS_LCD_FDCR_FDBPEN   (1U)          /*!< Bit field size in bits for LCD_FDCR_FDBPEN. */

/*! @brief Read current value of the LCD_FDCR_FDBPEN field. */
#define BR_LCD_FDCR_FDBPEN(x) (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDBPEN, BS_LCD_FDCR_FDBPEN))

/*! @brief Format value for bitfield LCD_FDCR_FDBPEN. */
#define BF_LCD_FDCR_FDBPEN(v) ((uint32_t)((uint32_t)(v) << BP_LCD_FDCR_FDBPEN) & BM_LCD_FDCR_FDBPEN)

/*! @brief Set the FDBPEN field to a new value. */
#define BW_LCD_FDCR_FDBPEN(x, v) (BME_BFI32(HW_LCD_FDCR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDCR_FDBPEN), BP_LCD_FDCR_FDBPEN, 1))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDEN[7] (RW)
 *
 * If LCDEN is 1, asserting FDEN inserts a test frame after normal LCD refresh
 * frame is completed. After the test frame is done, Fault detection complete flag
 * (FDCF) is set. When the test frame is done, a normal LCD refresh frame
 * starts. FDEN is one-shot register, it clears after FDCF is set. To initiate another
 * fault detection, FDEN must be set again.
 *
 * Values:
 * - 0 - Disable fault detection.
 * - 1 - Enable fault detection.
 */
/*@{*/
#define BP_LCD_FDCR_FDEN     (7U)          /*!< Bit position for LCD_FDCR_FDEN. */
#define BM_LCD_FDCR_FDEN     (0x00000080U) /*!< Bit mask for LCD_FDCR_FDEN. */
#define BS_LCD_FDCR_FDEN     (1U)          /*!< Bit field size in bits for LCD_FDCR_FDEN. */

/*! @brief Read current value of the LCD_FDCR_FDEN field. */
#define BR_LCD_FDCR_FDEN(x)  (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDEN, BS_LCD_FDCR_FDEN))

/*! @brief Format value for bitfield LCD_FDCR_FDEN. */
#define BF_LCD_FDCR_FDEN(v)  ((uint32_t)((uint32_t)(v) << BP_LCD_FDCR_FDEN) & BM_LCD_FDCR_FDEN)

/*! @brief Set the FDEN field to a new value. */
#define BW_LCD_FDCR_FDEN(x, v) (BME_BFI32(HW_LCD_FDCR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDCR_FDEN), BP_LCD_FDCR_FDEN, 1))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDSWW[11:9] (RW)
 *
 * Specifies the sample window width of fault detection, in number of cycles in
 * the range from 4-512 (Sample window = 4*2 N ).
 *
 * Values:
 * - 0 - Sample window width is 4 sample clock cycles.
 * - 1 - Sample window width is 8 sample clock cycles.
 */
/*@{*/
#define BP_LCD_FDCR_FDSWW    (9U)          /*!< Bit position for LCD_FDCR_FDSWW. */
#define BM_LCD_FDCR_FDSWW    (0x00000E00U) /*!< Bit mask for LCD_FDCR_FDSWW. */
#define BS_LCD_FDCR_FDSWW    (3U)          /*!< Bit field size in bits for LCD_FDCR_FDSWW. */

/*! @brief Read current value of the LCD_FDCR_FDSWW field. */
#define BR_LCD_FDCR_FDSWW(x) (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDSWW, BS_LCD_FDCR_FDSWW))

