theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF47TO44_WF44 field. */
#define BR_LCD_WF47TO44_WF44(x) (BME_UBFX32(HW_LCD_WF47TO44_ADDR(x), BP_LCD_WF47TO44_WF44, BS_LCD_WF47TO44_WF44))

/*! @brief Format value for bitfield LCD_WF47TO44_WF44. */
#define BF_LCD_WF47TO44_WF44(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF47TO44_WF44) & BM_LCD_WF47TO44_WF44)

/*! @brief Set the WF44 field to a new value. */
#define BW_LCD_WF47TO44_WF44(x, v) (BME_BFI32(HW_LCD_WF47TO44_ADDR(x), ((uint32_t)(v) << BP_LCD_WF47TO44_WF44), BP_LCD_WF47TO44_WF44, 8))
/*@}*/

/*!
 * @name Register LCD_WF47TO44, field WF45[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P45 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF47TO44_WF45 (8U)          /*!< Bit position for LCD_WF47TO44_WF45. */
#define BM_LCD_WF47TO44_WF45 (0x0000FF00U) /*!< Bit mask for LCD_WF47TO44_WF45. */
#define BS_LCD_WF47TO44_WF45 (8U)          /*!< Bit field size in bits for LCD_WF47TO44_WF45. */

/*! @brief Read current value of the LCD_WF47TO44_WF45 field. */
#define BR_LCD_WF47TO44_WF45(x) (BME_UBFX32(HW_LCD_WF47TO44_ADDR(x), BP_LCD_WF47TO44_WF45, BS_LCD_WF47TO44_WF45))

/*! @brief Format value for bitfield LCD_WF47TO44_WF45. */
#define BF_LCD_WF47TO44_WF45(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF47TO44_WF45) & BM_LCD_WF47TO44_WF45)

/*! @brief Set the WF45 field to a new value. */
#define BW_LCD_WF47TO44_WF45(x, v) (BME_BFI32(HW_LCD_WF47TO44_ADDR(x), ((uint32_t)(v) << BP_LCD_WF47TO44_WF45), BP_LCD_WF47TO44_WF45, 8))
/*@}*/

/*!
 * @name Register LCD_WF47TO44, field WF46[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P46 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF47TO44_WF46 (16U)         /*!< Bit position for LCD_WF47TO44_WF46. */
#define BM_LCD_WF47TO44_WF46 (0x00FF0000U) /*!< Bit mask for LCD_WF47TO44_WF46. */
#define BS_LCD_WF47TO44_WF46 (8U)          /*!< Bit field size in bits for LCD_WF47TO44_WF46. */

/*! @brief Read current value of the LCD_WF47TO44_WF46 field. */
#define BR_LCD_WF47TO44_WF46(x) (BME_UBFX32(HW_LCD_WF47TO44_ADDR(x), BP_LCD_WF47TO44_WF46, BS_LCD_WF47TO44_WF46))

/*! @brief Format value for bitfield LCD_WF47TO44_WF46. */
#define BF_LCD_WF47TO44_WF46(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF47TO44_WF46) & BM_LCD_WF47TO44_WF46)

/*! @brief Set the WF46 field to a new value. */
#define BW_LCD_WF47TO44_WF46(x, v) (BME_BFI32(HW_LCD_WF47TO44_ADDR(x), ((uint32_t)(v) << BP_LCD_WF47TO44_WF46), BP_LCD_WF47TO44_WF46, 8))
/*@}*/

/*!
 * @name Register LCD_WF47TO44, field WF47[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P47 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF47TO44_WF47 (24U)         /*!< Bit position for LCD_WF47TO44_WF47. */
#define BM_LCD_WF47TO44_WF47 (0xFF000000U) /*!< Bit mask for LCD_WF47TO44_WF47. */
#define BS_LCD_WF47TO44_WF47 (8U)          /*!< Bit field size in bits for LCD_WF47TO44_WF47. */

/*! @brief Read current value of the LCD_WF47TO44_WF47 field. */
#define BR_LCD_WF47TO44_WF47(x) (BME_UBFX32(HW_LCD_WF47TO44_ADDR(x), BP_LCD_WF47TO44_WF47, BS_LCD_WF47TO44_WF47))

/*! @brief Format value for bitfield LCD_WF47TO44_WF47. */
#define BF_LCD_WF47TO44_WF47(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF47TO44_WF47) & BM_LCD_WF47TO44_WF47)

/*! @brief Set the WF47 field to a new value. */
#define BW_LCD_WF47TO44_WF47(x, v) (BME_BFI32(HW_LCD_WF47TO44_ADDR(x), ((uint32_t)(v) << BP_LCD_WF47TO44_WF47), BP_LCD_WF47TO44_WF47, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF51TO48 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF51TO48 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf51to48
{
    uint32_t U;
    struct _hw_lcd_wf51to48_bitfields
    {
        uint32_t WF48 : 8;             /*!< [7:0]  */
        uint32_t WF49 : 8;             /*!< [15:8]  */
        uint32_t WF50 : 8;             /*!< [23:16]  */
        uint32_t WF51 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf51to48_t;

/*!
 * @name Constants and macros for entire LCD_WF51TO48 register
 */
/*@{*/
#define HW_LCD_WF51TO48_ADDR(x)  ((uint32_t)(x) + 0x50U)

#define HW_LCD_WF51TO48(x)       (*(__IO hw_lcd_wf51to48_t *) HW_LCD_WF51TO48_ADDR(x))
#define HW_LCD_WF51TO48_RD(x)    (HW_LCD_WF51TO48(x).U)
#define HW_LCD_WF51TO48_WR(x, v) (HW_LCD_WF51TO48(x).U = (v))
#define HW_LCD_WF51TO48_SET(x, v) (BME_OR32(HW_LCD_WF51TO48_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF51TO48_CLR(x, v) (BME_AND32(HW_LCD_WF51TO48_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF51TO48_TOG(x, v) (BME_XOR32(HW_LCD_WF51TO48_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF51TO48 bitfields
 */

/*!
 * @name Register LCD_WF51TO48, field WF48[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P48 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF51TO48_WF48 (0U)          /*!< Bit position for LCD_WF51TO48_WF48. */
#define BM_LCD_WF51TO48_WF48 (0x000000FFU) /*!< Bit mask for LCD_WF51TO48_WF48. */
#define BS_LCD_WF51TO48_WF48 (8U)          /*!< Bit field size in bits for LCD_WF51TO48_WF48. */

/*! @brief Read current value of the LCD_WF51TO48_WF48 field. */
#define BR_LCD_WF51TO48_WF48(x) (BME_UBFX32(HW_LCD_WF51TO48_ADDR(x), BP_LCD_WF51TO48_WF48, BS_LCD_WF51TO48_WF48))

/*! @brief Format value for bitfield LCD_WF51TO48_WF48. */
#define BF_LCD_WF51TO48_WF48(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF51TO48_WF48) & BM_LCD_WF51TO48_WF48)

/*! @brief Set the WF48 field to a new value. */
#define BW_LCD_WF51TO48_WF48(x, v) (BME_BFI32(HW_LCD_WF51TO48_ADDR(x), ((uint32_t)(v) << BP_LCD_WF51TO48_WF48), BP_LCD_WF51TO48_WF48, 8))
/*@}*/

/*!
 * @name Register LCD_WF51TO48, field WF49[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P49 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF51TO48_WF49 (8U)          /*!< Bit position for LCD_WF51TO48_WF49. */
#define BM_LCD_WF51TO48_WF49 (0x0000FF00U) /*!< Bit mask for LCD_WF51TO48_WF49. */
#define BS_LCD_WF51TO48_WF49 (8U)          /*!< Bit field size in bits for LCD_WF51TO48_WF49. */

