theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF51TO48_WF49 field. */
#define BR_LCD_WF51TO48_WF49(x) (BME_UBFX32(HW_LCD_WF51TO48_ADDR(x), BP_LCD_WF51TO48_WF49, BS_LCD_WF51TO48_WF49))

/*! @brief Format value for bitfield LCD_WF51TO48_WF49. */
#define BF_LCD_WF51TO48_WF49(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF51TO48_WF49) & BM_LCD_WF51TO48_WF49)

/*! @brief Set the WF49 field to a new value. */
#define BW_LCD_WF51TO48_WF49(x, v) (BME_BFI32(HW_LCD_WF51TO48_ADDR(x), ((uint32_t)(v) << BP_LCD_WF51TO48_WF49), BP_LCD_WF51TO48_WF49, 8))
/*@}*/

/*!
 * @name Register LCD_WF51TO48, field WF50[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P50 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF51TO48_WF50 (16U)         /*!< Bit position for LCD_WF51TO48_WF50. */
#define BM_LCD_WF51TO48_WF50 (0x00FF0000U) /*!< Bit mask for LCD_WF51TO48_WF50. */
#define BS_LCD_WF51TO48_WF50 (8U)          /*!< Bit field size in bits for LCD_WF51TO48_WF50. */

/*! @brief Read current value of the LCD_WF51TO48_WF50 field. */
#define BR_LCD_WF51TO48_WF50(x) (BME_UBFX32(HW_LCD_WF51TO48_ADDR(x), BP_LCD_WF51TO48_WF50, BS_LCD_WF51TO48_WF50))

/*! @brief Format value for bitfield LCD_WF51TO48_WF50. */
#define BF_LCD_WF51TO48_WF50(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF51TO48_WF50) & BM_LCD_WF51TO48_WF50)

/*! @brief Set the WF50 field to a new value. */
#define BW_LCD_WF51TO48_WF50(x, v) (BME_BFI32(HW_LCD_WF51TO48_ADDR(x), ((uint32_t)(v) << BP_LCD_WF51TO48_WF50), BP_LCD_WF51TO48_WF50, 8))
/*@}*/

/*!
 * @name Register LCD_WF51TO48, field WF51[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P51 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF51TO48_WF51 (24U)         /*!< Bit position for LCD_WF51TO48_WF51. */
#define BM_LCD_WF51TO48_WF51 (0xFF000000U) /*!< Bit mask for LCD_WF51TO48_WF51. */
#define BS_LCD_WF51TO48_WF51 (8U)          /*!< Bit field size in bits for LCD_WF51TO48_WF51. */

/*! @brief Read current value of the LCD_WF51TO48_WF51 field. */
#define BR_LCD_WF51TO48_WF51(x) (BME_UBFX32(HW_LCD_WF51TO48_ADDR(x), BP_LCD_WF51TO48_WF51, BS_LCD_WF51TO48_WF51))

/*! @brief Format value for bitfield LCD_WF51TO48_WF51. */
#define BF_LCD_WF51TO48_WF51(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF51TO48_WF51) & BM_LCD_WF51TO48_WF51)

/*! @brief Set the WF51 field to a new value. */
#define BW_LCD_WF51TO48_WF51(x, v) (BME_BFI32(HW_LCD_WF51TO48_ADDR(x), ((uint32_t)(v) << BP_LCD_WF51TO48_WF51), BP_LCD_WF51TO48_WF51, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF55TO52 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF55TO52 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf55to52
{
    uint32_t U;
    struct _hw_lcd_wf55to52_bitfields
    {
        uint32_t WF52 : 8;             /*!< [7:0]  */
        uint32_t WF53 : 8;             /*!< [15:8]  */
        uint32_t WF54 : 8;             /*!< [23:16]  */
        uint32_t WF55 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf55to52_t;

/*!
 * @name Constants and macros for entire LCD_WF55TO52 register
 */
/*@{*/
#define HW_LCD_WF55TO52_ADDR(x)  ((uint32_t)(x) + 0x54U)

#define HW_LCD_WF55TO52(x)       (*(__IO hw_lcd_wf55to52_t *) HW_LCD_WF55TO52_ADDR(x))
#define HW_LCD_WF55TO52_RD(x)    (HW_LCD_WF55TO52(x).U)
#define HW_LCD_WF55TO52_WR(x, v) (HW_LCD_WF55TO52(x).U = (v))
#define HW_LCD_WF55TO52_SET(x, v) (BME_OR32(HW_LCD_WF55TO52_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF55TO52_CLR(x, v) (BME_AND32(HW_LCD_WF55TO52_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF55TO52_TOG(x, v) (BME_XOR32(HW_LCD_WF55TO52_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF55TO52 bitfields
 */

/*!
 * @name Register LCD_WF55TO52, field WF52[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P52 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF55TO52_WF52 (0U)          /*!< Bit position for LCD_WF55TO52_WF52. */
#define BM_LCD_WF55TO52_WF52 (0x000000FFU) /*!< Bit mask for LCD_WF55TO52_WF52. */
#define BS_LCD_WF55TO52_WF52 (8U)          /*!< Bit field size in bits for LCD_WF55TO52_WF52. */

/*! @brief Read current value of the LCD_WF55TO52_WF52 field. */
#define BR_LCD_WF55TO52_WF52(x) (BME_UBFX32(HW_LCD_WF55TO52_ADDR(x), BP_LCD_WF55TO52_WF52, BS_LCD_WF55TO52_WF52))

/*! @brief Format value for bitfield LCD_WF55TO52_WF52. */
#define BF_LCD_WF55TO52_WF52(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF55TO52_WF52) & BM_LCD_WF55TO52_WF52)

/*! @brief Set the WF52 field to a new value. */
#define BW_LCD_WF55TO52_WF52(x, v) (BME_BFI32(HW_LCD_WF55TO52_ADDR(x), ((uint32_t)(v) << BP_LCD_WF55TO52_WF52), BP_LCD_WF55TO52_WF52, 8))
/*@}*/

/*!
 * @name Register LCD_WF55TO52, field WF53[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P53 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF55TO52_WF53 (8U)          /*!< Bit position for LCD_WF55TO52_WF53. */
#define BM_LCD_WF55TO52_WF53 (0x0000FF00U) /*!< Bit mask for LCD_WF55TO52_WF53. */
#define BS_LCD_WF55TO52_WF53 (8U)          /*!< Bit field size in bits for LCD_WF55TO52_WF53. */

/*! @brief Read current value of the LCD_WF55TO52_WF53 field. */
#define BR_LCD_WF55TO52_WF53(x) (BME_UBFX32(HW_LCD_WF55TO52_ADDR(x), BP_LCD_WF55TO52_WF53, BS_LCD_WF55TO52_WF53))

/*! @brief Format value for bitfield LCD_WF55TO52_WF53. */
#define BF_LCD_WF55TO52_WF53(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF55TO52_WF53) & BM_LCD_WF55TO52_WF53)

/*! @brief Set the WF53 field to a new value. */
#define BW_LCD_WF55TO52_WF53(x, v) (BME_BFI32(HW_LCD_WF55TO52_ADDR(x), ((uint32_t)(v) << BP_LCD_WF55TO52_WF53), BP_LCD_WF55TO52_WF53, 8))
/*@}*/

/*!
 * @name Register LCD_WF55TO52, field WF54[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P54 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF55TO52_WF54 (16U)         /*!< Bit position for LCD_WF55TO52_WF54. */
#define BM_LCD_WF55TO52_WF54 (0x00FF0000U) /*!< Bit mask for LCD_WF55TO52_WF54. */
#define BS_LCD_WF55TO52_WF54 (8U)          /*!< Bit field size in bits for LCD_WF55TO52_WF54. */

/*! @brief Read current value of the LCD_WF55TO52_WF54 field. */
#define BR_LCD_WF55TO52_WF54(x) (BME_UBFX32(HW_LCD_WF55TO52_ADDR(x), BP_LCD_WF55TO52_WF54, BS_LCD_WF55TO52_WF54))

