theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield LCD_WF2_BPBLCD2. */
#define BF_LCD_WF2_BPBLCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPBLCD2) & BM_LCD_WF2_BPBLCD2)

/*! @brief Set the BPBLCD2 field to a new value. */
#define BW_LCD_WF2_BPBLCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPBLCD2), BP_LCD_WF2_BPBLCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPCLCD2[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF2_BPCLCD2   (2U)          /*!< Bit position for LCD_WF2_BPCLCD2. */
#define BM_LCD_WF2_BPCLCD2   (0x04U)       /*!< Bit mask for LCD_WF2_BPCLCD2. */
#define BS_LCD_WF2_BPCLCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPCLCD2. */

/*! @brief Read current value of the LCD_WF2_BPCLCD2 field. */
#define BR_LCD_WF2_BPCLCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPCLCD2, BS_LCD_WF2_BPCLCD2))

/*! @brief Format value for bitfield LCD_WF2_BPCLCD2. */
#define BF_LCD_WF2_BPCLCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPCLCD2) & BM_LCD_WF2_BPCLCD2)

/*! @brief Set the BPCLCD2 field to a new value. */
#define BW_LCD_WF2_BPCLCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPCLCD2), BP_LCD_WF2_BPCLCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPDLCD2[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF2_BPDLCD2   (3U)          /*!< Bit position for LCD_WF2_BPDLCD2. */
#define BM_LCD_WF2_BPDLCD2   (0x08U)       /*!< Bit mask for LCD_WF2_BPDLCD2. */
#define BS_LCD_WF2_BPDLCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPDLCD2. */

/*! @brief Read current value of the LCD_WF2_BPDLCD2 field. */
#define BR_LCD_WF2_BPDLCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPDLCD2, BS_LCD_WF2_BPDLCD2))

/*! @brief Format value for bitfield LCD_WF2_BPDLCD2. */
#define BF_LCD_WF2_BPDLCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPDLCD2) & BM_LCD_WF2_BPDLCD2)

/*! @brief Set the BPDLCD2 field to a new value. */
#define BW_LCD_WF2_BPDLCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPDLCD2), BP_LCD_WF2_BPDLCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPELCD2[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF2_BPELCD2   (4U)          /*!< Bit position for LCD_WF2_BPELCD2. */
#define BM_LCD_WF2_BPELCD2   (0x10U)       /*!< Bit mask for LCD_WF2_BPELCD2. */
#define BS_LCD_WF2_BPELCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPELCD2. */

/*! @brief Read current value of the LCD_WF2_BPELCD2 field. */
#define BR_LCD_WF2_BPELCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPELCD2, BS_LCD_WF2_BPELCD2))

/*! @brief Format value for bitfield LCD_WF2_BPELCD2. */
#define BF_LCD_WF2_BPELCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPELCD2) & BM_LCD_WF2_BPELCD2)

/*! @brief Set the BPELCD2 field to a new value. */
#define BW_LCD_WF2_BPELCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPELCD2), BP_LCD_WF2_BPELCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPFLCD2[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF2_BPFLCD2   (5U)          /*!< Bit position for LCD_WF2_BPFLCD2. */
#define BM_LCD_WF2_BPFLCD2   (0x20U)       /*!< Bit mask for LCD_WF2_BPFLCD2. */
#define BS_LCD_WF2_BPFLCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPFLCD2. */

/*! @brief Read current value of the LCD_WF2_BPFLCD2 field. */
#define BR_LCD_WF2_BPFLCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPFLCD2, BS_LCD_WF2_BPFLCD2))

/*! @brief Format value for bitfield LCD_WF2_BPFLCD2. */
#define BF_LCD_WF2_BPFLCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPFLCD2) & BM_LCD_WF2_BPFLCD2)

/*! @brief Set the BPFLCD2 field to a new value. */
#define BW_LCD_WF2_BPFLCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPFLCD2), BP_LCD_WF2_BPFLCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPGLCD2[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF2_BPGLCD2   (6U)          /*!< Bit position for LCD_WF2_BPGLCD2. */
#define BM_LCD_WF2_BPGLCD2   (0x40U)       /*!< Bit mask for LCD_WF2_BPGLCD2. */
#define BS_LCD_WF2_BPGLCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPGLCD2. */

/*! @brief Read current value of the LCD_WF2_BPGLCD2 field. */
#define BR_LCD_WF2_BPGLCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPGLCD2, BS_LCD_WF2_BPGLCD2))

/*! @brief Format value for bitfield LCD_WF2_BPGLCD2. */
#define BF_LCD_WF2_BPGLCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPGLCD2) & BM_LCD_WF2_BPGLCD2)

/*! @brief Set the BPGLCD2 field to a new value. */
#define BW_LCD_WF2_BPGLCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPGLCD2), BP_LCD_WF2_BPGLCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPHLCD2[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF2_BPHLCD2   (7U)          /*!< Bit position for LCD_WF2_BPHLCD2. */
#define BM_LCD_WF2_BPHLCD2   (0x80U)       /*!< Bit mask for LCD_WF2_BPHLCD2. */
#define BS_LCD_WF2_BPHLCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPHLCD2. */

/*! @brief Read current value of the LCD_WF2_BPHLCD2 field. */
#define BR_LCD_WF2_BPHLCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPHLCD2, BS_LCD_WF2_BPHLCD2))

/*! @brief Format value for bitfield LCD_WF2_BPHLCD2. */
#define BF_LCD_WF2_BPHLCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPHLCD2) & BM_LCD_WF2_BPHLCD2)

/*! @brief Set the BPHLCD2 field to a new value. */
#define BW_LCD_WF2_BPHLCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPHLCD2), BP_LCD_WF2_BPHLCD2, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF3 - LCD Waveform Register 3.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF3 - LCD Waveform Register 3. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf3
{
    uint8_t U;
    struct _hw_lcd_wf3_bitfields
    {
        uint8_t BPALCD3 : 1;           /*!< [0]  */
        uint8_t BPBLCD3 : 1;           /*!< [1]  */
        uint8_t BPCLCD3 : 1;           /*!< [2]  */
        uint8_t BPDLCD3 : 1;           /*!< [3]  */
        uint8_t BPELCD3 : 1;           /*!< [4]  */
        uint8_t BPFLCD3 : 1;           /*!< [5]  */
        uint8_t BPGLCD3 : 1;           /*!< [6]  */
        uint8_t BPHLCD3 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf3_t;

/*!
 * @name Constants and macros for entire LCD_WF3 register
 */
/*@{*/
#define HW_LCD_WF3_ADDR(x)       ((uint32_t)(x) + 0x23U)

