theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
#define HW_LCD_WF3(x)            (*(__IO hw_lcd_wf3_t *) HW_LCD_WF3_ADDR(x))
#define HW_LCD_WF3_RD(x)         (HW_LCD_WF3(x).U)
#define HW_LCD_WF3_WR(x, v)      (HW_LCD_WF3(x).U = (v))
#define HW_LCD_WF3_SET(x, v)     (BME_OR8(HW_LCD_WF3_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF3_CLR(x, v)     (BME_AND8(HW_LCD_WF3_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF3_TOG(x, v)     (BME_XOR8(HW_LCD_WF3_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF3 bitfields
 */

/*!
 * @name Register LCD_WF3, field BPALCD3[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF3_BPALCD3   (0U)          /*!< Bit position for LCD_WF3_BPALCD3. */
#define BM_LCD_WF3_BPALCD3   (0x01U)       /*!< Bit mask for LCD_WF3_BPALCD3. */
#define BS_LCD_WF3_BPALCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPALCD3. */

/*! @brief Read current value of the LCD_WF3_BPALCD3 field. */
#define BR_LCD_WF3_BPALCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPALCD3, BS_LCD_WF3_BPALCD3))

/*! @brief Format value for bitfield LCD_WF3_BPALCD3. */
#define BF_LCD_WF3_BPALCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPALCD3) & BM_LCD_WF3_BPALCD3)

/*! @brief Set the BPALCD3 field to a new value. */
#define BW_LCD_WF3_BPALCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPALCD3), BP_LCD_WF3_BPALCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPBLCD3[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF3_BPBLCD3   (1U)          /*!< Bit position for LCD_WF3_BPBLCD3. */
#define BM_LCD_WF3_BPBLCD3   (0x02U)       /*!< Bit mask for LCD_WF3_BPBLCD3. */
#define BS_LCD_WF3_BPBLCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPBLCD3. */

/*! @brief Read current value of the LCD_WF3_BPBLCD3 field. */
#define BR_LCD_WF3_BPBLCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPBLCD3, BS_LCD_WF3_BPBLCD3))

/*! @brief Format value for bitfield LCD_WF3_BPBLCD3. */
#define BF_LCD_WF3_BPBLCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPBLCD3) & BM_LCD_WF3_BPBLCD3)

/*! @brief Set the BPBLCD3 field to a new value. */
#define BW_LCD_WF3_BPBLCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPBLCD3), BP_LCD_WF3_BPBLCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPCLCD3[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF3_BPCLCD3   (2U)          /*!< Bit position for LCD_WF3_BPCLCD3. */
#define BM_LCD_WF3_BPCLCD3   (0x04U)       /*!< Bit mask for LCD_WF3_BPCLCD3. */
#define BS_LCD_WF3_BPCLCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPCLCD3. */

/*! @brief Read current value of the LCD_WF3_BPCLCD3 field. */
#define BR_LCD_WF3_BPCLCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPCLCD3, BS_LCD_WF3_BPCLCD3))

/*! @brief Format value for bitfield LCD_WF3_BPCLCD3. */
#define BF_LCD_WF3_BPCLCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPCLCD3) & BM_LCD_WF3_BPCLCD3)

/*! @brief Set the BPCLCD3 field to a new value. */
#define BW_LCD_WF3_BPCLCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPCLCD3), BP_LCD_WF3_BPCLCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPDLCD3[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF3_BPDLCD3   (3U)          /*!< Bit position for LCD_WF3_BPDLCD3. */
#define BM_LCD_WF3_BPDLCD3   (0x08U)       /*!< Bit mask for LCD_WF3_BPDLCD3. */
#define BS_LCD_WF3_BPDLCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPDLCD3. */

/*! @brief Read current value of the LCD_WF3_BPDLCD3 field. */
#define BR_LCD_WF3_BPDLCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPDLCD3, BS_LCD_WF3_BPDLCD3))

/*! @brief Format value for bitfield LCD_WF3_BPDLCD3. */
#define BF_LCD_WF3_BPDLCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPDLCD3) & BM_LCD_WF3_BPDLCD3)

/*! @brief Set the BPDLCD3 field to a new value. */
#define BW_LCD_WF3_BPDLCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPDLCD3), BP_LCD_WF3_BPDLCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPELCD3[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF3_BPELCD3   (4U)          /*!< Bit position for LCD_WF3_BPELCD3. */
#define BM_LCD_WF3_BPELCD3   (0x10U)       /*!< Bit mask for LCD_WF3_BPELCD3. */
#define BS_LCD_WF3_BPELCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPELCD3. */

/*! @brief Read current value of the LCD_WF3_BPELCD3 field. */
#define BR_LCD_WF3_BPELCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPELCD3, BS_LCD_WF3_BPELCD3))

/*! @brief Format value for bitfield LCD_WF3_BPELCD3. */
#define BF_LCD_WF3_BPELCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPELCD3) & BM_LCD_WF3_BPELCD3)

/*! @brief Set the BPELCD3 field to a new value. */
#define BW_LCD_WF3_BPELCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPELCD3), BP_LCD_WF3_BPELCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPFLCD3[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF3_BPFLCD3   (5U)          /*!< Bit position for LCD_WF3_BPFLCD3. */
#define BM_LCD_WF3_BPFLCD3   (0x20U)       /*!< Bit mask for LCD_WF3_BPFLCD3. */
#define BS_LCD_WF3_BPFLCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPFLCD3. */

/*! @brief Read current value of the LCD_WF3_BPFLCD3 field. */
#define BR_LCD_WF3_BPFLCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPFLCD3, BS_LCD_WF3_BPFLCD3))

/*! @brief Format value for bitfield LCD_WF3_BPFLCD3. */
#define BF_LCD_WF3_BPFLCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPFLCD3) & BM_LCD_WF3_BPFLCD3)

