theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield LCD_WF7_BPCLCD7. */
#define BF_LCD_WF7_BPCLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPCLCD7) & BM_LCD_WF7_BPCLCD7)

/*! @brief Set the BPCLCD7 field to a new value. */
#define BW_LCD_WF7_BPCLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPCLCD7), BP_LCD_WF7_BPCLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPDLCD7[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF7_BPDLCD7   (3U)          /*!< Bit position for LCD_WF7_BPDLCD7. */
#define BM_LCD_WF7_BPDLCD7   (0x08U)       /*!< Bit mask for LCD_WF7_BPDLCD7. */
#define BS_LCD_WF7_BPDLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPDLCD7. */

/*! @brief Read current value of the LCD_WF7_BPDLCD7 field. */
#define BR_LCD_WF7_BPDLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPDLCD7, BS_LCD_WF7_BPDLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPDLCD7. */
#define BF_LCD_WF7_BPDLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPDLCD7) & BM_LCD_WF7_BPDLCD7)

/*! @brief Set the BPDLCD7 field to a new value. */
#define BW_LCD_WF7_BPDLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPDLCD7), BP_LCD_WF7_BPDLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPELCD7[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF7_BPELCD7   (4U)          /*!< Bit position for LCD_WF7_BPELCD7. */
#define BM_LCD_WF7_BPELCD7   (0x10U)       /*!< Bit mask for LCD_WF7_BPELCD7. */
#define BS_LCD_WF7_BPELCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPELCD7. */

/*! @brief Read current value of the LCD_WF7_BPELCD7 field. */
#define BR_LCD_WF7_BPELCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPELCD7, BS_LCD_WF7_BPELCD7))

/*! @brief Format value for bitfield LCD_WF7_BPELCD7. */
#define BF_LCD_WF7_BPELCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPELCD7) & BM_LCD_WF7_BPELCD7)

/*! @brief Set the BPELCD7 field to a new value. */
#define BW_LCD_WF7_BPELCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPELCD7), BP_LCD_WF7_BPELCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPFLCD7[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF7_BPFLCD7   (5U)          /*!< Bit position for LCD_WF7_BPFLCD7. */
#define BM_LCD_WF7_BPFLCD7   (0x20U)       /*!< Bit mask for LCD_WF7_BPFLCD7. */
#define BS_LCD_WF7_BPFLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPFLCD7. */

/*! @brief Read current value of the LCD_WF7_BPFLCD7 field. */
#define BR_LCD_WF7_BPFLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPFLCD7, BS_LCD_WF7_BPFLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPFLCD7. */
#define BF_LCD_WF7_BPFLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPFLCD7) & BM_LCD_WF7_BPFLCD7)

/*! @brief Set the BPFLCD7 field to a new value. */
#define BW_LCD_WF7_BPFLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPFLCD7), BP_LCD_WF7_BPFLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPGLCD7[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF7_BPGLCD7   (6U)          /*!< Bit position for LCD_WF7_BPGLCD7. */
#define BM_LCD_WF7_BPGLCD7   (0x40U)       /*!< Bit mask for LCD_WF7_BPGLCD7. */
#define BS_LCD_WF7_BPGLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPGLCD7. */

/*! @brief Read current value of the LCD_WF7_BPGLCD7 field. */
#define BR_LCD_WF7_BPGLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPGLCD7, BS_LCD_WF7_BPGLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPGLCD7. */
#define BF_LCD_WF7_BPGLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPGLCD7) & BM_LCD_WF7_BPGLCD7)

/*! @brief Set the BPGLCD7 field to a new value. */
#define BW_LCD_WF7_BPGLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPGLCD7), BP_LCD_WF7_BPGLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPHLCD7[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF7_BPHLCD7   (7U)          /*!< Bit position for LCD_WF7_BPHLCD7. */
#define BM_LCD_WF7_BPHLCD7   (0x80U)       /*!< Bit mask for LCD_WF7_BPHLCD7. */
#define BS_LCD_WF7_BPHLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPHLCD7. */

/*! @brief Read current value of the LCD_WF7_BPHLCD7 field. */
#define BR_LCD_WF7_BPHLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPHLCD7, BS_LCD_WF7_BPHLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPHLCD7. */
#define BF_LCD_WF7_BPHLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPHLCD7) & BM_LCD_WF7_BPHLCD7)

/*! @brief Set the BPHLCD7 field to a new value. */
#define BW_LCD_WF7_BPHLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPHLCD7), BP_LCD_WF7_BPHLCD7, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF8 - LCD Waveform Register 8.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF8 - LCD Waveform Register 8. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf8
{
    uint8_t U;
    struct _hw_lcd_wf8_bitfields
    {
        uint8_t BPALCD8 : 1;           /*!< [0]  */
        uint8_t BPBLCD8 : 1;           /*!< [1]  */
        uint8_t BPCLCD8 : 1;           /*!< [2]  */
        uint8_t BPDLCD8 : 1;           /*!< [3]  */
        uint8_t BPELCD8 : 1;           /*!< [4]  */
        uint8_t BPFLCD8 : 1;           /*!< [5]  */
        uint8_t BPGLCD8 : 1;           /*!< [6]  */
        uint8_t BPHLCD8 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf8_t;

/*!
 * @name Constants and macros for entire LCD_WF8 register
 */
/*@{*/
#define HW_LCD_WF8_ADDR(x)       ((uint32_t)(x) + 0x28U)

#define HW_LCD_WF8(x)            (*(__IO hw_lcd_wf8_t *) HW_LCD_WF8_ADDR(x))
#define HW_LCD_WF8_RD(x)         (HW_LCD_WF8(x).U)
#define HW_LCD_WF8_WR(x, v)      (HW_LCD_WF8(x).U = (v))
#define HW_LCD_WF8_SET(x, v)     (BME_OR8(HW_LCD_WF8_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF8_CLR(x, v)     (BME_AND8(HW_LCD_WF8_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF8_TOG(x, v)     (BME_XOR8(HW_LCD_WF8_ADDR(x), (uint8_t)(v)))
/*@}*/

