theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*
 * Constants & macros for individual LCD_WF8 bitfields
 */

/*!
 * @name Register LCD_WF8, field BPALCD8[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF8_BPALCD8   (0U)          /*!< Bit position for LCD_WF8_BPALCD8. */
#define BM_LCD_WF8_BPALCD8   (0x01U)       /*!< Bit mask for LCD_WF8_BPALCD8. */
#define BS_LCD_WF8_BPALCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPALCD8. */

/*! @brief Read current value of the LCD_WF8_BPALCD8 field. */
#define BR_LCD_WF8_BPALCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPALCD8, BS_LCD_WF8_BPALCD8))

/*! @brief Format value for bitfield LCD_WF8_BPALCD8. */
#define BF_LCD_WF8_BPALCD8(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF8_BPALCD8) & BM_LCD_WF8_BPALCD8)

/*! @brief Set the BPALCD8 field to a new value. */
#define BW_LCD_WF8_BPALCD8(x, v) (BME_BFI8(HW_LCD_WF8_ADDR(x), ((uint8_t)(v) << BP_LCD_WF8_BPALCD8), BP_LCD_WF8_BPALCD8, 1))
/*@}*/

/*!
 * @name Register LCD_WF8, field BPBLCD8[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF8_BPBLCD8   (1U)          /*!< Bit position for LCD_WF8_BPBLCD8. */
#define BM_LCD_WF8_BPBLCD8   (0x02U)       /*!< Bit mask for LCD_WF8_BPBLCD8. */
#define BS_LCD_WF8_BPBLCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPBLCD8. */

/*! @brief Read current value of the LCD_WF8_BPBLCD8 field. */
#define BR_LCD_WF8_BPBLCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPBLCD8, BS_LCD_WF8_BPBLCD8))

/*! @brief Format value for bitfield LCD_WF8_BPBLCD8. */
#define BF_LCD_WF8_BPBLCD8(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF8_BPBLCD8) & BM_LCD_WF8_BPBLCD8)

/*! @brief Set the BPBLCD8 field to a new value. */
#define BW_LCD_WF8_BPBLCD8(x, v) (BME_BFI8(HW_LCD_WF8_ADDR(x), ((uint8_t)(v) << BP_LCD_WF8_BPBLCD8), BP_LCD_WF8_BPBLCD8, 1))
/*@}*/

/*!
 * @name Register LCD_WF8, field BPCLCD8[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF8_BPCLCD8   (2U)          /*!< Bit position for LCD_WF8_BPCLCD8. */
#define BM_LCD_WF8_BPCLCD8   (0x04U)       /*!< Bit mask for LCD_WF8_BPCLCD8. */
#define BS_LCD_WF8_BPCLCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPCLCD8. */

/*! @brief Read current value of the LCD_WF8_BPCLCD8 field. */
#define BR_LCD_WF8_BPCLCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPCLCD8, BS_LCD_WF8_BPCLCD8))

/*! @brief Format value for bitfield LCD_WF8_BPCLCD8. */
#define BF_LCD_WF8_BPCLCD8(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF8_BPCLCD8) & BM_LCD_WF8_BPCLCD8)

/*! @brief Set the BPCLCD8 field to a new value. */
#define BW_LCD_WF8_BPCLCD8(x, v) (BME_BFI8(HW_LCD_WF8_ADDR(x), ((uint8_t)(v) << BP_LCD_WF8_BPCLCD8), BP_LCD_WF8_BPCLCD8, 1))
/*@}*/

/*!
 * @name Register LCD_WF8, field BPDLCD8[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF8_BPDLCD8   (3U)          /*!< Bit position for LCD_WF8_BPDLCD8. */
#define BM_LCD_WF8_BPDLCD8   (0x08U)       /*!< Bit mask for LCD_WF8_BPDLCD8. */
#define BS_LCD_WF8_BPDLCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPDLCD8. */

/*! @brief Read current value of the LCD_WF8_BPDLCD8 field. */
#define BR_LCD_WF8_BPDLCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPDLCD8, BS_LCD_WF8_BPDLCD8))

/*! @brief Format value for bitfield LCD_WF8_BPDLCD8. */
#define BF_LCD_WF8_BPDLCD8(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF8_BPDLCD8) & BM_LCD_WF8_BPDLCD8)

/*! @brief Set the BPDLCD8 field to a new value. */
#define BW_LCD_WF8_BPDLCD8(x, v) (BME_BFI8(HW_LCD_WF8_ADDR(x), ((uint8_t)(v) << BP_LCD_WF8_BPDLCD8), BP_LCD_WF8_BPDLCD8, 1))
/*@}*/

/*!
 * @name Register LCD_WF8, field BPELCD8[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF8_BPELCD8   (4U)          /*!< Bit position for LCD_WF8_BPELCD8. */
#define BM_LCD_WF8_BPELCD8   (0x10U)       /*!< Bit mask for LCD_WF8_BPELCD8. */
#define BS_LCD_WF8_BPELCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPELCD8. */

/*! @brief Read current value of the LCD_WF8_BPELCD8 field. */
#define BR_LCD_WF8_BPELCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPELCD8, BS_LCD_WF8_BPELCD8))

/*! @brief Format value for bitfield LCD_WF8_BPELCD8. */
#define BF_LCD_WF8_BPELCD8(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF8_BPELCD8) & BM_LCD_WF8_BPELCD8)

/*! @brief Set the BPELCD8 field to a new value. */
#define BW_LCD_WF8_BPELCD8(x, v) (BME_BFI8(HW_LCD_WF8_ADDR(x), ((uint8_t)(v) << BP_LCD_WF8_BPELCD8), BP_LCD_WF8_BPELCD8, 1))
/*@}*/

/*!
 * @name Register LCD_WF8, field BPFLCD8[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF8_BPFLCD8   (5U)          /*!< Bit position for LCD_WF8_BPFLCD8. */
#define BM_LCD_WF8_BPFLCD8   (0x20U)       /*!< Bit mask for LCD_WF8_BPFLCD8. */
#define BS_LCD_WF8_BPFLCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPFLCD8. */

/*! @brief Read current value of the LCD_WF8_BPFLCD8 field. */
#define BR_LCD_WF8_BPFLCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPFLCD8, BS_LCD_WF8_BPFLCD8))

/*! @brief Format value for bitfield LCD_WF8_BPFLCD8. */
#define BF_LCD_WF8_BPFLCD8(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF8_BPFLCD8) & BM_LCD_WF8_BPFLCD8)

/*! @brief Set the BPFLCD8 field to a new value. */
#define BW_LCD_WF8_BPFLCD8(x, v) (BME_BFI8(HW_LCD_WF8_ADDR(x), ((uint8_t)(v) << BP_LCD_WF8_BPFLCD8), BP_LCD_WF8_BPFLCD8, 1))
/*@}*/

/*!
 * @name Register LCD_WF8, field BPGLCD8[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF8_BPGLCD8   (6U)          /*!< Bit position for LCD_WF8_BPGLCD8. */
#define BM_LCD_WF8_BPGLCD8   (0x40U)       /*!< Bit mask for LCD_WF8_BPGLCD8. */
#define BS_LCD_WF8_BPGLCD8   (1U)          /*!< Bit field size in bits for LCD_WF8_BPGLCD8. */

/*! @brief Read current value of the LCD_WF8_BPGLCD8 field. */
#define BR_LCD_WF8_BPGLCD8(x) (BME_UBFX8(HW_LCD_WF8_ADDR(x), BP_LCD_WF8_BPGLCD8, BS_LCD_WF8_BPGLCD8))

