theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
#define HW_LCD_WF14(x)           (*(__IO hw_lcd_wf14_t *) HW_LCD_WF14_ADDR(x))
#define HW_LCD_WF14_RD(x)        (HW_LCD_WF14(x).U)
#define HW_LCD_WF14_WR(x, v)     (HW_LCD_WF14(x).U = (v))
#define HW_LCD_WF14_SET(x, v)    (BME_OR8(HW_LCD_WF14_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF14_CLR(x, v)    (BME_AND8(HW_LCD_WF14_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF14_TOG(x, v)    (BME_XOR8(HW_LCD_WF14_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF14 bitfields
 */

/*!
 * @name Register LCD_WF14, field BPALCD14[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF14_BPALCD14 (0U)          /*!< Bit position for LCD_WF14_BPALCD14. */
#define BM_LCD_WF14_BPALCD14 (0x01U)       /*!< Bit mask for LCD_WF14_BPALCD14. */
#define BS_LCD_WF14_BPALCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPALCD14. */

/*! @brief Read current value of the LCD_WF14_BPALCD14 field. */
#define BR_LCD_WF14_BPALCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPALCD14, BS_LCD_WF14_BPALCD14))

/*! @brief Format value for bitfield LCD_WF14_BPALCD14. */
#define BF_LCD_WF14_BPALCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPALCD14) & BM_LCD_WF14_BPALCD14)

/*! @brief Set the BPALCD14 field to a new value. */
#define BW_LCD_WF14_BPALCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPALCD14), BP_LCD_WF14_BPALCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPBLCD14[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF14_BPBLCD14 (1U)          /*!< Bit position for LCD_WF14_BPBLCD14. */
#define BM_LCD_WF14_BPBLCD14 (0x02U)       /*!< Bit mask for LCD_WF14_BPBLCD14. */
#define BS_LCD_WF14_BPBLCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPBLCD14. */

/*! @brief Read current value of the LCD_WF14_BPBLCD14 field. */
#define BR_LCD_WF14_BPBLCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPBLCD14, BS_LCD_WF14_BPBLCD14))

/*! @brief Format value for bitfield LCD_WF14_BPBLCD14. */
#define BF_LCD_WF14_BPBLCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPBLCD14) & BM_LCD_WF14_BPBLCD14)

/*! @brief Set the BPBLCD14 field to a new value. */
#define BW_LCD_WF14_BPBLCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPBLCD14), BP_LCD_WF14_BPBLCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPCLCD14[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF14_BPCLCD14 (2U)          /*!< Bit position for LCD_WF14_BPCLCD14. */
#define BM_LCD_WF14_BPCLCD14 (0x04U)       /*!< Bit mask for LCD_WF14_BPCLCD14. */
#define BS_LCD_WF14_BPCLCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPCLCD14. */

/*! @brief Read current value of the LCD_WF14_BPCLCD14 field. */
#define BR_LCD_WF14_BPCLCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPCLCD14, BS_LCD_WF14_BPCLCD14))

/*! @brief Format value for bitfield LCD_WF14_BPCLCD14. */
#define BF_LCD_WF14_BPCLCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPCLCD14) & BM_LCD_WF14_BPCLCD14)

/*! @brief Set the BPCLCD14 field to a new value. */
#define BW_LCD_WF14_BPCLCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPCLCD14), BP_LCD_WF14_BPCLCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPDLCD14[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF14_BPDLCD14 (3U)          /*!< Bit position for LCD_WF14_BPDLCD14. */
#define BM_LCD_WF14_BPDLCD14 (0x08U)       /*!< Bit mask for LCD_WF14_BPDLCD14. */
#define BS_LCD_WF14_BPDLCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPDLCD14. */

/*! @brief Read current value of the LCD_WF14_BPDLCD14 field. */
#define BR_LCD_WF14_BPDLCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPDLCD14, BS_LCD_WF14_BPDLCD14))

/*! @brief Format value for bitfield LCD_WF14_BPDLCD14. */
#define BF_LCD_WF14_BPDLCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPDLCD14) & BM_LCD_WF14_BPDLCD14)

/*! @brief Set the BPDLCD14 field to a new value. */
#define BW_LCD_WF14_BPDLCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPDLCD14), BP_LCD_WF14_BPDLCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPELCD14[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF14_BPELCD14 (4U)          /*!< Bit position for LCD_WF14_BPELCD14. */
#define BM_LCD_WF14_BPELCD14 (0x10U)       /*!< Bit mask for LCD_WF14_BPELCD14. */
#define BS_LCD_WF14_BPELCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPELCD14. */

/*! @brief Read current value of the LCD_WF14_BPELCD14 field. */
#define BR_LCD_WF14_BPELCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPELCD14, BS_LCD_WF14_BPELCD14))

/*! @brief Format value for bitfield LCD_WF14_BPELCD14. */
#define BF_LCD_WF14_BPELCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPELCD14) & BM_LCD_WF14_BPELCD14)

/*! @brief Set the BPELCD14 field to a new value. */
#define BW_LCD_WF14_BPELCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPELCD14), BP_LCD_WF14_BPELCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPFLCD14[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF14_BPFLCD14 (5U)          /*!< Bit position for LCD_WF14_BPFLCD14. */
#define BM_LCD_WF14_BPFLCD14 (0x20U)       /*!< Bit mask for LCD_WF14_BPFLCD14. */
#define BS_LCD_WF14_BPFLCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPFLCD14. */

/*! @brief Read current value of the LCD_WF14_BPFLCD14 field. */
#define BR_LCD_WF14_BPFLCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPFLCD14, BS_LCD_WF14_BPFLCD14))

/*! @brief Format value for bitfield LCD_WF14_BPFLCD14. */
#define BF_LCD_WF14_BPFLCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPFLCD14) & BM_LCD_WF14_BPFLCD14)

/*! @brief Set the BPFLCD14 field to a new value. */
#define BW_LCD_WF14_BPFLCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPFLCD14), BP_LCD_WF14_BPFLCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPGLCD14[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF14_BPGLCD14 (6U)          /*!< Bit position for LCD_WF14_BPGLCD14. */
#define BM_LCD_WF14_BPGLCD14 (0x40U)       /*!< Bit mask for LCD_WF14_BPGLCD14. */
#define BS_LCD_WF14_BPGLCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPGLCD14. */

