theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF14_BPGLCD14 field. */
#define BR_LCD_WF14_BPGLCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPGLCD14, BS_LCD_WF14_BPGLCD14))

/*! @brief Format value for bitfield LCD_WF14_BPGLCD14. */
#define BF_LCD_WF14_BPGLCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPGLCD14) & BM_LCD_WF14_BPGLCD14)

/*! @brief Set the BPGLCD14 field to a new value. */
#define BW_LCD_WF14_BPGLCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPGLCD14), BP_LCD_WF14_BPGLCD14, 1))
/*@}*/

/*!
 * @name Register LCD_WF14, field BPHLCD14[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF14_BPHLCD14 (7U)          /*!< Bit position for LCD_WF14_BPHLCD14. */
#define BM_LCD_WF14_BPHLCD14 (0x80U)       /*!< Bit mask for LCD_WF14_BPHLCD14. */
#define BS_LCD_WF14_BPHLCD14 (1U)          /*!< Bit field size in bits for LCD_WF14_BPHLCD14. */

/*! @brief Read current value of the LCD_WF14_BPHLCD14 field. */
#define BR_LCD_WF14_BPHLCD14(x) (BME_UBFX8(HW_LCD_WF14_ADDR(x), BP_LCD_WF14_BPHLCD14, BS_LCD_WF14_BPHLCD14))

/*! @brief Format value for bitfield LCD_WF14_BPHLCD14. */
#define BF_LCD_WF14_BPHLCD14(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF14_BPHLCD14) & BM_LCD_WF14_BPHLCD14)

/*! @brief Set the BPHLCD14 field to a new value. */
#define BW_LCD_WF14_BPHLCD14(x, v) (BME_BFI8(HW_LCD_WF14_ADDR(x), ((uint8_t)(v) << BP_LCD_WF14_BPHLCD14), BP_LCD_WF14_BPHLCD14, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF15 - LCD Waveform Register 15.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF15 - LCD Waveform Register 15. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf15
{
    uint8_t U;
    struct _hw_lcd_wf15_bitfields
    {
        uint8_t BPALCD15 : 1;          /*!< [0]  */
        uint8_t BPBLCD15 : 1;          /*!< [1]  */
        uint8_t BPCLCD15 : 1;          /*!< [2]  */
        uint8_t BPDLCD15 : 1;          /*!< [3]  */
        uint8_t BPELCD15 : 1;          /*!< [4]  */
        uint8_t BPFLCD15 : 1;          /*!< [5]  */
        uint8_t BPGLCD15 : 1;          /*!< [6]  */
        uint8_t BPHLCD15 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf15_t;

/*!
 * @name Constants and macros for entire LCD_WF15 register
 */
/*@{*/
#define HW_LCD_WF15_ADDR(x)      ((uint32_t)(x) + 0x2FU)

#define HW_LCD_WF15(x)           (*(__IO hw_lcd_wf15_t *) HW_LCD_WF15_ADDR(x))
#define HW_LCD_WF15_RD(x)        (HW_LCD_WF15(x).U)
#define HW_LCD_WF15_WR(x, v)     (HW_LCD_WF15(x).U = (v))
#define HW_LCD_WF15_SET(x, v)    (BME_OR8(HW_LCD_WF15_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF15_CLR(x, v)    (BME_AND8(HW_LCD_WF15_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF15_TOG(x, v)    (BME_XOR8(HW_LCD_WF15_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF15 bitfields
 */

/*!
 * @name Register LCD_WF15, field BPALCD15[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF15_BPALCD15 (0U)          /*!< Bit position for LCD_WF15_BPALCD15. */
#define BM_LCD_WF15_BPALCD15 (0x01U)       /*!< Bit mask for LCD_WF15_BPALCD15. */
#define BS_LCD_WF15_BPALCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPALCD15. */

/*! @brief Read current value of the LCD_WF15_BPALCD15 field. */
#define BR_LCD_WF15_BPALCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPALCD15, BS_LCD_WF15_BPALCD15))

/*! @brief Format value for bitfield LCD_WF15_BPALCD15. */
#define BF_LCD_WF15_BPALCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPALCD15) & BM_LCD_WF15_BPALCD15)

/*! @brief Set the BPALCD15 field to a new value. */
#define BW_LCD_WF15_BPALCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPALCD15), BP_LCD_WF15_BPALCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPBLCD15[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF15_BPBLCD15 (1U)          /*!< Bit position for LCD_WF15_BPBLCD15. */
#define BM_LCD_WF15_BPBLCD15 (0x02U)       /*!< Bit mask for LCD_WF15_BPBLCD15. */
#define BS_LCD_WF15_BPBLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPBLCD15. */

/*! @brief Read current value of the LCD_WF15_BPBLCD15 field. */
#define BR_LCD_WF15_BPBLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPBLCD15, BS_LCD_WF15_BPBLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPBLCD15. */
#define BF_LCD_WF15_BPBLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPBLCD15) & BM_LCD_WF15_BPBLCD15)

/*! @brief Set the BPBLCD15 field to a new value. */
#define BW_LCD_WF15_BPBLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPBLCD15), BP_LCD_WF15_BPBLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPCLCD15[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF15_BPCLCD15 (2U)          /*!< Bit position for LCD_WF15_BPCLCD15. */
#define BM_LCD_WF15_BPCLCD15 (0x04U)       /*!< Bit mask for LCD_WF15_BPCLCD15. */
#define BS_LCD_WF15_BPCLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPCLCD15. */

/*! @brief Read current value of the LCD_WF15_BPCLCD15 field. */
#define BR_LCD_WF15_BPCLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPCLCD15, BS_LCD_WF15_BPCLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPCLCD15. */
#define BF_LCD_WF15_BPCLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPCLCD15) & BM_LCD_WF15_BPCLCD15)

/*! @brief Set the BPCLCD15 field to a new value. */
#define BW_LCD_WF15_BPCLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPCLCD15), BP_LCD_WF15_BPCLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPDLCD15[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF15_BPDLCD15 (3U)          /*!< Bit position for LCD_WF15_BPDLCD15. */
#define BM_LCD_WF15_BPDLCD15 (0x08U)       /*!< Bit mask for LCD_WF15_BPDLCD15. */
#define BS_LCD_WF15_BPDLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPDLCD15. */

