theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*
 * Constants & macros for individual LCD_WF16 bitfields
 */

/*!
 * @name Register LCD_WF16, field BPALCD16[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF16_BPALCD16 (0U)          /*!< Bit position for LCD_WF16_BPALCD16. */
#define BM_LCD_WF16_BPALCD16 (0x01U)       /*!< Bit mask for LCD_WF16_BPALCD16. */
#define BS_LCD_WF16_BPALCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPALCD16. */

/*! @brief Read current value of the LCD_WF16_BPALCD16 field. */
#define BR_LCD_WF16_BPALCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPALCD16, BS_LCD_WF16_BPALCD16))

/*! @brief Format value for bitfield LCD_WF16_BPALCD16. */
#define BF_LCD_WF16_BPALCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPALCD16) & BM_LCD_WF16_BPALCD16)

/*! @brief Set the BPALCD16 field to a new value. */
#define BW_LCD_WF16_BPALCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPALCD16), BP_LCD_WF16_BPALCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPBLCD16[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF16_BPBLCD16 (1U)          /*!< Bit position for LCD_WF16_BPBLCD16. */
#define BM_LCD_WF16_BPBLCD16 (0x02U)       /*!< Bit mask for LCD_WF16_BPBLCD16. */
#define BS_LCD_WF16_BPBLCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPBLCD16. */

/*! @brief Read current value of the LCD_WF16_BPBLCD16 field. */
#define BR_LCD_WF16_BPBLCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPBLCD16, BS_LCD_WF16_BPBLCD16))

/*! @brief Format value for bitfield LCD_WF16_BPBLCD16. */
#define BF_LCD_WF16_BPBLCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPBLCD16) & BM_LCD_WF16_BPBLCD16)

/*! @brief Set the BPBLCD16 field to a new value. */
#define BW_LCD_WF16_BPBLCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPBLCD16), BP_LCD_WF16_BPBLCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPCLCD16[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF16_BPCLCD16 (2U)          /*!< Bit position for LCD_WF16_BPCLCD16. */
#define BM_LCD_WF16_BPCLCD16 (0x04U)       /*!< Bit mask for LCD_WF16_BPCLCD16. */
#define BS_LCD_WF16_BPCLCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPCLCD16. */

/*! @brief Read current value of the LCD_WF16_BPCLCD16 field. */
#define BR_LCD_WF16_BPCLCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPCLCD16, BS_LCD_WF16_BPCLCD16))

/*! @brief Format value for bitfield LCD_WF16_BPCLCD16. */
#define BF_LCD_WF16_BPCLCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPCLCD16) & BM_LCD_WF16_BPCLCD16)

/*! @brief Set the BPCLCD16 field to a new value. */
#define BW_LCD_WF16_BPCLCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPCLCD16), BP_LCD_WF16_BPCLCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPDLCD16[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF16_BPDLCD16 (3U)          /*!< Bit position for LCD_WF16_BPDLCD16. */
#define BM_LCD_WF16_BPDLCD16 (0x08U)       /*!< Bit mask for LCD_WF16_BPDLCD16. */
#define BS_LCD_WF16_BPDLCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPDLCD16. */

/*! @brief Read current value of the LCD_WF16_BPDLCD16 field. */
#define BR_LCD_WF16_BPDLCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPDLCD16, BS_LCD_WF16_BPDLCD16))

/*! @brief Format value for bitfield LCD_WF16_BPDLCD16. */
#define BF_LCD_WF16_BPDLCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPDLCD16) & BM_LCD_WF16_BPDLCD16)

/*! @brief Set the BPDLCD16 field to a new value. */
#define BW_LCD_WF16_BPDLCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPDLCD16), BP_LCD_WF16_BPDLCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPELCD16[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF16_BPELCD16 (4U)          /*!< Bit position for LCD_WF16_BPELCD16. */
#define BM_LCD_WF16_BPELCD16 (0x10U)       /*!< Bit mask for LCD_WF16_BPELCD16. */
#define BS_LCD_WF16_BPELCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPELCD16. */

/*! @brief Read current value of the LCD_WF16_BPELCD16 field. */
#define BR_LCD_WF16_BPELCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPELCD16, BS_LCD_WF16_BPELCD16))

/*! @brief Format value for bitfield LCD_WF16_BPELCD16. */
#define BF_LCD_WF16_BPELCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPELCD16) & BM_LCD_WF16_BPELCD16)

/*! @brief Set the BPELCD16 field to a new value. */
#define BW_LCD_WF16_BPELCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPELCD16), BP_LCD_WF16_BPELCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPFLCD16[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF16_BPFLCD16 (5U)          /*!< Bit position for LCD_WF16_BPFLCD16. */
#define BM_LCD_WF16_BPFLCD16 (0x20U)       /*!< Bit mask for LCD_WF16_BPFLCD16. */
#define BS_LCD_WF16_BPFLCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPFLCD16. */

/*! @brief Read current value of the LCD_WF16_BPFLCD16 field. */
#define BR_LCD_WF16_BPFLCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPFLCD16, BS_LCD_WF16_BPFLCD16))

/*! @brief Format value for bitfield LCD_WF16_BPFLCD16. */
#define BF_LCD_WF16_BPFLCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPFLCD16) & BM_LCD_WF16_BPFLCD16)

/*! @brief Set the BPFLCD16 field to a new value. */
#define BW_LCD_WF16_BPFLCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPFLCD16), BP_LCD_WF16_BPFLCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPGLCD16[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF16_BPGLCD16 (6U)          /*!< Bit position for LCD_WF16_BPGLCD16. */
#define BM_LCD_WF16_BPGLCD16 (0x40U)       /*!< Bit mask for LCD_WF16_BPGLCD16. */
#define BS_LCD_WF16_BPGLCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPGLCD16. */

/*! @brief Read current value of the LCD_WF16_BPGLCD16 field. */
#define BR_LCD_WF16_BPGLCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPGLCD16, BS_LCD_WF16_BPGLCD16))

/*! @brief Format value for bitfield LCD_WF16_BPGLCD16. */
#define BF_LCD_WF16_BPGLCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPGLCD16) & BM_LCD_WF16_BPGLCD16)

