theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the BPGLCD16 field to a new value. */
#define BW_LCD_WF16_BPGLCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPGLCD16), BP_LCD_WF16_BPGLCD16, 1))
/*@}*/

/*!
 * @name Register LCD_WF16, field BPHLCD16[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF16_BPHLCD16 (7U)          /*!< Bit position for LCD_WF16_BPHLCD16. */
#define BM_LCD_WF16_BPHLCD16 (0x80U)       /*!< Bit mask for LCD_WF16_BPHLCD16. */
#define BS_LCD_WF16_BPHLCD16 (1U)          /*!< Bit field size in bits for LCD_WF16_BPHLCD16. */

/*! @brief Read current value of the LCD_WF16_BPHLCD16 field. */
#define BR_LCD_WF16_BPHLCD16(x) (BME_UBFX8(HW_LCD_WF16_ADDR(x), BP_LCD_WF16_BPHLCD16, BS_LCD_WF16_BPHLCD16))

/*! @brief Format value for bitfield LCD_WF16_BPHLCD16. */
#define BF_LCD_WF16_BPHLCD16(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF16_BPHLCD16) & BM_LCD_WF16_BPHLCD16)

/*! @brief Set the BPHLCD16 field to a new value. */
#define BW_LCD_WF16_BPHLCD16(x, v) (BME_BFI8(HW_LCD_WF16_ADDR(x), ((uint8_t)(v) << BP_LCD_WF16_BPHLCD16), BP_LCD_WF16_BPHLCD16, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF17 - LCD Waveform Register 17.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF17 - LCD Waveform Register 17. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf17
{
    uint8_t U;
    struct _hw_lcd_wf17_bitfields
    {
        uint8_t BPALCD17 : 1;          /*!< [0]  */
        uint8_t BPBLCD17 : 1;          /*!< [1]  */
        uint8_t BPCLCD17 : 1;          /*!< [2]  */
        uint8_t BPDLCD17 : 1;          /*!< [3]  */
        uint8_t BPELCD17 : 1;          /*!< [4]  */
        uint8_t BPFLCD17 : 1;          /*!< [5]  */
        uint8_t BPGLCD17 : 1;          /*!< [6]  */
        uint8_t BPHLCD17 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf17_t;

/*!
 * @name Constants and macros for entire LCD_WF17 register
 */
/*@{*/
#define HW_LCD_WF17_ADDR(x)      ((uint32_t)(x) + 0x31U)

#define HW_LCD_WF17(x)           (*(__IO hw_lcd_wf17_t *) HW_LCD_WF17_ADDR(x))
#define HW_LCD_WF17_RD(x)        (HW_LCD_WF17(x).U)
#define HW_LCD_WF17_WR(x, v)     (HW_LCD_WF17(x).U = (v))
#define HW_LCD_WF17_SET(x, v)    (BME_OR8(HW_LCD_WF17_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF17_CLR(x, v)    (BME_AND8(HW_LCD_WF17_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF17_TOG(x, v)    (BME_XOR8(HW_LCD_WF17_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF17 bitfields
 */

/*!
 * @name Register LCD_WF17, field BPALCD17[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF17_BPALCD17 (0U)          /*!< Bit position for LCD_WF17_BPALCD17. */
#define BM_LCD_WF17_BPALCD17 (0x01U)       /*!< Bit mask for LCD_WF17_BPALCD17. */
#define BS_LCD_WF17_BPALCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPALCD17. */

/*! @brief Read current value of the LCD_WF17_BPALCD17 field. */
#define BR_LCD_WF17_BPALCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPALCD17, BS_LCD_WF17_BPALCD17))

/*! @brief Format value for bitfield LCD_WF17_BPALCD17. */
#define BF_LCD_WF17_BPALCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPALCD17) & BM_LCD_WF17_BPALCD17)

/*! @brief Set the BPALCD17 field to a new value. */
#define BW_LCD_WF17_BPALCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPALCD17), BP_LCD_WF17_BPALCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPBLCD17[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF17_BPBLCD17 (1U)          /*!< Bit position for LCD_WF17_BPBLCD17. */
#define BM_LCD_WF17_BPBLCD17 (0x02U)       /*!< Bit mask for LCD_WF17_BPBLCD17. */
#define BS_LCD_WF17_BPBLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPBLCD17. */

/*! @brief Read current value of the LCD_WF17_BPBLCD17 field. */
#define BR_LCD_WF17_BPBLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPBLCD17, BS_LCD_WF17_BPBLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPBLCD17. */
#define BF_LCD_WF17_BPBLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPBLCD17) & BM_LCD_WF17_BPBLCD17)

/*! @brief Set the BPBLCD17 field to a new value. */
#define BW_LCD_WF17_BPBLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPBLCD17), BP_LCD_WF17_BPBLCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPCLCD17[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF17_BPCLCD17 (2U)          /*!< Bit position for LCD_WF17_BPCLCD17. */
#define BM_LCD_WF17_BPCLCD17 (0x04U)       /*!< Bit mask for LCD_WF17_BPCLCD17. */
#define BS_LCD_WF17_BPCLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPCLCD17. */

/*! @brief Read current value of the LCD_WF17_BPCLCD17 field. */
#define BR_LCD_WF17_BPCLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPCLCD17, BS_LCD_WF17_BPCLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPCLCD17. */
#define BF_LCD_WF17_BPCLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPCLCD17) & BM_LCD_WF17_BPCLCD17)

/*! @brief Set the BPCLCD17 field to a new value. */
#define BW_LCD_WF17_BPCLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPCLCD17), BP_LCD_WF17_BPCLCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPDLCD17[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF17_BPDLCD17 (3U)          /*!< Bit position for LCD_WF17_BPDLCD17. */
#define BM_LCD_WF17_BPDLCD17 (0x08U)       /*!< Bit mask for LCD_WF17_BPDLCD17. */
#define BS_LCD_WF17_BPDLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPDLCD17. */

/*! @brief Read current value of the LCD_WF17_BPDLCD17 field. */
#define BR_LCD_WF17_BPDLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPDLCD17, BS_LCD_WF17_BPDLCD17))

