theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF18_BPALCD18 field. */
#define BR_LCD_WF18_BPALCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPALCD18, BS_LCD_WF18_BPALCD18))

/*! @brief Format value for bitfield LCD_WF18_BPALCD18. */
#define BF_LCD_WF18_BPALCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPALCD18) & BM_LCD_WF18_BPALCD18)

/*! @brief Set the BPALCD18 field to a new value. */
#define BW_LCD_WF18_BPALCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPALCD18), BP_LCD_WF18_BPALCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPBLCD18[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF18_BPBLCD18 (1U)          /*!< Bit position for LCD_WF18_BPBLCD18. */
#define BM_LCD_WF18_BPBLCD18 (0x02U)       /*!< Bit mask for LCD_WF18_BPBLCD18. */
#define BS_LCD_WF18_BPBLCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPBLCD18. */

/*! @brief Read current value of the LCD_WF18_BPBLCD18 field. */
#define BR_LCD_WF18_BPBLCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPBLCD18, BS_LCD_WF18_BPBLCD18))

/*! @brief Format value for bitfield LCD_WF18_BPBLCD18. */
#define BF_LCD_WF18_BPBLCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPBLCD18) & BM_LCD_WF18_BPBLCD18)

/*! @brief Set the BPBLCD18 field to a new value. */
#define BW_LCD_WF18_BPBLCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPBLCD18), BP_LCD_WF18_BPBLCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPCLCD18[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF18_BPCLCD18 (2U)          /*!< Bit position for LCD_WF18_BPCLCD18. */
#define BM_LCD_WF18_BPCLCD18 (0x04U)       /*!< Bit mask for LCD_WF18_BPCLCD18. */
#define BS_LCD_WF18_BPCLCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPCLCD18. */

/*! @brief Read current value of the LCD_WF18_BPCLCD18 field. */
#define BR_LCD_WF18_BPCLCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPCLCD18, BS_LCD_WF18_BPCLCD18))

/*! @brief Format value for bitfield LCD_WF18_BPCLCD18. */
#define BF_LCD_WF18_BPCLCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPCLCD18) & BM_LCD_WF18_BPCLCD18)

/*! @brief Set the BPCLCD18 field to a new value. */
#define BW_LCD_WF18_BPCLCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPCLCD18), BP_LCD_WF18_BPCLCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPDLCD18[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF18_BPDLCD18 (3U)          /*!< Bit position for LCD_WF18_BPDLCD18. */
#define BM_LCD_WF18_BPDLCD18 (0x08U)       /*!< Bit mask for LCD_WF18_BPDLCD18. */
#define BS_LCD_WF18_BPDLCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPDLCD18. */

/*! @brief Read current value of the LCD_WF18_BPDLCD18 field. */
#define BR_LCD_WF18_BPDLCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPDLCD18, BS_LCD_WF18_BPDLCD18))

/*! @brief Format value for bitfield LCD_WF18_BPDLCD18. */
#define BF_LCD_WF18_BPDLCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPDLCD18) & BM_LCD_WF18_BPDLCD18)

/*! @brief Set the BPDLCD18 field to a new value. */
#define BW_LCD_WF18_BPDLCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPDLCD18), BP_LCD_WF18_BPDLCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPELCD18[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF18_BPELCD18 (4U)          /*!< Bit position for LCD_WF18_BPELCD18. */
#define BM_LCD_WF18_BPELCD18 (0x10U)       /*!< Bit mask for LCD_WF18_BPELCD18. */
#define BS_LCD_WF18_BPELCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPELCD18. */

/*! @brief Read current value of the LCD_WF18_BPELCD18 field. */
#define BR_LCD_WF18_BPELCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPELCD18, BS_LCD_WF18_BPELCD18))

/*! @brief Format value for bitfield LCD_WF18_BPELCD18. */
#define BF_LCD_WF18_BPELCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPELCD18) & BM_LCD_WF18_BPELCD18)

/*! @brief Set the BPELCD18 field to a new value. */
#define BW_LCD_WF18_BPELCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPELCD18), BP_LCD_WF18_BPELCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPFLCD18[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF18_BPFLCD18 (5U)          /*!< Bit position for LCD_WF18_BPFLCD18. */
#define BM_LCD_WF18_BPFLCD18 (0x20U)       /*!< Bit mask for LCD_WF18_BPFLCD18. */
#define BS_LCD_WF18_BPFLCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPFLCD18. */

/*! @brief Read current value of the LCD_WF18_BPFLCD18 field. */
#define BR_LCD_WF18_BPFLCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPFLCD18, BS_LCD_WF18_BPFLCD18))

/*! @brief Format value for bitfield LCD_WF18_BPFLCD18. */
#define BF_LCD_WF18_BPFLCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPFLCD18) & BM_LCD_WF18_BPFLCD18)

/*! @brief Set the BPFLCD18 field to a new value. */
#define BW_LCD_WF18_BPFLCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPFLCD18), BP_LCD_WF18_BPFLCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPGLCD18[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF18_BPGLCD18 (6U)          /*!< Bit position for LCD_WF18_BPGLCD18. */
#define BM_LCD_WF18_BPGLCD18 (0x40U)       /*!< Bit mask for LCD_WF18_BPGLCD18. */
#define BS_LCD_WF18_BPGLCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPGLCD18. */

