theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the BPFLCD22 field to a new value. */
#define BW_LCD_WF22_BPFLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPFLCD22), BP_LCD_WF22_BPFLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPGLCD22[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF22_BPGLCD22 (6U)          /*!< Bit position for LCD_WF22_BPGLCD22. */
#define BM_LCD_WF22_BPGLCD22 (0x40U)       /*!< Bit mask for LCD_WF22_BPGLCD22. */
#define BS_LCD_WF22_BPGLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPGLCD22. */

/*! @brief Read current value of the LCD_WF22_BPGLCD22 field. */
#define BR_LCD_WF22_BPGLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPGLCD22, BS_LCD_WF22_BPGLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPGLCD22. */
#define BF_LCD_WF22_BPGLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPGLCD22) & BM_LCD_WF22_BPGLCD22)

/*! @brief Set the BPGLCD22 field to a new value. */
#define BW_LCD_WF22_BPGLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPGLCD22), BP_LCD_WF22_BPGLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPHLCD22[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF22_BPHLCD22 (7U)          /*!< Bit position for LCD_WF22_BPHLCD22. */
#define BM_LCD_WF22_BPHLCD22 (0x80U)       /*!< Bit mask for LCD_WF22_BPHLCD22. */
#define BS_LCD_WF22_BPHLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPHLCD22. */

/*! @brief Read current value of the LCD_WF22_BPHLCD22 field. */
#define BR_LCD_WF22_BPHLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPHLCD22, BS_LCD_WF22_BPHLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPHLCD22. */
#define BF_LCD_WF22_BPHLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPHLCD22) & BM_LCD_WF22_BPHLCD22)

/*! @brief Set the BPHLCD22 field to a new value. */
#define BW_LCD_WF22_BPHLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPHLCD22), BP_LCD_WF22_BPHLCD22, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF23 - LCD Waveform Register 23.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF23 - LCD Waveform Register 23. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf23
{
    uint8_t U;
    struct _hw_lcd_wf23_bitfields
    {
        uint8_t BPALCD23 : 1;          /*!< [0]  */
        uint8_t BPBLCD23 : 1;          /*!< [1]  */
        uint8_t BPCLCD23 : 1;          /*!< [2]  */
        uint8_t BPDLCD23 : 1;          /*!< [3]  */
        uint8_t BPELCD23 : 1;          /*!< [4]  */
        uint8_t BPFLCD23 : 1;          /*!< [5]  */
        uint8_t BPGLCD23 : 1;          /*!< [6]  */
        uint8_t BPHLCD23 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf23_t;

/*!
 * @name Constants and macros for entire LCD_WF23 register
 */
/*@{*/
#define HW_LCD_WF23_ADDR(x)      ((uint32_t)(x) + 0x37U)

#define HW_LCD_WF23(x)           (*(__IO hw_lcd_wf23_t *) HW_LCD_WF23_ADDR(x))
#define HW_LCD_WF23_RD(x)        (HW_LCD_WF23(x).U)
#define HW_LCD_WF23_WR(x, v)     (HW_LCD_WF23(x).U = (v))
#define HW_LCD_WF23_SET(x, v)    (BME_OR8(HW_LCD_WF23_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF23_CLR(x, v)    (BME_AND8(HW_LCD_WF23_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF23_TOG(x, v)    (BME_XOR8(HW_LCD_WF23_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF23 bitfields
 */

/*!
 * @name Register LCD_WF23, field BPALCD23[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF23_BPALCD23 (0U)          /*!< Bit position for LCD_WF23_BPALCD23. */
#define BM_LCD_WF23_BPALCD23 (0x01U)       /*!< Bit mask for LCD_WF23_BPALCD23. */
#define BS_LCD_WF23_BPALCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPALCD23. */

/*! @brief Read current value of the LCD_WF23_BPALCD23 field. */
#define BR_LCD_WF23_BPALCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPALCD23, BS_LCD_WF23_BPALCD23))

/*! @brief Format value for bitfield LCD_WF23_BPALCD23. */
#define BF_LCD_WF23_BPALCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPALCD23) & BM_LCD_WF23_BPALCD23)

/*! @brief Set the BPALCD23 field to a new value. */
#define BW_LCD_WF23_BPALCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPALCD23), BP_LCD_WF23_BPALCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPBLCD23[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF23_BPBLCD23 (1U)          /*!< Bit position for LCD_WF23_BPBLCD23. */
#define BM_LCD_WF23_BPBLCD23 (0x02U)       /*!< Bit mask for LCD_WF23_BPBLCD23. */
#define BS_LCD_WF23_BPBLCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPBLCD23. */

/*! @brief Read current value of the LCD_WF23_BPBLCD23 field. */
#define BR_LCD_WF23_BPBLCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPBLCD23, BS_LCD_WF23_BPBLCD23))

/*! @brief Format value for bitfield LCD_WF23_BPBLCD23. */
#define BF_LCD_WF23_BPBLCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPBLCD23) & BM_LCD_WF23_BPBLCD23)

/*! @brief Set the BPBLCD23 field to a new value. */
#define BW_LCD_WF23_BPBLCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPBLCD23), BP_LCD_WF23_BPBLCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPCLCD23[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF23_BPCLCD23 (2U)          /*!< Bit position for LCD_WF23_BPCLCD23. */
#define BM_LCD_WF23_BPCLCD23 (0x04U)       /*!< Bit mask for LCD_WF23_BPCLCD23. */
#define BS_LCD_WF23_BPCLCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPCLCD23. */

