theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
#define HW_LCD_WF30(x)           (*(__IO hw_lcd_wf30_t *) HW_LCD_WF30_ADDR(x))
#define HW_LCD_WF30_RD(x)        (HW_LCD_WF30(x).U)
#define HW_LCD_WF30_WR(x, v)     (HW_LCD_WF30(x).U = (v))
#define HW_LCD_WF30_SET(x, v)    (BME_OR8(HW_LCD_WF30_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF30_CLR(x, v)    (BME_AND8(HW_LCD_WF30_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF30_TOG(x, v)    (BME_XOR8(HW_LCD_WF30_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF30 bitfields
 */

/*!
 * @name Register LCD_WF30, field BPALCD30[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF30_BPALCD30 (0U)          /*!< Bit position for LCD_WF30_BPALCD30. */
#define BM_LCD_WF30_BPALCD30 (0x01U)       /*!< Bit mask for LCD_WF30_BPALCD30. */
#define BS_LCD_WF30_BPALCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPALCD30. */

/*! @brief Read current value of the LCD_WF30_BPALCD30 field. */
#define BR_LCD_WF30_BPALCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPALCD30, BS_LCD_WF30_BPALCD30))

/*! @brief Format value for bitfield LCD_WF30_BPALCD30. */
#define BF_LCD_WF30_BPALCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPALCD30) & BM_LCD_WF30_BPALCD30)

/*! @brief Set the BPALCD30 field to a new value. */
#define BW_LCD_WF30_BPALCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPALCD30), BP_LCD_WF30_BPALCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPBLCD30[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF30_BPBLCD30 (1U)          /*!< Bit position for LCD_WF30_BPBLCD30. */
#define BM_LCD_WF30_BPBLCD30 (0x02U)       /*!< Bit mask for LCD_WF30_BPBLCD30. */
#define BS_LCD_WF30_BPBLCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPBLCD30. */

/*! @brief Read current value of the LCD_WF30_BPBLCD30 field. */
#define BR_LCD_WF30_BPBLCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPBLCD30, BS_LCD_WF30_BPBLCD30))

/*! @brief Format value for bitfield LCD_WF30_BPBLCD30. */
#define BF_LCD_WF30_BPBLCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPBLCD30) & BM_LCD_WF30_BPBLCD30)

/*! @brief Set the BPBLCD30 field to a new value. */
#define BW_LCD_WF30_BPBLCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPBLCD30), BP_LCD_WF30_BPBLCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPCLCD30[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF30_BPCLCD30 (2U)          /*!< Bit position for LCD_WF30_BPCLCD30. */
#define BM_LCD_WF30_BPCLCD30 (0x04U)       /*!< Bit mask for LCD_WF30_BPCLCD30. */
#define BS_LCD_WF30_BPCLCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPCLCD30. */

/*! @brief Read current value of the LCD_WF30_BPCLCD30 field. */
#define BR_LCD_WF30_BPCLCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPCLCD30, BS_LCD_WF30_BPCLCD30))

/*! @brief Format value for bitfield LCD_WF30_BPCLCD30. */
#define BF_LCD_WF30_BPCLCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPCLCD30) & BM_LCD_WF30_BPCLCD30)

/*! @brief Set the BPCLCD30 field to a new value. */
#define BW_LCD_WF30_BPCLCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPCLCD30), BP_LCD_WF30_BPCLCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPDLCD30[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF30_BPDLCD30 (3U)          /*!< Bit position for LCD_WF30_BPDLCD30. */
#define BM_LCD_WF30_BPDLCD30 (0x08U)       /*!< Bit mask for LCD_WF30_BPDLCD30. */
#define BS_LCD_WF30_BPDLCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPDLCD30. */

/*! @brief Read current value of the LCD_WF30_BPDLCD30 field. */
#define BR_LCD_WF30_BPDLCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPDLCD30, BS_LCD_WF30_BPDLCD30))

/*! @brief Format value for bitfield LCD_WF30_BPDLCD30. */
#define BF_LCD_WF30_BPDLCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPDLCD30) & BM_LCD_WF30_BPDLCD30)

/*! @brief Set the BPDLCD30 field to a new value. */
#define BW_LCD_WF30_BPDLCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPDLCD30), BP_LCD_WF30_BPDLCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPELCD30[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF30_BPELCD30 (4U)          /*!< Bit position for LCD_WF30_BPELCD30. */
#define BM_LCD_WF30_BPELCD30 (0x10U)       /*!< Bit mask for LCD_WF30_BPELCD30. */
#define BS_LCD_WF30_BPELCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPELCD30. */

/*! @brief Read current value of the LCD_WF30_BPELCD30 field. */
#define BR_LCD_WF30_BPELCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPELCD30, BS_LCD_WF30_BPELCD30))

/*! @brief Format value for bitfield LCD_WF30_BPELCD30. */
#define BF_LCD_WF30_BPELCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPELCD30) & BM_LCD_WF30_BPELCD30)

/*! @brief Set the BPELCD30 field to a new value. */
#define BW_LCD_WF30_BPELCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPELCD30), BP_LCD_WF30_BPELCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPFLCD30[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF30_BPFLCD30 (5U)          /*!< Bit position for LCD_WF30_BPFLCD30. */
#define BM_LCD_WF30_BPFLCD30 (0x20U)       /*!< Bit mask for LCD_WF30_BPFLCD30. */
#define BS_LCD_WF30_BPFLCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPFLCD30. */

