theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
#define HW_LCD_WF32(x)           (*(__IO hw_lcd_wf32_t *) HW_LCD_WF32_ADDR(x))
#define HW_LCD_WF32_RD(x)        (HW_LCD_WF32(x).U)
#define HW_LCD_WF32_WR(x, v)     (HW_LCD_WF32(x).U = (v))
#define HW_LCD_WF32_SET(x, v)    (BME_OR8(HW_LCD_WF32_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF32_CLR(x, v)    (BME_AND8(HW_LCD_WF32_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF32_TOG(x, v)    (BME_XOR8(HW_LCD_WF32_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF32 bitfields
 */

/*!
 * @name Register LCD_WF32, field BPALCD32[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF32_BPALCD32 (0U)          /*!< Bit position for LCD_WF32_BPALCD32. */
#define BM_LCD_WF32_BPALCD32 (0x01U)       /*!< Bit mask for LCD_WF32_BPALCD32. */
#define BS_LCD_WF32_BPALCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPALCD32. */

/*! @brief Read current value of the LCD_WF32_BPALCD32 field. */
#define BR_LCD_WF32_BPALCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPALCD32, BS_LCD_WF32_BPALCD32))

/*! @brief Format value for bitfield LCD_WF32_BPALCD32. */
#define BF_LCD_WF32_BPALCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPALCD32) & BM_LCD_WF32_BPALCD32)

/*! @brief Set the BPALCD32 field to a new value. */
#define BW_LCD_WF32_BPALCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPALCD32), BP_LCD_WF32_BPALCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPBLCD32[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF32_BPBLCD32 (1U)          /*!< Bit position for LCD_WF32_BPBLCD32. */
#define BM_LCD_WF32_BPBLCD32 (0x02U)       /*!< Bit mask for LCD_WF32_BPBLCD32. */
#define BS_LCD_WF32_BPBLCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPBLCD32. */

/*! @brief Read current value of the LCD_WF32_BPBLCD32 field. */
#define BR_LCD_WF32_BPBLCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPBLCD32, BS_LCD_WF32_BPBLCD32))

/*! @brief Format value for bitfield LCD_WF32_BPBLCD32. */
#define BF_LCD_WF32_BPBLCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPBLCD32) & BM_LCD_WF32_BPBLCD32)

/*! @brief Set the BPBLCD32 field to a new value. */
#define BW_LCD_WF32_BPBLCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPBLCD32), BP_LCD_WF32_BPBLCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPCLCD32[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF32_BPCLCD32 (2U)          /*!< Bit position for LCD_WF32_BPCLCD32. */
#define BM_LCD_WF32_BPCLCD32 (0x04U)       /*!< Bit mask for LCD_WF32_BPCLCD32. */
#define BS_LCD_WF32_BPCLCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPCLCD32. */

/*! @brief Read current value of the LCD_WF32_BPCLCD32 field. */
#define BR_LCD_WF32_BPCLCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPCLCD32, BS_LCD_WF32_BPCLCD32))

/*! @brief Format value for bitfield LCD_WF32_BPCLCD32. */
#define BF_LCD_WF32_BPCLCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPCLCD32) & BM_LCD_WF32_BPCLCD32)

/*! @brief Set the BPCLCD32 field to a new value. */
#define BW_LCD_WF32_BPCLCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPCLCD32), BP_LCD_WF32_BPCLCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPDLCD32[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF32_BPDLCD32 (3U)          /*!< Bit position for LCD_WF32_BPDLCD32. */
#define BM_LCD_WF32_BPDLCD32 (0x08U)       /*!< Bit mask for LCD_WF32_BPDLCD32. */
#define BS_LCD_WF32_BPDLCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPDLCD32. */

/*! @brief Read current value of the LCD_WF32_BPDLCD32 field. */
#define BR_LCD_WF32_BPDLCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPDLCD32, BS_LCD_WF32_BPDLCD32))

/*! @brief Format value for bitfield LCD_WF32_BPDLCD32. */
#define BF_LCD_WF32_BPDLCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPDLCD32) & BM_LCD_WF32_BPDLCD32)

/*! @brief Set the BPDLCD32 field to a new value. */
#define BW_LCD_WF32_BPDLCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPDLCD32), BP_LCD_WF32_BPDLCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPELCD32[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF32_BPELCD32 (4U)          /*!< Bit position for LCD_WF32_BPELCD32. */
#define BM_LCD_WF32_BPELCD32 (0x10U)       /*!< Bit mask for LCD_WF32_BPELCD32. */
#define BS_LCD_WF32_BPELCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPELCD32. */

/*! @brief Read current value of the LCD_WF32_BPELCD32 field. */
#define BR_LCD_WF32_BPELCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPELCD32, BS_LCD_WF32_BPELCD32))

/*! @brief Format value for bitfield LCD_WF32_BPELCD32. */
#define BF_LCD_WF32_BPELCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPELCD32) & BM_LCD_WF32_BPELCD32)

/*! @brief Set the BPELCD32 field to a new value. */
#define BW_LCD_WF32_BPELCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPELCD32), BP_LCD_WF32_BPELCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPFLCD32[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF32_BPFLCD32 (5U)          /*!< Bit position for LCD_WF32_BPFLCD32. */
#define BM_LCD_WF32_BPFLCD32 (0x20U)       /*!< Bit mask for LCD_WF32_BPFLCD32. */
#define BS_LCD_WF32_BPFLCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPFLCD32. */

/*! @brief Read current value of the LCD_WF32_BPFLCD32 field. */
#define BR_LCD_WF32_BPFLCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPFLCD32, BS_LCD_WF32_BPFLCD32))

/*! @brief Format value for bitfield LCD_WF32_BPFLCD32. */
#define BF_LCD_WF32_BPFLCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPFLCD32) & BM_LCD_WF32_BPFLCD32)

/*! @brief Set the BPFLCD32 field to a new value. */
#define BW_LCD_WF32_BPFLCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPFLCD32), BP_LCD_WF32_BPFLCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPGLCD32[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF32_BPGLCD32 (6U)          /*!< Bit position for LCD_WF32_BPGLCD32. */
#define BM_LCD_WF32_BPGLCD32 (0x40U)       /*!< Bit mask for LCD_WF32_BPGLCD32. */
#define BS_LCD_WF32_BPGLCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPGLCD32. */

