theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the BPELCD35 field to a new value. */
#define BW_LCD_WF35_BPELCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPELCD35), BP_LCD_WF35_BPELCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPFLCD35[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF35_BPFLCD35 (5U)          /*!< Bit position for LCD_WF35_BPFLCD35. */
#define BM_LCD_WF35_BPFLCD35 (0x20U)       /*!< Bit mask for LCD_WF35_BPFLCD35. */
#define BS_LCD_WF35_BPFLCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPFLCD35. */

/*! @brief Read current value of the LCD_WF35_BPFLCD35 field. */
#define BR_LCD_WF35_BPFLCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPFLCD35, BS_LCD_WF35_BPFLCD35))

/*! @brief Format value for bitfield LCD_WF35_BPFLCD35. */
#define BF_LCD_WF35_BPFLCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPFLCD35) & BM_LCD_WF35_BPFLCD35)

/*! @brief Set the BPFLCD35 field to a new value. */
#define BW_LCD_WF35_BPFLCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPFLCD35), BP_LCD_WF35_BPFLCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPGLCD35[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF35_BPGLCD35 (6U)          /*!< Bit position for LCD_WF35_BPGLCD35. */
#define BM_LCD_WF35_BPGLCD35 (0x40U)       /*!< Bit mask for LCD_WF35_BPGLCD35. */
#define BS_LCD_WF35_BPGLCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPGLCD35. */

/*! @brief Read current value of the LCD_WF35_BPGLCD35 field. */
#define BR_LCD_WF35_BPGLCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPGLCD35, BS_LCD_WF35_BPGLCD35))

/*! @brief Format value for bitfield LCD_WF35_BPGLCD35. */
#define BF_LCD_WF35_BPGLCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPGLCD35) & BM_LCD_WF35_BPGLCD35)

/*! @brief Set the BPGLCD35 field to a new value. */
#define BW_LCD_WF35_BPGLCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPGLCD35), BP_LCD_WF35_BPGLCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPHLCD35[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF35_BPHLCD35 (7U)          /*!< Bit position for LCD_WF35_BPHLCD35. */
#define BM_LCD_WF35_BPHLCD35 (0x80U)       /*!< Bit mask for LCD_WF35_BPHLCD35. */
#define BS_LCD_WF35_BPHLCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPHLCD35. */

/*! @brief Read current value of the LCD_WF35_BPHLCD35 field. */
#define BR_LCD_WF35_BPHLCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPHLCD35, BS_LCD_WF35_BPHLCD35))

/*! @brief Format value for bitfield LCD_WF35_BPHLCD35. */
#define BF_LCD_WF35_BPHLCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPHLCD35) & BM_LCD_WF35_BPHLCD35)

/*! @brief Set the BPHLCD35 field to a new value. */
#define BW_LCD_WF35_BPHLCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPHLCD35), BP_LCD_WF35_BPHLCD35, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF36 - LCD Waveform Register 36.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF36 - LCD Waveform Register 36. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf36
{
    uint8_t U;
    struct _hw_lcd_wf36_bitfields
    {
        uint8_t BPALCD36 : 1;          /*!< [0]  */
        uint8_t BPBLCD36 : 1;          /*!< [1]  */
        uint8_t BPCLCD36 : 1;          /*!< [2]  */
        uint8_t BPDLCD36 : 1;          /*!< [3]  */
        uint8_t BPELCD36 : 1;          /*!< [4]  */
        uint8_t BPFLCD36 : 1;          /*!< [5]  */
        uint8_t BPGLCD36 : 1;          /*!< [6]  */
        uint8_t BPHLCD36 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf36_t;

/*!
 * @name Constants and macros for entire LCD_WF36 register
 */
/*@{*/
#define HW_LCD_WF36_ADDR(x)      ((uint32_t)(x) + 0x44U)

#define HW_LCD_WF36(x)           (*(__IO hw_lcd_wf36_t *) HW_LCD_WF36_ADDR(x))
#define HW_LCD_WF36_RD(x)        (HW_LCD_WF36(x).U)
#define HW_LCD_WF36_WR(x, v)     (HW_LCD_WF36(x).U = (v))
#define HW_LCD_WF36_SET(x, v)    (BME_OR8(HW_LCD_WF36_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF36_CLR(x, v)    (BME_AND8(HW_LCD_WF36_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF36_TOG(x, v)    (BME_XOR8(HW_LCD_WF36_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF36 bitfields
 */

/*!
 * @name Register LCD_WF36, field BPALCD36[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF36_BPALCD36 (0U)          /*!< Bit position for LCD_WF36_BPALCD36. */
#define BM_LCD_WF36_BPALCD36 (0x01U)       /*!< Bit mask for LCD_WF36_BPALCD36. */
#define BS_LCD_WF36_BPALCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPALCD36. */

/*! @brief Read current value of the LCD_WF36_BPALCD36 field. */
#define BR_LCD_WF36_BPALCD36(x) (BME_UBFX8(HW_LCD_WF36_ADDR(x), BP_LCD_WF36_BPALCD36, BS_LCD_WF36_BPALCD36))

/*! @brief Format value for bitfield LCD_WF36_BPALCD36. */
#define BF_LCD_WF36_BPALCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPALCD36) & BM_LCD_WF36_BPALCD36)

/*! @brief Set the BPALCD36 field to a new value. */
#define BW_LCD_WF36_BPALCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPALCD36), BP_LCD_WF36_BPALCD36, 1))
/*@}*/

/*!
 * @name Register LCD_WF36, field BPBLCD36[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF36_BPBLCD36 (1U)          /*!< Bit position for LCD_WF36_BPBLCD36. */
#define BM_LCD_WF36_BPBLCD36 (0x02U)       /*!< Bit mask for LCD_WF36_BPBLCD36. */
#define BS_LCD_WF36_BPBLCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPBLCD36. */

/*! @brief Read current value of the LCD_WF36_BPBLCD36 field. */
#define BR_LCD_WF36_BPBLCD36(x) (BME_UBFX8(HW_LCD_WF36_ADDR(x), BP_LCD_WF36_BPBLCD36, BS_LCD_WF36_BPBLCD36))

/*! @brief Format value for bitfield LCD_WF36_BPBLCD36. */
#define BF_LCD_WF36_BPBLCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPBLCD36) & BM_LCD_WF36_BPBLCD36)

/*! @brief Set the BPBLCD36 field to a new value. */
#define BW_LCD_WF36_BPBLCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPBLCD36), BP_LCD_WF36_BPBLCD36, 1))
/*@}*/

/*!
 * @name Register LCD_WF36, field BPCLCD36[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF36_BPCLCD36 (2U)          /*!< Bit position for LCD_WF36_BPCLCD36. */
#define BM_LCD_WF36_BPCLCD36 (0x04U)       /*!< Bit mask for LCD_WF36_BPCLCD36. */
#define BS_LCD_WF36_BPCLCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPCLCD36. */

