theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF39_BPGLCD39 field. */
#define BR_LCD_WF39_BPGLCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPGLCD39, BS_LCD_WF39_BPGLCD39))

/*! @brief Format value for bitfield LCD_WF39_BPGLCD39. */
#define BF_LCD_WF39_BPGLCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPGLCD39) & BM_LCD_WF39_BPGLCD39)

/*! @brief Set the BPGLCD39 field to a new value. */
#define BW_LCD_WF39_BPGLCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPGLCD39), BP_LCD_WF39_BPGLCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPHLCD39[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF39_BPHLCD39 (7U)          /*!< Bit position for LCD_WF39_BPHLCD39. */
#define BM_LCD_WF39_BPHLCD39 (0x80U)       /*!< Bit mask for LCD_WF39_BPHLCD39. */
#define BS_LCD_WF39_BPHLCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPHLCD39. */

/*! @brief Read current value of the LCD_WF39_BPHLCD39 field. */
#define BR_LCD_WF39_BPHLCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPHLCD39, BS_LCD_WF39_BPHLCD39))

/*! @brief Format value for bitfield LCD_WF39_BPHLCD39. */
#define BF_LCD_WF39_BPHLCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPHLCD39) & BM_LCD_WF39_BPHLCD39)

/*! @brief Set the BPHLCD39 field to a new value. */
#define BW_LCD_WF39_BPHLCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPHLCD39), BP_LCD_WF39_BPHLCD39, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF40 - LCD Waveform Register 40.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF40 - LCD Waveform Register 40. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf40
{
    uint8_t U;
    struct _hw_lcd_wf40_bitfields
    {
        uint8_t BPALCD40 : 1;          /*!< [0]  */
        uint8_t BPBLCD40 : 1;          /*!< [1]  */
        uint8_t BPCLCD40 : 1;          /*!< [2]  */
        uint8_t BPDLCD40 : 1;          /*!< [3]  */
        uint8_t BPELCD40 : 1;          /*!< [4]  */
        uint8_t BPFLCD40 : 1;          /*!< [5]  */
        uint8_t BPGLCD40 : 1;          /*!< [6]  */
        uint8_t BPHLCD40 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf40_t;

/*!
 * @name Constants and macros for entire LCD_WF40 register
 */
/*@{*/
#define HW_LCD_WF40_ADDR(x)      ((uint32_t)(x) + 0x48U)

#define HW_LCD_WF40(x)           (*(__IO hw_lcd_wf40_t *) HW_LCD_WF40_ADDR(x))
#define HW_LCD_WF40_RD(x)        (HW_LCD_WF40(x).U)
#define HW_LCD_WF40_WR(x, v)     (HW_LCD_WF40(x).U = (v))
#define HW_LCD_WF40_SET(x, v)    (BME_OR8(HW_LCD_WF40_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF40_CLR(x, v)    (BME_AND8(HW_LCD_WF40_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF40_TOG(x, v)    (BME_XOR8(HW_LCD_WF40_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF40 bitfields
 */

/*!
 * @name Register LCD_WF40, field BPALCD40[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF40_BPALCD40 (0U)          /*!< Bit position for LCD_WF40_BPALCD40. */
#define BM_LCD_WF40_BPALCD40 (0x01U)       /*!< Bit mask for LCD_WF40_BPALCD40. */
#define BS_LCD_WF40_BPALCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPALCD40. */

/*! @brief Read current value of the LCD_WF40_BPALCD40 field. */
#define BR_LCD_WF40_BPALCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPALCD40, BS_LCD_WF40_BPALCD40))

/*! @brief Format value for bitfield LCD_WF40_BPALCD40. */
#define BF_LCD_WF40_BPALCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPALCD40) & BM_LCD_WF40_BPALCD40)

/*! @brief Set the BPALCD40 field to a new value. */
#define BW_LCD_WF40_BPALCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPALCD40), BP_LCD_WF40_BPALCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPBLCD40[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF40_BPBLCD40 (1U)          /*!< Bit position for LCD_WF40_BPBLCD40. */
#define BM_LCD_WF40_BPBLCD40 (0x02U)       /*!< Bit mask for LCD_WF40_BPBLCD40. */
#define BS_LCD_WF40_BPBLCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPBLCD40. */

/*! @brief Read current value of the LCD_WF40_BPBLCD40 field. */
#define BR_LCD_WF40_BPBLCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPBLCD40, BS_LCD_WF40_BPBLCD40))

/*! @brief Format value for bitfield LCD_WF40_BPBLCD40. */
#define BF_LCD_WF40_BPBLCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPBLCD40) & BM_LCD_WF40_BPBLCD40)

/*! @brief Set the BPBLCD40 field to a new value. */
#define BW_LCD_WF40_BPBLCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPBLCD40), BP_LCD_WF40_BPBLCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPCLCD40[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF40_BPCLCD40 (2U)          /*!< Bit position for LCD_WF40_BPCLCD40. */
#define BM_LCD_WF40_BPCLCD40 (0x04U)       /*!< Bit mask for LCD_WF40_BPCLCD40. */
#define BS_LCD_WF40_BPCLCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPCLCD40. */

/*! @brief Read current value of the LCD_WF40_BPCLCD40 field. */
#define BR_LCD_WF40_BPCLCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPCLCD40, BS_LCD_WF40_BPCLCD40))

/*! @brief Format value for bitfield LCD_WF40_BPCLCD40. */
#define BF_LCD_WF40_BPCLCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPCLCD40) & BM_LCD_WF40_BPCLCD40)

/*! @brief Set the BPCLCD40 field to a new value. */
#define BW_LCD_WF40_BPCLCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPCLCD40), BP_LCD_WF40_BPCLCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPDLCD40[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF40_BPDLCD40 (3U)          /*!< Bit position for LCD_WF40_BPDLCD40. */
#define BM_LCD_WF40_BPDLCD40 (0x08U)       /*!< Bit mask for LCD_WF40_BPDLCD40. */
#define BS_LCD_WF40_BPDLCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPDLCD40. */

