theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF40_BPDLCD40 field. */
#define BR_LCD_WF40_BPDLCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPDLCD40, BS_LCD_WF40_BPDLCD40))

/*! @brief Format value for bitfield LCD_WF40_BPDLCD40. */
#define BF_LCD_WF40_BPDLCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPDLCD40) & BM_LCD_WF40_BPDLCD40)

/*! @brief Set the BPDLCD40 field to a new value. */
#define BW_LCD_WF40_BPDLCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPDLCD40), BP_LCD_WF40_BPDLCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPELCD40[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF40_BPELCD40 (4U)          /*!< Bit position for LCD_WF40_BPELCD40. */
#define BM_LCD_WF40_BPELCD40 (0x10U)       /*!< Bit mask for LCD_WF40_BPELCD40. */
#define BS_LCD_WF40_BPELCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPELCD40. */

/*! @brief Read current value of the LCD_WF40_BPELCD40 field. */
#define BR_LCD_WF40_BPELCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPELCD40, BS_LCD_WF40_BPELCD40))

/*! @brief Format value for bitfield LCD_WF40_BPELCD40. */
#define BF_LCD_WF40_BPELCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPELCD40) & BM_LCD_WF40_BPELCD40)

/*! @brief Set the BPELCD40 field to a new value. */
#define BW_LCD_WF40_BPELCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPELCD40), BP_LCD_WF40_BPELCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPFLCD40[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF40_BPFLCD40 (5U)          /*!< Bit position for LCD_WF40_BPFLCD40. */
#define BM_LCD_WF40_BPFLCD40 (0x20U)       /*!< Bit mask for LCD_WF40_BPFLCD40. */
#define BS_LCD_WF40_BPFLCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPFLCD40. */

/*! @brief Read current value of the LCD_WF40_BPFLCD40 field. */
#define BR_LCD_WF40_BPFLCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPFLCD40, BS_LCD_WF40_BPFLCD40))

/*! @brief Format value for bitfield LCD_WF40_BPFLCD40. */
#define BF_LCD_WF40_BPFLCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPFLCD40) & BM_LCD_WF40_BPFLCD40)

/*! @brief Set the BPFLCD40 field to a new value. */
#define BW_LCD_WF40_BPFLCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPFLCD40), BP_LCD_WF40_BPFLCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPGLCD40[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF40_BPGLCD40 (6U)          /*!< Bit position for LCD_WF40_BPGLCD40. */
#define BM_LCD_WF40_BPGLCD40 (0x40U)       /*!< Bit mask for LCD_WF40_BPGLCD40. */
#define BS_LCD_WF40_BPGLCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPGLCD40. */

/*! @brief Read current value of the LCD_WF40_BPGLCD40 field. */
#define BR_LCD_WF40_BPGLCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPGLCD40, BS_LCD_WF40_BPGLCD40))

/*! @brief Format value for bitfield LCD_WF40_BPGLCD40. */
#define BF_LCD_WF40_BPGLCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPGLCD40) & BM_LCD_WF40_BPGLCD40)

/*! @brief Set the BPGLCD40 field to a new value. */
#define BW_LCD_WF40_BPGLCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPGLCD40), BP_LCD_WF40_BPGLCD40, 1))
/*@}*/

/*!
 * @name Register LCD_WF40, field BPHLCD40[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF40_BPHLCD40 (7U)          /*!< Bit position for LCD_WF40_BPHLCD40. */
#define BM_LCD_WF40_BPHLCD40 (0x80U)       /*!< Bit mask for LCD_WF40_BPHLCD40. */
#define BS_LCD_WF40_BPHLCD40 (1U)          /*!< Bit field size in bits for LCD_WF40_BPHLCD40. */

/*! @brief Read current value of the LCD_WF40_BPHLCD40 field. */
#define BR_LCD_WF40_BPHLCD40(x) (BME_UBFX8(HW_LCD_WF40_ADDR(x), BP_LCD_WF40_BPHLCD40, BS_LCD_WF40_BPHLCD40))

/*! @brief Format value for bitfield LCD_WF40_BPHLCD40. */
#define BF_LCD_WF40_BPHLCD40(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF40_BPHLCD40) & BM_LCD_WF40_BPHLCD40)

/*! @brief Set the BPHLCD40 field to a new value. */
#define BW_LCD_WF40_BPHLCD40(x, v) (BME_BFI8(HW_LCD_WF40_ADDR(x), ((uint8_t)(v) << BP_LCD_WF40_BPHLCD40), BP_LCD_WF40_BPHLCD40, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF41 - LCD Waveform Register 41.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF41 - LCD Waveform Register 41. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf41
{
    uint8_t U;
    struct _hw_lcd_wf41_bitfields
    {
        uint8_t BPALCD41 : 1;          /*!< [0]  */
        uint8_t BPBLCD41 : 1;          /*!< [1]  */
        uint8_t BPCLCD41 : 1;          /*!< [2]  */
        uint8_t BPDLCD41 : 1;          /*!< [3]  */
        uint8_t BPELCD41 : 1;          /*!< [4]  */
        uint8_t BPFLCD41 : 1;          /*!< [5]  */
        uint8_t BPGLCD41 : 1;          /*!< [6]  */
        uint8_t BPHLCD41 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf41_t;

/*!
 * @name Constants and macros for entire LCD_WF41 register
 */
/*@{*/
#define HW_LCD_WF41_ADDR(x)      ((uint32_t)(x) + 0x49U)

#define HW_LCD_WF41(x)           (*(__IO hw_lcd_wf41_t *) HW_LCD_WF41_ADDR(x))
#define HW_LCD_WF41_RD(x)        (HW_LCD_WF41(x).U)
#define HW_LCD_WF41_WR(x, v)     (HW_LCD_WF41(x).U = (v))
#define HW_LCD_WF41_SET(x, v)    (BME_OR8(HW_LCD_WF41_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF41_CLR(x, v)    (BME_AND8(HW_LCD_WF41_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF41_TOG(x, v)    (BME_XOR8(HW_LCD_WF41_ADDR(x), (uint8_t)(v)))
/*@}*/

