theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF42_BPELCD42 field. */
#define BR_LCD_WF42_BPELCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPELCD42, BS_LCD_WF42_BPELCD42))

/*! @brief Format value for bitfield LCD_WF42_BPELCD42. */
#define BF_LCD_WF42_BPELCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPELCD42) & BM_LCD_WF42_BPELCD42)

/*! @brief Set the BPELCD42 field to a new value. */
#define BW_LCD_WF42_BPELCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPELCD42), BP_LCD_WF42_BPELCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPFLCD42[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF42_BPFLCD42 (5U)          /*!< Bit position for LCD_WF42_BPFLCD42. */
#define BM_LCD_WF42_BPFLCD42 (0x20U)       /*!< Bit mask for LCD_WF42_BPFLCD42. */
#define BS_LCD_WF42_BPFLCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPFLCD42. */

/*! @brief Read current value of the LCD_WF42_BPFLCD42 field. */
#define BR_LCD_WF42_BPFLCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPFLCD42, BS_LCD_WF42_BPFLCD42))

/*! @brief Format value for bitfield LCD_WF42_BPFLCD42. */
#define BF_LCD_WF42_BPFLCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPFLCD42) & BM_LCD_WF42_BPFLCD42)

/*! @brief Set the BPFLCD42 field to a new value. */
#define BW_LCD_WF42_BPFLCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPFLCD42), BP_LCD_WF42_BPFLCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPGLCD42[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF42_BPGLCD42 (6U)          /*!< Bit position for LCD_WF42_BPGLCD42. */
#define BM_LCD_WF42_BPGLCD42 (0x40U)       /*!< Bit mask for LCD_WF42_BPGLCD42. */
#define BS_LCD_WF42_BPGLCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPGLCD42. */

/*! @brief Read current value of the LCD_WF42_BPGLCD42 field. */
#define BR_LCD_WF42_BPGLCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPGLCD42, BS_LCD_WF42_BPGLCD42))

/*! @brief Format value for bitfield LCD_WF42_BPGLCD42. */
#define BF_LCD_WF42_BPGLCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPGLCD42) & BM_LCD_WF42_BPGLCD42)

/*! @brief Set the BPGLCD42 field to a new value. */
#define BW_LCD_WF42_BPGLCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPGLCD42), BP_LCD_WF42_BPGLCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPHLCD42[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF42_BPHLCD42 (7U)          /*!< Bit position for LCD_WF42_BPHLCD42. */
#define BM_LCD_WF42_BPHLCD42 (0x80U)       /*!< Bit mask for LCD_WF42_BPHLCD42. */
#define BS_LCD_WF42_BPHLCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPHLCD42. */

/*! @brief Read current value of the LCD_WF42_BPHLCD42 field. */
#define BR_LCD_WF42_BPHLCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPHLCD42, BS_LCD_WF42_BPHLCD42))

/*! @brief Format value for bitfield LCD_WF42_BPHLCD42. */
#define BF_LCD_WF42_BPHLCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPHLCD42) & BM_LCD_WF42_BPHLCD42)

/*! @brief Set the BPHLCD42 field to a new value. */
#define BW_LCD_WF42_BPHLCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPHLCD42), BP_LCD_WF42_BPHLCD42, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF43 - LCD Waveform Register 43.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF43 - LCD Waveform Register 43. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf43
{
    uint8_t U;
    struct _hw_lcd_wf43_bitfields
    {
        uint8_t BPALCD43 : 1;          /*!< [0]  */
        uint8_t BPBLCD43 : 1;          /*!< [1]  */
        uint8_t BPCLCD43 : 1;          /*!< [2]  */
        uint8_t BPDLCD43 : 1;          /*!< [3]  */
        uint8_t BPELCD43 : 1;          /*!< [4]  */
        uint8_t BPFLCD43 : 1;          /*!< [5]  */
        uint8_t BPGLCD43 : 1;          /*!< [6]  */
        uint8_t BPHLCD43 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf43_t;

/*!
 * @name Constants and macros for entire LCD_WF43 register
 */
/*@{*/
#define HW_LCD_WF43_ADDR(x)      ((uint32_t)(x) + 0x4BU)

#define HW_LCD_WF43(x)           (*(__IO hw_lcd_wf43_t *) HW_LCD_WF43_ADDR(x))
#define HW_LCD_WF43_RD(x)        (HW_LCD_WF43(x).U)
#define HW_LCD_WF43_WR(x, v)     (HW_LCD_WF43(x).U = (v))
#define HW_LCD_WF43_SET(x, v)    (BME_OR8(HW_LCD_WF43_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF43_CLR(x, v)    (BME_AND8(HW_LCD_WF43_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF43_TOG(x, v)    (BME_XOR8(HW_LCD_WF43_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF43 bitfields
 */

/*!
 * @name Register LCD_WF43, field BPALCD43[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF43_BPALCD43 (0U)          /*!< Bit position for LCD_WF43_BPALCD43. */
#define BM_LCD_WF43_BPALCD43 (0x01U)       /*!< Bit mask for LCD_WF43_BPALCD43. */
#define BS_LCD_WF43_BPALCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPALCD43. */

/*! @brief Read current value of the LCD_WF43_BPALCD43 field. */
#define BR_LCD_WF43_BPALCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPALCD43, BS_LCD_WF43_BPALCD43))

/*! @brief Format value for bitfield LCD_WF43_BPALCD43. */
#define BF_LCD_WF43_BPALCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPALCD43) & BM_LCD_WF43_BPALCD43)

/*! @brief Set the BPALCD43 field to a new value. */
#define BW_LCD_WF43_BPALCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPALCD43), BP_LCD_WF43_BPALCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPBLCD43[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF43_BPBLCD43 (1U)          /*!< Bit position for LCD_WF43_BPBLCD43. */
#define BM_LCD_WF43_BPBLCD43 (0x02U)       /*!< Bit mask for LCD_WF43_BPBLCD43. */
#define BS_LCD_WF43_BPBLCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPBLCD43. */

/*! @brief Read current value of the LCD_WF43_BPBLCD43 field. */
#define BR_LCD_WF43_BPBLCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPBLCD43, BS_LCD_WF43_BPBLCD43))

