theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield LCD_WF43_BPBLCD43. */
#define BF_LCD_WF43_BPBLCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPBLCD43) & BM_LCD_WF43_BPBLCD43)

/*! @brief Set the BPBLCD43 field to a new value. */
#define BW_LCD_WF43_BPBLCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPBLCD43), BP_LCD_WF43_BPBLCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPCLCD43[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF43_BPCLCD43 (2U)          /*!< Bit position for LCD_WF43_BPCLCD43. */
#define BM_LCD_WF43_BPCLCD43 (0x04U)       /*!< Bit mask for LCD_WF43_BPCLCD43. */
#define BS_LCD_WF43_BPCLCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPCLCD43. */

/*! @brief Read current value of the LCD_WF43_BPCLCD43 field. */
#define BR_LCD_WF43_BPCLCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPCLCD43, BS_LCD_WF43_BPCLCD43))

/*! @brief Format value for bitfield LCD_WF43_BPCLCD43. */
#define BF_LCD_WF43_BPCLCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPCLCD43) & BM_LCD_WF43_BPCLCD43)

/*! @brief Set the BPCLCD43 field to a new value. */
#define BW_LCD_WF43_BPCLCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPCLCD43), BP_LCD_WF43_BPCLCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPDLCD43[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF43_BPDLCD43 (3U)          /*!< Bit position for LCD_WF43_BPDLCD43. */
#define BM_LCD_WF43_BPDLCD43 (0x08U)       /*!< Bit mask for LCD_WF43_BPDLCD43. */
#define BS_LCD_WF43_BPDLCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPDLCD43. */

/*! @brief Read current value of the LCD_WF43_BPDLCD43 field. */
#define BR_LCD_WF43_BPDLCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPDLCD43, BS_LCD_WF43_BPDLCD43))

/*! @brief Format value for bitfield LCD_WF43_BPDLCD43. */
#define BF_LCD_WF43_BPDLCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPDLCD43) & BM_LCD_WF43_BPDLCD43)

/*! @brief Set the BPDLCD43 field to a new value. */
#define BW_LCD_WF43_BPDLCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPDLCD43), BP_LCD_WF43_BPDLCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPELCD43[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF43_BPELCD43 (4U)          /*!< Bit position for LCD_WF43_BPELCD43. */
#define BM_LCD_WF43_BPELCD43 (0x10U)       /*!< Bit mask for LCD_WF43_BPELCD43. */
#define BS_LCD_WF43_BPELCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPELCD43. */

/*! @brief Read current value of the LCD_WF43_BPELCD43 field. */
#define BR_LCD_WF43_BPELCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPELCD43, BS_LCD_WF43_BPELCD43))

/*! @brief Format value for bitfield LCD_WF43_BPELCD43. */
#define BF_LCD_WF43_BPELCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPELCD43) & BM_LCD_WF43_BPELCD43)

/*! @brief Set the BPELCD43 field to a new value. */
#define BW_LCD_WF43_BPELCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPELCD43), BP_LCD_WF43_BPELCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPFLCD43[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF43_BPFLCD43 (5U)          /*!< Bit position for LCD_WF43_BPFLCD43. */
#define BM_LCD_WF43_BPFLCD43 (0x20U)       /*!< Bit mask for LCD_WF43_BPFLCD43. */
#define BS_LCD_WF43_BPFLCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPFLCD43. */

/*! @brief Read current value of the LCD_WF43_BPFLCD43 field. */
#define BR_LCD_WF43_BPFLCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPFLCD43, BS_LCD_WF43_BPFLCD43))

/*! @brief Format value for bitfield LCD_WF43_BPFLCD43. */
#define BF_LCD_WF43_BPFLCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPFLCD43) & BM_LCD_WF43_BPFLCD43)

/*! @brief Set the BPFLCD43 field to a new value. */
#define BW_LCD_WF43_BPFLCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPFLCD43), BP_LCD_WF43_BPFLCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPGLCD43[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF43_BPGLCD43 (6U)          /*!< Bit position for LCD_WF43_BPGLCD43. */
#define BM_LCD_WF43_BPGLCD43 (0x40U)       /*!< Bit mask for LCD_WF43_BPGLCD43. */
#define BS_LCD_WF43_BPGLCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPGLCD43. */

/*! @brief Read current value of the LCD_WF43_BPGLCD43 field. */
#define BR_LCD_WF43_BPGLCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPGLCD43, BS_LCD_WF43_BPGLCD43))

/*! @brief Format value for bitfield LCD_WF43_BPGLCD43. */
#define BF_LCD_WF43_BPGLCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPGLCD43) & BM_LCD_WF43_BPGLCD43)

/*! @brief Set the BPGLCD43 field to a new value. */
#define BW_LCD_WF43_BPGLCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPGLCD43), BP_LCD_WF43_BPGLCD43, 1))
/*@}*/

/*!
 * @name Register LCD_WF43, field BPHLCD43[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF43_BPHLCD43 (7U)          /*!< Bit position for LCD_WF43_BPHLCD43. */
#define BM_LCD_WF43_BPHLCD43 (0x80U)       /*!< Bit mask for LCD_WF43_BPHLCD43. */
#define BS_LCD_WF43_BPHLCD43 (1U)          /*!< Bit field size in bits for LCD_WF43_BPHLCD43. */

/*! @brief Read current value of the LCD_WF43_BPHLCD43 field. */
#define BR_LCD_WF43_BPHLCD43(x) (BME_UBFX8(HW_LCD_WF43_ADDR(x), BP_LCD_WF43_BPHLCD43, BS_LCD_WF43_BPHLCD43))

/*! @brief Format value for bitfield LCD_WF43_BPHLCD43. */
#define BF_LCD_WF43_BPHLCD43(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF43_BPHLCD43) & BM_LCD_WF43_BPHLCD43)

/*! @brief Set the BPHLCD43 field to a new value. */
#define BW_LCD_WF43_BPHLCD43(x, v) (BME_BFI8(HW_LCD_WF43_ADDR(x), ((uint8_t)(v) << BP_LCD_WF43_BPHLCD43), BP_LCD_WF43_BPHLCD43, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF44 - LCD Waveform Register 44.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF44 - LCD Waveform Register 44. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf44
{
    uint8_t U;
    struct _hw_lcd_wf44_bitfields
    {
        uint8_t BPALCD44 : 1;          /*!< [0]  */
        uint8_t BPBLCD44 : 1;          /*!< [1]  */
        uint8_t BPCLCD44 : 1;          /*!< [2]  */
        uint8_t BPDLCD44 : 1;          /*!< [3]  */
        uint8_t BPELCD44 : 1;          /*!< [4]  */
        uint8_t BPFLCD44 : 1;          /*!< [5]  */
        uint8_t BPGLCD44 : 1;          /*!< [6]  */
        uint8_t BPHLCD44 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf44_t;

/*!
 * @name Constants and macros for entire LCD_WF44 register
 */
/*@{*/
#define HW_LCD_WF44_ADDR(x)      ((uint32_t)(x) + 0x4CU)

#define HW_LCD_WF44(x)           (*(__IO hw_lcd_wf44_t *) HW_LCD_WF44_ADDR(x))
#define HW_LCD_WF44_RD(x)        (HW_LCD_WF44(x).U)
#define HW_LCD_WF44_WR(x, v)     (HW_LCD_WF44(x).U = (v))
#define HW_LCD_WF44_SET(x, v)    (BME_OR8(HW_LCD_WF44_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF44_CLR(x, v)    (BME_AND8(HW_LCD_WF44_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF44_TOG(x, v)    (BME_XOR8(HW_LCD_WF44_ADDR(x), (uint8_t)(v)))
/*@}*/

