theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*
 * Constants & macros for individual LCD_WF44 bitfields
 */

/*!
 * @name Register LCD_WF44, field BPALCD44[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF44_BPALCD44 (0U)          /*!< Bit position for LCD_WF44_BPALCD44. */
#define BM_LCD_WF44_BPALCD44 (0x01U)       /*!< Bit mask for LCD_WF44_BPALCD44. */
#define BS_LCD_WF44_BPALCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPALCD44. */

/*! @brief Read current value of the LCD_WF44_BPALCD44 field. */
#define BR_LCD_WF44_BPALCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPALCD44, BS_LCD_WF44_BPALCD44))

/*! @brief Format value for bitfield LCD_WF44_BPALCD44. */
#define BF_LCD_WF44_BPALCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPALCD44) & BM_LCD_WF44_BPALCD44)

/*! @brief Set the BPALCD44 field to a new value. */
#define BW_LCD_WF44_BPALCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPALCD44), BP_LCD_WF44_BPALCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPBLCD44[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF44_BPBLCD44 (1U)          /*!< Bit position for LCD_WF44_BPBLCD44. */
#define BM_LCD_WF44_BPBLCD44 (0x02U)       /*!< Bit mask for LCD_WF44_BPBLCD44. */
#define BS_LCD_WF44_BPBLCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPBLCD44. */

/*! @brief Read current value of the LCD_WF44_BPBLCD44 field. */
#define BR_LCD_WF44_BPBLCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPBLCD44, BS_LCD_WF44_BPBLCD44))

/*! @brief Format value for bitfield LCD_WF44_BPBLCD44. */
#define BF_LCD_WF44_BPBLCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPBLCD44) & BM_LCD_WF44_BPBLCD44)

/*! @brief Set the BPBLCD44 field to a new value. */
#define BW_LCD_WF44_BPBLCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPBLCD44), BP_LCD_WF44_BPBLCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPCLCD44[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF44_BPCLCD44 (2U)          /*!< Bit position for LCD_WF44_BPCLCD44. */
#define BM_LCD_WF44_BPCLCD44 (0x04U)       /*!< Bit mask for LCD_WF44_BPCLCD44. */
#define BS_LCD_WF44_BPCLCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPCLCD44. */

/*! @brief Read current value of the LCD_WF44_BPCLCD44 field. */
#define BR_LCD_WF44_BPCLCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPCLCD44, BS_LCD_WF44_BPCLCD44))

/*! @brief Format value for bitfield LCD_WF44_BPCLCD44. */
#define BF_LCD_WF44_BPCLCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPCLCD44) & BM_LCD_WF44_BPCLCD44)

/*! @brief Set the BPCLCD44 field to a new value. */
#define BW_LCD_WF44_BPCLCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPCLCD44), BP_LCD_WF44_BPCLCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPDLCD44[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF44_BPDLCD44 (3U)          /*!< Bit position for LCD_WF44_BPDLCD44. */
#define BM_LCD_WF44_BPDLCD44 (0x08U)       /*!< Bit mask for LCD_WF44_BPDLCD44. */
#define BS_LCD_WF44_BPDLCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPDLCD44. */

/*! @brief Read current value of the LCD_WF44_BPDLCD44 field. */
#define BR_LCD_WF44_BPDLCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPDLCD44, BS_LCD_WF44_BPDLCD44))

/*! @brief Format value for bitfield LCD_WF44_BPDLCD44. */
#define BF_LCD_WF44_BPDLCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPDLCD44) & BM_LCD_WF44_BPDLCD44)

/*! @brief Set the BPDLCD44 field to a new value. */
#define BW_LCD_WF44_BPDLCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPDLCD44), BP_LCD_WF44_BPDLCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPELCD44[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF44_BPELCD44 (4U)          /*!< Bit position for LCD_WF44_BPELCD44. */
#define BM_LCD_WF44_BPELCD44 (0x10U)       /*!< Bit mask for LCD_WF44_BPELCD44. */
#define BS_LCD_WF44_BPELCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPELCD44. */

/*! @brief Read current value of the LCD_WF44_BPELCD44 field. */
#define BR_LCD_WF44_BPELCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPELCD44, BS_LCD_WF44_BPELCD44))

/*! @brief Format value for bitfield LCD_WF44_BPELCD44. */
#define BF_LCD_WF44_BPELCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPELCD44) & BM_LCD_WF44_BPELCD44)

/*! @brief Set the BPELCD44 field to a new value. */
#define BW_LCD_WF44_BPELCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPELCD44), BP_LCD_WF44_BPELCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPFLCD44[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF44_BPFLCD44 (5U)          /*!< Bit position for LCD_WF44_BPFLCD44. */
#define BM_LCD_WF44_BPFLCD44 (0x20U)       /*!< Bit mask for LCD_WF44_BPFLCD44. */
#define BS_LCD_WF44_BPFLCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPFLCD44. */

/*! @brief Read current value of the LCD_WF44_BPFLCD44 field. */
#define BR_LCD_WF44_BPFLCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPFLCD44, BS_LCD_WF44_BPFLCD44))

/*! @brief Format value for bitfield LCD_WF44_BPFLCD44. */
#define BF_LCD_WF44_BPFLCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPFLCD44) & BM_LCD_WF44_BPFLCD44)

/*! @brief Set the BPFLCD44 field to a new value. */
#define BW_LCD_WF44_BPFLCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPFLCD44), BP_LCD_WF44_BPFLCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPGLCD44[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF44_BPGLCD44 (6U)          /*!< Bit position for LCD_WF44_BPGLCD44. */
#define BM_LCD_WF44_BPGLCD44 (0x40U)       /*!< Bit mask for LCD_WF44_BPGLCD44. */
#define BS_LCD_WF44_BPGLCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPGLCD44. */

/*! @brief Read current value of the LCD_WF44_BPGLCD44 field. */
#define BR_LCD_WF44_BPGLCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPGLCD44, BS_LCD_WF44_BPGLCD44))

