theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF48_BPFLCD48 field. */
#define BR_LCD_WF48_BPFLCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPFLCD48, BS_LCD_WF48_BPFLCD48))

/*! @brief Format value for bitfield LCD_WF48_BPFLCD48. */
#define BF_LCD_WF48_BPFLCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPFLCD48) & BM_LCD_WF48_BPFLCD48)

/*! @brief Set the BPFLCD48 field to a new value. */
#define BW_LCD_WF48_BPFLCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPFLCD48), BP_LCD_WF48_BPFLCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPGLCD48[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF48_BPGLCD48 (6U)          /*!< Bit position for LCD_WF48_BPGLCD48. */
#define BM_LCD_WF48_BPGLCD48 (0x40U)       /*!< Bit mask for LCD_WF48_BPGLCD48. */
#define BS_LCD_WF48_BPGLCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPGLCD48. */

/*! @brief Read current value of the LCD_WF48_BPGLCD48 field. */
#define BR_LCD_WF48_BPGLCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPGLCD48, BS_LCD_WF48_BPGLCD48))

/*! @brief Format value for bitfield LCD_WF48_BPGLCD48. */
#define BF_LCD_WF48_BPGLCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPGLCD48) & BM_LCD_WF48_BPGLCD48)

/*! @brief Set the BPGLCD48 field to a new value. */
#define BW_LCD_WF48_BPGLCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPGLCD48), BP_LCD_WF48_BPGLCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPHLCD48[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF48_BPHLCD48 (7U)          /*!< Bit position for LCD_WF48_BPHLCD48. */
#define BM_LCD_WF48_BPHLCD48 (0x80U)       /*!< Bit mask for LCD_WF48_BPHLCD48. */
#define BS_LCD_WF48_BPHLCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPHLCD48. */

/*! @brief Read current value of the LCD_WF48_BPHLCD48 field. */
#define BR_LCD_WF48_BPHLCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPHLCD48, BS_LCD_WF48_BPHLCD48))

/*! @brief Format value for bitfield LCD_WF48_BPHLCD48. */
#define BF_LCD_WF48_BPHLCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPHLCD48) & BM_LCD_WF48_BPHLCD48)

/*! @brief Set the BPHLCD48 field to a new value. */
#define BW_LCD_WF48_BPHLCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPHLCD48), BP_LCD_WF48_BPHLCD48, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF49 - LCD Waveform Register 49.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF49 - LCD Waveform Register 49. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf49
{
    uint8_t U;
    struct _hw_lcd_wf49_bitfields
    {
        uint8_t BPALCD49 : 1;          /*!< [0]  */
        uint8_t BPBLCD49 : 1;          /*!< [1]  */
        uint8_t BPCLCD49 : 1;          /*!< [2]  */
        uint8_t BPDLCD49 : 1;          /*!< [3]  */
        uint8_t BPELCD49 : 1;          /*!< [4]  */
        uint8_t BPFLCD49 : 1;          /*!< [5]  */
        uint8_t BPGLCD49 : 1;          /*!< [6]  */
        uint8_t BPHLCD49 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf49_t;

/*!
 * @name Constants and macros for entire LCD_WF49 register
 */
/*@{*/
#define HW_LCD_WF49_ADDR(x)      ((uint32_t)(x) + 0x51U)

#define HW_LCD_WF49(x)           (*(__IO hw_lcd_wf49_t *) HW_LCD_WF49_ADDR(x))
#define HW_LCD_WF49_RD(x)        (HW_LCD_WF49(x).U)
#define HW_LCD_WF49_WR(x, v)     (HW_LCD_WF49(x).U = (v))
#define HW_LCD_WF49_SET(x, v)    (BME_OR8(HW_LCD_WF49_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF49_CLR(x, v)    (BME_AND8(HW_LCD_WF49_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF49_TOG(x, v)    (BME_XOR8(HW_LCD_WF49_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF49 bitfields
 */

/*!
 * @name Register LCD_WF49, field BPALCD49[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF49_BPALCD49 (0U)          /*!< Bit position for LCD_WF49_BPALCD49. */
#define BM_LCD_WF49_BPALCD49 (0x01U)       /*!< Bit mask for LCD_WF49_BPALCD49. */
#define BS_LCD_WF49_BPALCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPALCD49. */

/*! @brief Read current value of the LCD_WF49_BPALCD49 field. */
#define BR_LCD_WF49_BPALCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPALCD49, BS_LCD_WF49_BPALCD49))

/*! @brief Format value for bitfield LCD_WF49_BPALCD49. */
#define BF_LCD_WF49_BPALCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPALCD49) & BM_LCD_WF49_BPALCD49)

/*! @brief Set the BPALCD49 field to a new value. */
#define BW_LCD_WF49_BPALCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPALCD49), BP_LCD_WF49_BPALCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPBLCD49[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF49_BPBLCD49 (1U)          /*!< Bit position for LCD_WF49_BPBLCD49. */
#define BM_LCD_WF49_BPBLCD49 (0x02U)       /*!< Bit mask for LCD_WF49_BPBLCD49. */
#define BS_LCD_WF49_BPBLCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPBLCD49. */

/*! @brief Read current value of the LCD_WF49_BPBLCD49 field. */
#define BR_LCD_WF49_BPBLCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPBLCD49, BS_LCD_WF49_BPBLCD49))

/*! @brief Format value for bitfield LCD_WF49_BPBLCD49. */
#define BF_LCD_WF49_BPBLCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPBLCD49) & BM_LCD_WF49_BPBLCD49)

/*! @brief Set the BPBLCD49 field to a new value. */
#define BW_LCD_WF49_BPBLCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPBLCD49), BP_LCD_WF49_BPBLCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPCLCD49[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF49_BPCLCD49 (2U)          /*!< Bit position for LCD_WF49_BPCLCD49. */
#define BM_LCD_WF49_BPCLCD49 (0x04U)       /*!< Bit mask for LCD_WF49_BPCLCD49. */
#define BS_LCD_WF49_BPCLCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPCLCD49. */

