theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the BPDLCD51 field to a new value. */
#define BW_LCD_WF51_BPDLCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPDLCD51), BP_LCD_WF51_BPDLCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPELCD51[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF51_BPELCD51 (4U)          /*!< Bit position for LCD_WF51_BPELCD51. */
#define BM_LCD_WF51_BPELCD51 (0x10U)       /*!< Bit mask for LCD_WF51_BPELCD51. */
#define BS_LCD_WF51_BPELCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPELCD51. */

/*! @brief Read current value of the LCD_WF51_BPELCD51 field. */
#define BR_LCD_WF51_BPELCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPELCD51, BS_LCD_WF51_BPELCD51))

/*! @brief Format value for bitfield LCD_WF51_BPELCD51. */
#define BF_LCD_WF51_BPELCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPELCD51) & BM_LCD_WF51_BPELCD51)

/*! @brief Set the BPELCD51 field to a new value. */
#define BW_LCD_WF51_BPELCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPELCD51), BP_LCD_WF51_BPELCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPFLCD51[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF51_BPFLCD51 (5U)          /*!< Bit position for LCD_WF51_BPFLCD51. */
#define BM_LCD_WF51_BPFLCD51 (0x20U)       /*!< Bit mask for LCD_WF51_BPFLCD51. */
#define BS_LCD_WF51_BPFLCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPFLCD51. */

/*! @brief Read current value of the LCD_WF51_BPFLCD51 field. */
#define BR_LCD_WF51_BPFLCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPFLCD51, BS_LCD_WF51_BPFLCD51))

/*! @brief Format value for bitfield LCD_WF51_BPFLCD51. */
#define BF_LCD_WF51_BPFLCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPFLCD51) & BM_LCD_WF51_BPFLCD51)

/*! @brief Set the BPFLCD51 field to a new value. */
#define BW_LCD_WF51_BPFLCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPFLCD51), BP_LCD_WF51_BPFLCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPGLCD51[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF51_BPGLCD51 (6U)          /*!< Bit position for LCD_WF51_BPGLCD51. */
#define BM_LCD_WF51_BPGLCD51 (0x40U)       /*!< Bit mask for LCD_WF51_BPGLCD51. */
#define BS_LCD_WF51_BPGLCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPGLCD51. */

/*! @brief Read current value of the LCD_WF51_BPGLCD51 field. */
#define BR_LCD_WF51_BPGLCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPGLCD51, BS_LCD_WF51_BPGLCD51))

/*! @brief Format value for bitfield LCD_WF51_BPGLCD51. */
#define BF_LCD_WF51_BPGLCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPGLCD51) & BM_LCD_WF51_BPGLCD51)

/*! @brief Set the BPGLCD51 field to a new value. */
#define BW_LCD_WF51_BPGLCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPGLCD51), BP_LCD_WF51_BPGLCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPHLCD51[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF51_BPHLCD51 (7U)          /*!< Bit position for LCD_WF51_BPHLCD51. */
#define BM_LCD_WF51_BPHLCD51 (0x80U)       /*!< Bit mask for LCD_WF51_BPHLCD51. */
#define BS_LCD_WF51_BPHLCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPHLCD51. */

/*! @brief Read current value of the LCD_WF51_BPHLCD51 field. */
#define BR_LCD_WF51_BPHLCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPHLCD51, BS_LCD_WF51_BPHLCD51))

/*! @brief Format value for bitfield LCD_WF51_BPHLCD51. */
#define BF_LCD_WF51_BPHLCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPHLCD51) & BM_LCD_WF51_BPHLCD51)

/*! @brief Set the BPHLCD51 field to a new value. */
#define BW_LCD_WF51_BPHLCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPHLCD51), BP_LCD_WF51_BPHLCD51, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF52 - LCD Waveform Register 52.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF52 - LCD Waveform Register 52. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf52
{
    uint8_t U;
    struct _hw_lcd_wf52_bitfields
    {
        uint8_t BPALCD52 : 1;          /*!< [0]  */
        uint8_t BPBLCD52 : 1;          /*!< [1]  */
        uint8_t BPCLCD52 : 1;          /*!< [2]  */
        uint8_t BPDLCD52 : 1;          /*!< [3]  */
        uint8_t BPELCD52 : 1;          /*!< [4]  */
        uint8_t BPFLCD52 : 1;          /*!< [5]  */
        uint8_t BPGLCD52 : 1;          /*!< [6]  */
        uint8_t BPHLCD52 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf52_t;

/*!
 * @name Constants and macros for entire LCD_WF52 register
 */
/*@{*/
#define HW_LCD_WF52_ADDR(x)      ((uint32_t)(x) + 0x54U)

#define HW_LCD_WF52(x)           (*(__IO hw_lcd_wf52_t *) HW_LCD_WF52_ADDR(x))
#define HW_LCD_WF52_RD(x)        (HW_LCD_WF52(x).U)
#define HW_LCD_WF52_WR(x, v)     (HW_LCD_WF52(x).U = (v))
#define HW_LCD_WF52_SET(x, v)    (BME_OR8(HW_LCD_WF52_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF52_CLR(x, v)    (BME_AND8(HW_LCD_WF52_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF52_TOG(x, v)    (BME_XOR8(HW_LCD_WF52_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF52 bitfields
 */

/*!
 * @name Register LCD_WF52, field BPALCD52[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF52_BPALCD52 (0U)          /*!< Bit position for LCD_WF52_BPALCD52. */
#define BM_LCD_WF52_BPALCD52 (0x01U)       /*!< Bit mask for LCD_WF52_BPALCD52. */
#define BS_LCD_WF52_BPALCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPALCD52. */

/*! @brief Read current value of the LCD_WF52_BPALCD52 field. */
#define BR_LCD_WF52_BPALCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPALCD52, BS_LCD_WF52_BPALCD52))

