theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF52_BPHLCD52 field. */
#define BR_LCD_WF52_BPHLCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPHLCD52, BS_LCD_WF52_BPHLCD52))

/*! @brief Format value for bitfield LCD_WF52_BPHLCD52. */
#define BF_LCD_WF52_BPHLCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPHLCD52) & BM_LCD_WF52_BPHLCD52)

/*! @brief Set the BPHLCD52 field to a new value. */
#define BW_LCD_WF52_BPHLCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPHLCD52), BP_LCD_WF52_BPHLCD52, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF53 - LCD Waveform Register 53.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF53 - LCD Waveform Register 53. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf53
{
    uint8_t U;
    struct _hw_lcd_wf53_bitfields
    {
        uint8_t BPALCD53 : 1;          /*!< [0]  */
        uint8_t BPBLCD53 : 1;          /*!< [1]  */
        uint8_t BPCLCD53 : 1;          /*!< [2]  */
        uint8_t BPDLCD53 : 1;          /*!< [3]  */
        uint8_t BPELCD53 : 1;          /*!< [4]  */
        uint8_t BPFLCD53 : 1;          /*!< [5]  */
        uint8_t BPGLCD53 : 1;          /*!< [6]  */
        uint8_t BPHLCD53 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf53_t;

/*!
 * @name Constants and macros for entire LCD_WF53 register
 */
/*@{*/
#define HW_LCD_WF53_ADDR(x)      ((uint32_t)(x) + 0x55U)

#define HW_LCD_WF53(x)           (*(__IO hw_lcd_wf53_t *) HW_LCD_WF53_ADDR(x))
#define HW_LCD_WF53_RD(x)        (HW_LCD_WF53(x).U)
#define HW_LCD_WF53_WR(x, v)     (HW_LCD_WF53(x).U = (v))
#define HW_LCD_WF53_SET(x, v)    (BME_OR8(HW_LCD_WF53_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF53_CLR(x, v)    (BME_AND8(HW_LCD_WF53_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF53_TOG(x, v)    (BME_XOR8(HW_LCD_WF53_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF53 bitfields
 */

/*!
 * @name Register LCD_WF53, field BPALCD53[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF53_BPALCD53 (0U)          /*!< Bit position for LCD_WF53_BPALCD53. */
#define BM_LCD_WF53_BPALCD53 (0x01U)       /*!< Bit mask for LCD_WF53_BPALCD53. */
#define BS_LCD_WF53_BPALCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPALCD53. */

/*! @brief Read current value of the LCD_WF53_BPALCD53 field. */
#define BR_LCD_WF53_BPALCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPALCD53, BS_LCD_WF53_BPALCD53))

/*! @brief Format value for bitfield LCD_WF53_BPALCD53. */
#define BF_LCD_WF53_BPALCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPALCD53) & BM_LCD_WF53_BPALCD53)

/*! @brief Set the BPALCD53 field to a new value. */
#define BW_LCD_WF53_BPALCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPALCD53), BP_LCD_WF53_BPALCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPBLCD53[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF53_BPBLCD53 (1U)          /*!< Bit position for LCD_WF53_BPBLCD53. */
#define BM_LCD_WF53_BPBLCD53 (0x02U)       /*!< Bit mask for LCD_WF53_BPBLCD53. */
#define BS_LCD_WF53_BPBLCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPBLCD53. */

/*! @brief Read current value of the LCD_WF53_BPBLCD53 field. */
#define BR_LCD_WF53_BPBLCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPBLCD53, BS_LCD_WF53_BPBLCD53))

/*! @brief Format value for bitfield LCD_WF53_BPBLCD53. */
#define BF_LCD_WF53_BPBLCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPBLCD53) & BM_LCD_WF53_BPBLCD53)

/*! @brief Set the BPBLCD53 field to a new value. */
#define BW_LCD_WF53_BPBLCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPBLCD53), BP_LCD_WF53_BPBLCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPCLCD53[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF53_BPCLCD53 (2U)          /*!< Bit position for LCD_WF53_BPCLCD53. */
#define BM_LCD_WF53_BPCLCD53 (0x04U)       /*!< Bit mask for LCD_WF53_BPCLCD53. */
#define BS_LCD_WF53_BPCLCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPCLCD53. */

/*! @brief Read current value of the LCD_WF53_BPCLCD53 field. */
#define BR_LCD_WF53_BPCLCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPCLCD53, BS_LCD_WF53_BPCLCD53))

/*! @brief Format value for bitfield LCD_WF53_BPCLCD53. */
#define BF_LCD_WF53_BPCLCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPCLCD53) & BM_LCD_WF53_BPCLCD53)

/*! @brief Set the BPCLCD53 field to a new value. */
#define BW_LCD_WF53_BPCLCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPCLCD53), BP_LCD_WF53_BPCLCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPDLCD53[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF53_BPDLCD53 (3U)          /*!< Bit position for LCD_WF53_BPDLCD53. */
#define BM_LCD_WF53_BPDLCD53 (0x08U)       /*!< Bit mask for LCD_WF53_BPDLCD53. */
#define BS_LCD_WF53_BPDLCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPDLCD53. */

/*! @brief Read current value of the LCD_WF53_BPDLCD53 field. */
#define BR_LCD_WF53_BPDLCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPDLCD53, BS_LCD_WF53_BPDLCD53))

/*! @brief Format value for bitfield LCD_WF53_BPDLCD53. */
#define BF_LCD_WF53_BPDLCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPDLCD53) & BM_LCD_WF53_BPDLCD53)

/*! @brief Set the BPDLCD53 field to a new value. */
#define BW_LCD_WF53_BPDLCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPDLCD53), BP_LCD_WF53_BPDLCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPELCD53[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF53_BPELCD53 (4U)          /*!< Bit position for LCD_WF53_BPELCD53. */
#define BM_LCD_WF53_BPELCD53 (0x10U)       /*!< Bit mask for LCD_WF53_BPELCD53. */
#define BS_LCD_WF53_BPELCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPELCD53. */

/*! @brief Read current value of the LCD_WF53_BPELCD53 field. */
#define BR_LCD_WF53_BPELCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPELCD53, BS_LCD_WF53_BPELCD53))

