theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF55_BPHLCD55 field. */
#define BR_LCD_WF55_BPHLCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPHLCD55, BS_LCD_WF55_BPHLCD55))

/*! @brief Format value for bitfield LCD_WF55_BPHLCD55. */
#define BF_LCD_WF55_BPHLCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPHLCD55) & BM_LCD_WF55_BPHLCD55)

/*! @brief Set the BPHLCD55 field to a new value. */
#define BW_LCD_WF55_BPHLCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPHLCD55), BP_LCD_WF55_BPHLCD55, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF56 - LCD Waveform Register 56.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF56 - LCD Waveform Register 56. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf56
{
    uint8_t U;
    struct _hw_lcd_wf56_bitfields
    {
        uint8_t BPALCD56 : 1;          /*!< [0]  */
        uint8_t BPBLCD56 : 1;          /*!< [1]  */
        uint8_t BPCLCD56 : 1;          /*!< [2]  */
        uint8_t BPDLCD56 : 1;          /*!< [3]  */
        uint8_t BPELCD56 : 1;          /*!< [4]  */
        uint8_t BPFLCD56 : 1;          /*!< [5]  */
        uint8_t BPGLCD56 : 1;          /*!< [6]  */
        uint8_t BPHLCD56 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf56_t;

/*!
 * @name Constants and macros for entire LCD_WF56 register
 */
/*@{*/
#define HW_LCD_WF56_ADDR(x)      ((uint32_t)(x) + 0x58U)

#define HW_LCD_WF56(x)           (*(__IO hw_lcd_wf56_t *) HW_LCD_WF56_ADDR(x))
#define HW_LCD_WF56_RD(x)        (HW_LCD_WF56(x).U)
#define HW_LCD_WF56_WR(x, v)     (HW_LCD_WF56(x).U = (v))
#define HW_LCD_WF56_SET(x, v)    (BME_OR8(HW_LCD_WF56_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF56_CLR(x, v)    (BME_AND8(HW_LCD_WF56_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF56_TOG(x, v)    (BME_XOR8(HW_LCD_WF56_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF56 bitfields
 */

/*!
 * @name Register LCD_WF56, field BPALCD56[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF56_BPALCD56 (0U)          /*!< Bit position for LCD_WF56_BPALCD56. */
#define BM_LCD_WF56_BPALCD56 (0x01U)       /*!< Bit mask for LCD_WF56_BPALCD56. */
#define BS_LCD_WF56_BPALCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPALCD56. */

/*! @brief Read current value of the LCD_WF56_BPALCD56 field. */
#define BR_LCD_WF56_BPALCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPALCD56, BS_LCD_WF56_BPALCD56))

/*! @brief Format value for bitfield LCD_WF56_BPALCD56. */
#define BF_LCD_WF56_BPALCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPALCD56) & BM_LCD_WF56_BPALCD56)

/*! @brief Set the BPALCD56 field to a new value. */
#define BW_LCD_WF56_BPALCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPALCD56), BP_LCD_WF56_BPALCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPBLCD56[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF56_BPBLCD56 (1U)          /*!< Bit position for LCD_WF56_BPBLCD56. */
#define BM_LCD_WF56_BPBLCD56 (0x02U)       /*!< Bit mask for LCD_WF56_BPBLCD56. */
#define BS_LCD_WF56_BPBLCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPBLCD56. */

/*! @brief Read current value of the LCD_WF56_BPBLCD56 field. */
#define BR_LCD_WF56_BPBLCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPBLCD56, BS_LCD_WF56_BPBLCD56))

/*! @brief Format value for bitfield LCD_WF56_BPBLCD56. */
#define BF_LCD_WF56_BPBLCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPBLCD56) & BM_LCD_WF56_BPBLCD56)

/*! @brief Set the BPBLCD56 field to a new value. */
#define BW_LCD_WF56_BPBLCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPBLCD56), BP_LCD_WF56_BPBLCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPCLCD56[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF56_BPCLCD56 (2U)          /*!< Bit position for LCD_WF56_BPCLCD56. */
#define BM_LCD_WF56_BPCLCD56 (0x04U)       /*!< Bit mask for LCD_WF56_BPCLCD56. */
#define BS_LCD_WF56_BPCLCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPCLCD56. */

/*! @brief Read current value of the LCD_WF56_BPCLCD56 field. */
#define BR_LCD_WF56_BPCLCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPCLCD56, BS_LCD_WF56_BPCLCD56))

/*! @brief Format value for bitfield LCD_WF56_BPCLCD56. */
#define BF_LCD_WF56_BPCLCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPCLCD56) & BM_LCD_WF56_BPCLCD56)

/*! @brief Set the BPCLCD56 field to a new value. */
#define BW_LCD_WF56_BPCLCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPCLCD56), BP_LCD_WF56_BPCLCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPDLCD56[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF56_BPDLCD56 (3U)          /*!< Bit position for LCD_WF56_BPDLCD56. */
#define BM_LCD_WF56_BPDLCD56 (0x08U)       /*!< Bit mask for LCD_WF56_BPDLCD56. */
#define BS_LCD_WF56_BPDLCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPDLCD56. */

/*! @brief Read current value of the LCD_WF56_BPDLCD56 field. */
#define BR_LCD_WF56_BPDLCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPDLCD56, BS_LCD_WF56_BPDLCD56))

/*! @brief Format value for bitfield LCD_WF56_BPDLCD56. */
#define BF_LCD_WF56_BPDLCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPDLCD56) & BM_LCD_WF56_BPDLCD56)

/*! @brief Set the BPDLCD56 field to a new value. */
#define BW_LCD_WF56_BPDLCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPDLCD56), BP_LCD_WF56_BPDLCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPELCD56[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF56_BPELCD56 (4U)          /*!< Bit position for LCD_WF56_BPELCD56. */
#define BM_LCD_WF56_BPELCD56 (0x10U)       /*!< Bit mask for LCD_WF56_BPELCD56. */
#define BS_LCD_WF56_BPELCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPELCD56. */

/*! @brief Read current value of the LCD_WF56_BPELCD56 field. */
#define BR_LCD_WF56_BPELCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPELCD56, BS_LCD_WF56_BPELCD56))

/*! @brief Format value for bitfield LCD_WF56_BPELCD56. */
#define BF_LCD_WF56_BPELCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPELCD56) & BM_LCD_WF56_BPELCD56)

/*! @brief Set the BPELCD56 field to a new value. */
#define BW_LCD_WF56_BPELCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPELCD56), BP_LCD_WF56_BPELCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPFLCD56[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF56_BPFLCD56 (5U)          /*!< Bit position for LCD_WF56_BPFLCD56. */
#define BM_LCD_WF56_BPFLCD56 (0x20U)       /*!< Bit mask for LCD_WF56_BPFLCD56. */
#define BS_LCD_WF56_BPFLCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPFLCD56. */

