theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the LCD_WF56_BPFLCD56 field. */
#define BR_LCD_WF56_BPFLCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPFLCD56, BS_LCD_WF56_BPFLCD56))

/*! @brief Format value for bitfield LCD_WF56_BPFLCD56. */
#define BF_LCD_WF56_BPFLCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPFLCD56) & BM_LCD_WF56_BPFLCD56)

/*! @brief Set the BPFLCD56 field to a new value. */
#define BW_LCD_WF56_BPFLCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPFLCD56), BP_LCD_WF56_BPFLCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPGLCD56[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF56_BPGLCD56 (6U)          /*!< Bit position for LCD_WF56_BPGLCD56. */
#define BM_LCD_WF56_BPGLCD56 (0x40U)       /*!< Bit mask for LCD_WF56_BPGLCD56. */
#define BS_LCD_WF56_BPGLCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPGLCD56. */

/*! @brief Read current value of the LCD_WF56_BPGLCD56 field. */
#define BR_LCD_WF56_BPGLCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPGLCD56, BS_LCD_WF56_BPGLCD56))

/*! @brief Format value for bitfield LCD_WF56_BPGLCD56. */
#define BF_LCD_WF56_BPGLCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPGLCD56) & BM_LCD_WF56_BPGLCD56)

/*! @brief Set the BPGLCD56 field to a new value. */
#define BW_LCD_WF56_BPGLCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPGLCD56), BP_LCD_WF56_BPGLCD56, 1))
/*@}*/

/*!
 * @name Register LCD_WF56, field BPHLCD56[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF56_BPHLCD56 (7U)          /*!< Bit position for LCD_WF56_BPHLCD56. */
#define BM_LCD_WF56_BPHLCD56 (0x80U)       /*!< Bit mask for LCD_WF56_BPHLCD56. */
#define BS_LCD_WF56_BPHLCD56 (1U)          /*!< Bit field size in bits for LCD_WF56_BPHLCD56. */

/*! @brief Read current value of the LCD_WF56_BPHLCD56 field. */
#define BR_LCD_WF56_BPHLCD56(x) (BME_UBFX8(HW_LCD_WF56_ADDR(x), BP_LCD_WF56_BPHLCD56, BS_LCD_WF56_BPHLCD56))

/*! @brief Format value for bitfield LCD_WF56_BPHLCD56. */
#define BF_LCD_WF56_BPHLCD56(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF56_BPHLCD56) & BM_LCD_WF56_BPHLCD56)

/*! @brief Set the BPHLCD56 field to a new value. */
#define BW_LCD_WF56_BPHLCD56(x, v) (BME_BFI8(HW_LCD_WF56_ADDR(x), ((uint8_t)(v) << BP_LCD_WF56_BPHLCD56), BP_LCD_WF56_BPHLCD56, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF57 - LCD Waveform Register 57.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF57 - LCD Waveform Register 57. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf57
{
    uint8_t U;
    struct _hw_lcd_wf57_bitfields
    {
        uint8_t BPALCD57 : 1;          /*!< [0]  */
        uint8_t BPBLCD57 : 1;          /*!< [1]  */
        uint8_t BPCLCD57 : 1;          /*!< [2]  */
        uint8_t BPDLCD57 : 1;          /*!< [3]  */
        uint8_t BPELCD57 : 1;          /*!< [4]  */
        uint8_t BPFLCD57 : 1;          /*!< [5]  */
        uint8_t BPGLCD57 : 1;          /*!< [6]  */
        uint8_t BPHLCD57 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf57_t;

/*!
 * @name Constants and macros for entire LCD_WF57 register
 */
/*@{*/
#define HW_LCD_WF57_ADDR(x)      ((uint32_t)(x) + 0x59U)

#define HW_LCD_WF57(x)           (*(__IO hw_lcd_wf57_t *) HW_LCD_WF57_ADDR(x))
#define HW_LCD_WF57_RD(x)        (HW_LCD_WF57(x).U)
#define HW_LCD_WF57_WR(x, v)     (HW_LCD_WF57(x).U = (v))
#define HW_LCD_WF57_SET(x, v)    (BME_OR8(HW_LCD_WF57_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF57_CLR(x, v)    (BME_AND8(HW_LCD_WF57_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF57_TOG(x, v)    (BME_XOR8(HW_LCD_WF57_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF57 bitfields
 */

/*!
 * @name Register LCD_WF57, field BPALCD57[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF57_BPALCD57 (0U)          /*!< Bit position for LCD_WF57_BPALCD57. */
#define BM_LCD_WF57_BPALCD57 (0x01U)       /*!< Bit mask for LCD_WF57_BPALCD57. */
#define BS_LCD_WF57_BPALCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPALCD57. */

/*! @brief Read current value of the LCD_WF57_BPALCD57 field. */
#define BR_LCD_WF57_BPALCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPALCD57, BS_LCD_WF57_BPALCD57))

/*! @brief Format value for bitfield LCD_WF57_BPALCD57. */
#define BF_LCD_WF57_BPALCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPALCD57) & BM_LCD_WF57_BPALCD57)

/*! @brief Set the BPALCD57 field to a new value. */
#define BW_LCD_WF57_BPALCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPALCD57), BP_LCD_WF57_BPALCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPBLCD57[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF57_BPBLCD57 (1U)          /*!< Bit position for LCD_WF57_BPBLCD57. */
#define BM_LCD_WF57_BPBLCD57 (0x02U)       /*!< Bit mask for LCD_WF57_BPBLCD57. */
#define BS_LCD_WF57_BPBLCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPBLCD57. */

/*! @brief Read current value of the LCD_WF57_BPBLCD57 field. */
#define BR_LCD_WF57_BPBLCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPBLCD57, BS_LCD_WF57_BPBLCD57))

/*! @brief Format value for bitfield LCD_WF57_BPBLCD57. */
#define BF_LCD_WF57_BPBLCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPBLCD57) & BM_LCD_WF57_BPBLCD57)

/*! @brief Set the BPBLCD57 field to a new value. */
#define BW_LCD_WF57_BPBLCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPBLCD57), BP_LCD_WF57_BPBLCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPCLCD57[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF57_BPCLCD57 (2U)          /*!< Bit position for LCD_WF57_BPCLCD57. */
#define BM_LCD_WF57_BPCLCD57 (0x04U)       /*!< Bit mask for LCD_WF57_BPCLCD57. */
#define BS_LCD_WF57_BPCLCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPCLCD57. */

