theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield SPI_C1_SPIE. */
#define BF_SPI_C1_SPIE(v)    ((uint8_t)((uint8_t)(v) << BP_SPI_C1_SPIE) & BM_SPI_C1_SPIE)

/*! @brief Set the SPIE field to a new value. */
#define BW_SPI_C1_SPIE(x, v) (BME_BFI8(HW_SPI_C1_ADDR(x), ((uint8_t)(v) << BP_SPI_C1_SPIE), BP_SPI_C1_SPIE, 1))
/*@}*/

/*******************************************************************************
 * HW_SPI_ML - SPI Match Register low
 ******************************************************************************/

/*!
 * @brief HW_SPI_ML - SPI Match Register low (RW)
 *
 * Reset value: 0x00U
 *
 * This register, together with the MH register, contains the hardware compare
 * value. When the value received in the SPI receive data buffer equals this
 * hardware compare value, the SPI Match Flag in the S register (S[SPMF]) sets. In
 * 8-bit mode, only the ML register is available. Reads of the MH register return
 * all zeros. Writes to the MH register are ignored. In 16-bit mode, reading either
 * byte (the MH or ML register) latches the contents of both bytes into a buffer
 * where they remain latched until the other byte is read. Writing to either
 * byte (the MH or ML register) latches the value into a buffer. When both bytes
 * have been written, they are transferred as a coherent value into the SPI match
 * registers.
 */
typedef union _hw_spi_ml
{
    uint8_t U;
    struct _hw_spi_ml_bitfields
    {
        uint8_t Bits : 8;              /*!< [7:0] Hardware compare value (low byte) */
    } B;
} hw_spi_ml_t;

/*!
 * @name Constants and macros for entire SPI_ML register
 */
/*@{*/
#define HW_SPI_ML_ADDR(x)        ((uint32_t)(x) + 0x4U)

#define HW_SPI_ML(x)             (*(__IO hw_spi_ml_t *) HW_SPI_ML_ADDR(x))
#define HW_SPI_ML_RD(x)          (HW_SPI_ML(x).U)
#define HW_SPI_ML_WR(x, v)       (HW_SPI_ML(x).U = (v))
#define HW_SPI_ML_SET(x, v)      (BME_OR8(HW_SPI_ML_ADDR(x), (uint8_t)(v)))
#define HW_SPI_ML_CLR(x, v)      (BME_AND8(HW_SPI_ML_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_ML_TOG(x, v)      (BME_XOR8(HW_SPI_ML_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_ML bitfields
 */

/*!
 * @name Register SPI_ML, field Bits[7:0] (RW)
 */
/*@{*/
#define BP_SPI_ML_Bits       (0U)          /*!< Bit position for SPI_ML_Bits. */
#define BM_SPI_ML_Bits       (0xFFU)       /*!< Bit mask for SPI_ML_Bits. */
#define BS_SPI_ML_Bits       (8U)          /*!< Bit field size in bits for SPI_ML_Bits. */

/*! @brief Read current value of the SPI_ML_Bits field. */
#define BR_SPI_ML_Bits(x)    (HW_SPI_ML(x).U)

/*! @brief Format value for bitfield SPI_ML_Bits. */
#define BF_SPI_ML_Bits(v)    ((uint8_t)((uint8_t)(v) << BP_SPI_ML_Bits) & BM_SPI_ML_Bits)

/*! @brief Set the Bits field to a new value. */
#define BW_SPI_ML_Bits(x, v) (HW_SPI_ML_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_SPI_MH - SPI match register high
 ******************************************************************************/

/*!
 * @brief HW_SPI_MH - SPI match register high (RW)
 *
 * Reset value: 0x00U
 *
 * Refer to the description of the ML register.
 */
typedef union _hw_spi_mh
{
    uint8_t U;
    struct _hw_spi_mh_bitfields
    {
        uint8_t Bits : 8;              /*!< [7:0] Hardware compare value (high byte) */
    } B;
} hw_spi_mh_t;

/*!
 * @name Constants and macros for entire SPI_MH register
 */
/*@{*/
#define HW_SPI_MH_ADDR(x)        ((uint32_t)(x) + 0x5U)

#define HW_SPI_MH(x)             (*(__IO hw_spi_mh_t *) HW_SPI_MH_ADDR(x))
#define HW_SPI_MH_RD(x)          (HW_SPI_MH(x).U)
#define HW_SPI_MH_WR(x, v)       (HW_SPI_MH(x).U = (v))
#define HW_SPI_MH_SET(x, v)      (BME_OR8(HW_SPI_MH_ADDR(x), (uint8_t)(v)))
#define HW_SPI_MH_CLR(x, v)      (BME_AND8(HW_SPI_MH_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_MH_TOG(x, v)      (BME_XOR8(HW_SPI_MH_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_MH bitfields
 */

/*!
 * @name Register SPI_MH, field Bits[7:0] (RW)
 */
/*@{*/
#define BP_SPI_MH_Bits       (0U)          /*!< Bit position for SPI_MH_Bits. */
#define BM_SPI_MH_Bits       (0xFFU)       /*!< Bit mask for SPI_MH_Bits. */
#define BS_SPI_MH_Bits       (8U)          /*!< Bit field size in bits for SPI_MH_Bits. */

/*! @brief Read current value of the SPI_MH_Bits field. */
#define BR_SPI_MH_Bits(x)    (HW_SPI_MH(x).U)

/*! @brief Format value for bitfield SPI_MH_Bits. */
#define BF_SPI_MH_Bits(v)    ((uint8_t)((uint8_t)(v) << BP_SPI_MH_Bits) & BM_SPI_MH_Bits)

/*! @brief Set the Bits field to a new value. */
#define BW_SPI_MH_Bits(x, v) (HW_SPI_MH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_SPI_DL - SPI Data Register low
 ******************************************************************************/

/*!
 * @brief HW_SPI_DL - SPI Data Register low (RW)
 *
 * Reset value: 0x00U
 *
 * This register, together with the DH register, is both the input and output
 * register for SPI data. A write to the registers writes to the transmit data
 * buffer, allowing data to be queued and transmitted. When the SPI is configured as
 * a master, data queued in the transmit data buffer is transmitted immediately
 * after the previous transmission has completed. The SPTEF bit in the S register
 * indicates when the transmit data buffer is ready to accept new data. When the
 * transmit DMA request is disabled (TXDMAE is 0): The S register must be read
 * when S[SPTEF] is set before writing to the SPI data registers; otherwise, the
 * write is ignored. When the transmit DMA request is enabled (TXDMAE is 1) when
 * S[SPTEF] is set, the SPI data registers can be written automatically by DMA
 * without reading the S register first. Data may be read from the SPI data registers
 * any time after S[SPRF] is set and before another transfer is finished.
 * Failure to read the data out of the receive data buffer before a new transfer ends
 * causes a receive overrun condition, and the data from the new transfer is lost.
 * The new data is lost because the receive buffer still held the previous
 * character and was not ready to accept the new data. There is no indication for a
 * receive overrun condition, so the application system designer must ensure that
 * previous data has been read from the receive buffer before a new transfer is
 * initiated. In 8-bit mode, only the DL register is available. Reads of the DH
 * register return all zeros. Writes to the DH register are ignored. In 16-bit mode,
 * reading either byte (the DH or DL register) latches the contents of both
 * bytes into a buffer where they remain latched until the other byte is read.
 * Writing to either byte (the DH or DL register) latches the value into a buffer. When
 * both bytes have been written, they are transferred as a coherent 16-bit value
 * into the transmit data buffer.
 */
typedef union _hw_spi_dl
{
    uint8_t U;
    struct _hw_spi_dl_bitfields
    {
        uint8_t Bits : 8;              /*!< [7:0] Data (low byte) */
    } B;
} hw_spi_dl_t;

/*!
 * @name Constants and macros for entire SPI_DL register
 */
/*@{*/
#define HW_SPI_DL_ADDR(x)        ((uint32_t)(x) + 0x6U)

