theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the TSI_GENCS_TSIEN field. */
#define BR_TSI_GENCS_TSIEN(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIEN, BS_TSI_GENCS_TSIEN))

/*! @brief Format value for bitfield TSI_GENCS_TSIEN. */
#define BF_TSI_GENCS_TSIEN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_TSIEN) & BM_TSI_GENCS_TSIEN)

/*! @brief Set the TSIEN field to a new value. */
#define BW_TSI_GENCS_TSIEN(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_TSIEN), BP_TSI_GENCS_TSIEN, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field NSCN[12:8] (RW)
 *
 * These bits indicate the scan number for each electrode. The scan number is
 * equal to NSCN + 1, which allows the scan time ranges from 1 to 32. By default,
 * NSCN is configured as 0, which asserts the TSI scans once on the selected
 * eletrode channel.
 *
 * Values:
 * - 00000 - Once per electrode
 * - 00001 - Twice per electrode
 * - 00010 - 3 times per electrode
 * - 00011 - 4 times per electrode
 * - 00100 - 5 times per electrode
 * - 00101 - 6 times per electrode
 * - 00110 - 7 times per electrode
 * - 00111 - 8 times per electrode
 * - 01000 - 9 times per electrode
 * - 01001 - 10 times per electrode
 * - 01010 - 11 times per electrode
 * - 01011 - 12 times per electrode
 * - 01100 - 13 times per electrode
 * - 01101 - 14 times per electrode
 * - 01110 - 15 times per electrode
 * - 01111 - 16 times per electrode
 * - 10000 - 17 times per electrode
 * - 10001 - 18 times per electrode
 * - 10010 - 19 times per electrode
 * - 10011 - 20 times per electrode
 * - 10100 - 21 times per electrode
 * - 10101 - 22 times per electrode
 * - 10110 - 23 times per electrode
 * - 10111 - 24 times per electrode
 * - 11000 - 25 times per electrode
 * - 11001 - 26 times per electrode
 * - 11010 - 27 times per electrode
 * - 11011 - 28 times per electrode
 * - 11100 - 29 times per electrode
 * - 11101 - 30 times per electrode
 * - 11110 - 31 times per electrode
 * - 11111 - 32 times per electrode
 */
/*@{*/
#define BP_TSI_GENCS_NSCN    (8U)          /*!< Bit position for TSI_GENCS_NSCN. */
#define BM_TSI_GENCS_NSCN    (0x00001F00U) /*!< Bit mask for TSI_GENCS_NSCN. */
#define BS_TSI_GENCS_NSCN    (5U)          /*!< Bit field size in bits for TSI_GENCS_NSCN. */

/*! @brief Read current value of the TSI_GENCS_NSCN field. */
#define BR_TSI_GENCS_NSCN(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_NSCN, BS_TSI_GENCS_NSCN))

/*! @brief Format value for bitfield TSI_GENCS_NSCN. */
#define BF_TSI_GENCS_NSCN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_NSCN) & BM_TSI_GENCS_NSCN)

/*! @brief Set the NSCN field to a new value. */
#define BW_TSI_GENCS_NSCN(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_NSCN), BP_TSI_GENCS_NSCN, 5))
/*@}*/

/*!
 * @name Register TSI_GENCS, field PS[15:13] (RW)
 *
 * These bits indicate the prescaler of the output of electrode oscillator.
 *
 * Values:
 * - 000 - Electrode Oscillator Frequency divided by 1
 * - 001 - Electrode Oscillator Frequency divided by 2
 * - 010 - Electrode Oscillator Frequency divided by 4
 * - 011 - Electrode Oscillator Frequency divided by 8
 * - 100 - Electrode Oscillator Frequency divided by 16
 * - 101 - Electrode Oscillator Frequency divided by 32
 * - 110 - Electrode Oscillator Frequency divided by 64
 * - 111 - Electrode Oscillator Frequency divided by 128
 */
/*@{*/
#define BP_TSI_GENCS_PS      (13U)         /*!< Bit position for TSI_GENCS_PS. */
#define BM_TSI_GENCS_PS      (0x0000E000U) /*!< Bit mask for TSI_GENCS_PS. */
#define BS_TSI_GENCS_PS      (3U)          /*!< Bit field size in bits for TSI_GENCS_PS. */

/*! @brief Read current value of the TSI_GENCS_PS field. */
#define BR_TSI_GENCS_PS(x)   (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_PS, BS_TSI_GENCS_PS))

/*! @brief Format value for bitfield TSI_GENCS_PS. */
#define BF_TSI_GENCS_PS(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_PS) & BM_TSI_GENCS_PS)

/*! @brief Set the PS field to a new value. */
#define BW_TSI_GENCS_PS(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_PS), BP_TSI_GENCS_PS, 3))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EXTCHRG[18:16] (RW)
 *
 * These bits indicate the electrode oscillator charge and discharge current
 * value.
 *
 * Values:
 * - 000 - 500 nA.
 * - 001 - 1 uA.
 * - 010 - 2 uA.
 * - 011 - 4 uA.
 * - 100 - 8 uA.
 * - 101 - 16 uA.
 * - 110 - 32 uA.
 * - 111 - 64 uA.
 */
/*@{*/
#define BP_TSI_GENCS_EXTCHRG (16U)         /*!< Bit position for TSI_GENCS_EXTCHRG. */
#define BM_TSI_GENCS_EXTCHRG (0x00070000U) /*!< Bit mask for TSI_GENCS_EXTCHRG. */
#define BS_TSI_GENCS_EXTCHRG (3U)          /*!< Bit field size in bits for TSI_GENCS_EXTCHRG. */

/*! @brief Read current value of the TSI_GENCS_EXTCHRG field. */
#define BR_TSI_GENCS_EXTCHRG(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EXTCHRG, BS_TSI_GENCS_EXTCHRG))

/*! @brief Format value for bitfield TSI_GENCS_EXTCHRG. */
#define BF_TSI_GENCS_EXTCHRG(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_EXTCHRG) & BM_TSI_GENCS_EXTCHRG)

/*! @brief Set the EXTCHRG field to a new value. */
#define BW_TSI_GENCS_EXTCHRG(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_EXTCHRG), BP_TSI_GENCS_EXTCHRG, 3))
/*@}*/

/*!
 * @name Register TSI_GENCS, field DVOLT[20:19] (RW)
 *
 * These bits indicate the oscillator's voltage rails as below.
 *
 * Values:
 * - 00 - DV = 1.03 V; VP = 1.33 V; Vm = 0.30 V.
 * - 01 - DV = 0.73 V; VP = 1.18 V; Vm = 0.45 V.
 * - 10 - DV = 0.43 V; VP = 1.03 V; Vm = 0.60 V.
 * - 11 - DV = 0.29 V; VP = 0.95 V; Vm = 0.67 V.
 */
/*@{*/
#define BP_TSI_GENCS_DVOLT   (19U)         /*!< Bit position for TSI_GENCS_DVOLT. */
#define BM_TSI_GENCS_DVOLT   (0x00180000U) /*!< Bit mask for TSI_GENCS_DVOLT. */
#define BS_TSI_GENCS_DVOLT   (2U)          /*!< Bit field size in bits for TSI_GENCS_DVOLT. */

/*! @brief Read current value of the TSI_GENCS_DVOLT field. */
#define BR_TSI_GENCS_DVOLT(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_DVOLT, BS_TSI_GENCS_DVOLT))

