theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield TSI_GENCS_DVOLT. */
#define BF_TSI_GENCS_DVOLT(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_DVOLT) & BM_TSI_GENCS_DVOLT)

/*! @brief Set the DVOLT field to a new value. */
#define BW_TSI_GENCS_DVOLT(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_DVOLT), BP_TSI_GENCS_DVOLT, 2))
/*@}*/

/*!
 * @name Register TSI_GENCS, field REFCHRG[23:21] (RW)
 *
 * These bits indicate the reference oscillator charge and discharge current
 * value.
 *
 * Values:
 * - 000 - 500 nA.
 * - 001 - 1 uA.
 * - 010 - 2 uA.
 * - 011 - 4 uA.
 * - 100 - 8 uA.
 * - 101 - 16 uA.
 * - 110 - 32 uA.
 * - 111 - 64 uA.
 */
/*@{*/
#define BP_TSI_GENCS_REFCHRG (21U)         /*!< Bit position for TSI_GENCS_REFCHRG. */
#define BM_TSI_GENCS_REFCHRG (0x00E00000U) /*!< Bit mask for TSI_GENCS_REFCHRG. */
#define BS_TSI_GENCS_REFCHRG (3U)          /*!< Bit field size in bits for TSI_GENCS_REFCHRG. */

/*! @brief Read current value of the TSI_GENCS_REFCHRG field. */
#define BR_TSI_GENCS_REFCHRG(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_REFCHRG, BS_TSI_GENCS_REFCHRG))

/*! @brief Format value for bitfield TSI_GENCS_REFCHRG. */
#define BF_TSI_GENCS_REFCHRG(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_REFCHRG) & BM_TSI_GENCS_REFCHRG)

/*! @brief Set the REFCHRG field to a new value. */
#define BW_TSI_GENCS_REFCHRG(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_REFCHRG), BP_TSI_GENCS_REFCHRG, 3))
/*@}*/

/*!
 * @name Register TSI_GENCS, field MODE[27:24] (RW)
 *
 * Set up TSI analog modes, especially, setting MODE[3:2] to not 2'b00 will
 * configure TSI to noise detection modes. MODE[1:0] take no effect on TSI operation
 * mode and should always write to 2'b00 for setting up. When reading this field
 * will return the analog status. Refer to chapter "Noise detection mode" for
 * details.
 *
 * Values:
 * - 0000 - Set TSI in capacitive sensing(non-noise detection) mode.
 * - 0100 - Set TSI analog to work in single threshold noise detection mode and
 *     the frequency limitation circuit is disabled.
 * - 1000 - Set TSI analog to work in single threshold noise detection mode and
 *     the frequency limitation circuit is enabled to work in higher frequencies
 *     operations.
 * - 1100 - Set TSI analog to work in automatic noise detection mode.
 */
/*@{*/
#define BP_TSI_GENCS_MODE    (24U)         /*!< Bit position for TSI_GENCS_MODE. */
#define BM_TSI_GENCS_MODE    (0x0F000000U) /*!< Bit mask for TSI_GENCS_MODE. */
#define BS_TSI_GENCS_MODE    (4U)          /*!< Bit field size in bits for TSI_GENCS_MODE. */

/*! @brief Read current value of the TSI_GENCS_MODE field. */
#define BR_TSI_GENCS_MODE(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_MODE, BS_TSI_GENCS_MODE))

/*! @brief Format value for bitfield TSI_GENCS_MODE. */
#define BF_TSI_GENCS_MODE(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_MODE) & BM_TSI_GENCS_MODE)

/*! @brief Set the MODE field to a new value. */
#define BW_TSI_GENCS_MODE(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_MODE), BP_TSI_GENCS_MODE, 4))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ESOR[28] (RW)
 *
 * This bit is used to select out-of-range or end-of-scan event to generate an
 * interrupt.
 *
 * Values:
 * - 0 - Out-of-range interrupt is allowed.
 * - 1 - End-of-scan interrupt is allowed.
 */
/*@{*/
#define BP_TSI_GENCS_ESOR    (28U)         /*!< Bit position for TSI_GENCS_ESOR. */
#define BM_TSI_GENCS_ESOR    (0x10000000U) /*!< Bit mask for TSI_GENCS_ESOR. */
#define BS_TSI_GENCS_ESOR    (1U)          /*!< Bit field size in bits for TSI_GENCS_ESOR. */

/*! @brief Read current value of the TSI_GENCS_ESOR field. */
#define BR_TSI_GENCS_ESOR(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_ESOR, BS_TSI_GENCS_ESOR))

/*! @brief Format value for bitfield TSI_GENCS_ESOR. */
#define BF_TSI_GENCS_ESOR(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_ESOR) & BM_TSI_GENCS_ESOR)

/*! @brief Set the ESOR field to a new value. */
#define BW_TSI_GENCS_ESOR(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_ESOR), BP_TSI_GENCS_ESOR, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OUTRGF[31] (W1C)
 *
 * This flag is set if the result register of the enabled electrode is out of
 * the range defined by the TSI_THRESHOLD register. This flag is set only when TSI
 * is configured in non-noise detection mode. It can be read once the CPU wakes.
 * Write "1" , when this flag is set, to clear it.
 */
/*@{*/
#define BP_TSI_GENCS_OUTRGF  (31U)         /*!< Bit position for TSI_GENCS_OUTRGF. */
#define BM_TSI_GENCS_OUTRGF  (0x80000000U) /*!< Bit mask for TSI_GENCS_OUTRGF. */
#define BS_TSI_GENCS_OUTRGF  (1U)          /*!< Bit field size in bits for TSI_GENCS_OUTRGF. */

/*! @brief Read current value of the TSI_GENCS_OUTRGF field. */
#define BR_TSI_GENCS_OUTRGF(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_OUTRGF, BS_TSI_GENCS_OUTRGF))

/*! @brief Format value for bitfield TSI_GENCS_OUTRGF. */
#define BF_TSI_GENCS_OUTRGF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_OUTRGF) & BM_TSI_GENCS_OUTRGF)

/*! @brief Set the OUTRGF field to a new value. */
#define BW_TSI_GENCS_OUTRGF(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_OUTRGF), BP_TSI_GENCS_OUTRGF, 1))
/*@}*/

/*******************************************************************************
 * HW_TSI_DATA - TSI DATA Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_DATA - TSI DATA Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_data
{
    uint32_t U;
    struct _hw_tsi_data_bitfields
    {
        uint32_t TSICNT : 16;          /*!< [15:0] TSI Conversion Counter Value */
        uint32_t RESERVED0 : 6;        /*!< [21:16]  */
        uint32_t SWTS : 1;             /*!< [22] Software Trigger Start */
        uint32_t DMAEN : 1;            /*!< [23] DMA Transfer Enabled */
        uint32_t RESERVED1 : 4;        /*!< [27:24]  */
        uint32_t TSICH : 4;            /*!< [31:28] TSICH */
    } B;
} hw_tsi_data_t;

/*!
 * @name Constants and macros for entire TSI_DATA register
 */
/*@{*/
#define HW_TSI_DATA_ADDR(x)      ((uint32_t)(x) + 0x4U)

#define HW_TSI_DATA(x)           (*(__IO hw_tsi_data_t *) HW_TSI_DATA_ADDR(x))
#define HW_TSI_DATA_RD(x)        (HW_TSI_DATA(x).U)
#define HW_TSI_DATA_WR(x, v)     (HW_TSI_DATA(x).U = (v))
#define HW_TSI_DATA_SET(x, v)    (BME_OR32(HW_TSI_DATA_ADDR(x), (uint32_t)(v)))
#define HW_TSI_DATA_CLR(x, v)    (BME_AND32(HW_TSI_DATA_ADDR(x), (uint32_t)(~(v))))
#define HW_TSI_DATA_TOG(x, v)    (BME_XOR32(HW_TSI_DATA_ADDR(x), (uint32_t)(v)))
/*@}*/

