theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*
 * Constants & macros for individual TSI_DATA bitfields
 */

/*!
 * @name Register TSI_DATA, field TSICNT[15:0] (RO)
 *
 * These read-only bits record the accumulated scan counter value ticked by the
 * reference oscillator.
 */
/*@{*/
#define BP_TSI_DATA_TSICNT   (0U)          /*!< Bit position for TSI_DATA_TSICNT. */
#define BM_TSI_DATA_TSICNT   (0x0000FFFFU) /*!< Bit mask for TSI_DATA_TSICNT. */
#define BS_TSI_DATA_TSICNT   (16U)         /*!< Bit field size in bits for TSI_DATA_TSICNT. */

/*! @brief Read current value of the TSI_DATA_TSICNT field. */
#define BR_TSI_DATA_TSICNT(x) (BME_UBFX32(HW_TSI_DATA_ADDR(x), BP_TSI_DATA_TSICNT, BS_TSI_DATA_TSICNT))
/*@}*/

/*!
 * @name Register TSI_DATA, field SWTS[22] (WORZ)
 *
 * This write-only bit is a software start trigger. When STM bit is clear, write
 * "1" to this bit will start a scan. The electrode channel to be scanned is
 * determinated by TSI_DATA[TSICH] bits.
 *
 * Values:
 * - 0 - No effect.
 * - 1 - Start a scan to determine which channel is specified by TSI_DATA[TSICH].
 */
/*@{*/
#define BP_TSI_DATA_SWTS     (22U)         /*!< Bit position for TSI_DATA_SWTS. */
#define BM_TSI_DATA_SWTS     (0x00400000U) /*!< Bit mask for TSI_DATA_SWTS. */
#define BS_TSI_DATA_SWTS     (1U)          /*!< Bit field size in bits for TSI_DATA_SWTS. */

/*! @brief Format value for bitfield TSI_DATA_SWTS. */
#define BF_TSI_DATA_SWTS(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_DATA_SWTS) & BM_TSI_DATA_SWTS)

/*! @brief Set the SWTS field to a new value. */
#define BW_TSI_DATA_SWTS(x, v) (BME_BFI32(HW_TSI_DATA_ADDR(x), ((uint32_t)(v) << BP_TSI_DATA_SWTS), BP_TSI_DATA_SWTS, 1))
/*@}*/

/*!
 * @name Register TSI_DATA, field DMAEN[23] (RW)
 *
 * This bit is used together with the TSI interrupt enable bits(TSIIE, ESOR) to
 * generate a DMA transfer request instead of an interrupt.
 *
 * Values:
 * - 0 - Interrupt is selected when the interrupt enable bit is set and the
 *     corresponding TSI events assert.
 * - 1 - DMA transfer request is selected when the interrupt enable bit is set
 *     and the corresponding TSI events assert.
 */
/*@{*/
#define BP_TSI_DATA_DMAEN    (23U)         /*!< Bit position for TSI_DATA_DMAEN. */
#define BM_TSI_DATA_DMAEN    (0x00800000U) /*!< Bit mask for TSI_DATA_DMAEN. */
#define BS_TSI_DATA_DMAEN    (1U)          /*!< Bit field size in bits for TSI_DATA_DMAEN. */

/*! @brief Read current value of the TSI_DATA_DMAEN field. */
#define BR_TSI_DATA_DMAEN(x) (BME_UBFX32(HW_TSI_DATA_ADDR(x), BP_TSI_DATA_DMAEN, BS_TSI_DATA_DMAEN))

/*! @brief Format value for bitfield TSI_DATA_DMAEN. */
#define BF_TSI_DATA_DMAEN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_DATA_DMAEN) & BM_TSI_DATA_DMAEN)

/*! @brief Set the DMAEN field to a new value. */
#define BW_TSI_DATA_DMAEN(x, v) (BME_BFI32(HW_TSI_DATA_ADDR(x), ((uint32_t)(v) << BP_TSI_DATA_DMAEN), BP_TSI_DATA_DMAEN, 1))
/*@}*/

/*!
 * @name Register TSI_DATA, field TSICH[31:28] (RW)
 *
 * These bits specify current channel to be measured. In hardware trigger mode
 * (TSI_GENCS[STM] = 1), the scan will not start until the hardware trigger
 * occurs. In software trigger mode (TSI_GENCS[STM] = 0), the scan starts immediately
 * when TSI_DATA[SWTS] bit is written by 1.
 *
 * Values:
 * - 0000 - Channel 0.
 * - 0001 - Channel 1.
 * - 0010 - Channel 2.
 * - 0011 - Channel 3.
 * - 0100 - Channel 4.
 * - 0101 - Channel 5.
 * - 0110 - Channel 6.
 * - 0111 - Channel 7.
 * - 1000 - Channel 8.
 * - 1001 - Channel 9.
 * - 1010 - Channel 10.
 * - 1011 - Channel 11.
 * - 1100 - Channel 12.
 * - 1101 - Channel 13.
 * - 1110 - Channel 14.
 * - 1111 - Channel 15.
 */
/*@{*/
#define BP_TSI_DATA_TSICH    (28U)         /*!< Bit position for TSI_DATA_TSICH. */
#define BM_TSI_DATA_TSICH    (0xF0000000U) /*!< Bit mask for TSI_DATA_TSICH. */
#define BS_TSI_DATA_TSICH    (4U)          /*!< Bit field size in bits for TSI_DATA_TSICH. */

/*! @brief Read current value of the TSI_DATA_TSICH field. */
#define BR_TSI_DATA_TSICH(x) (BME_UBFX32(HW_TSI_DATA_ADDR(x), BP_TSI_DATA_TSICH, BS_TSI_DATA_TSICH))

/*! @brief Format value for bitfield TSI_DATA_TSICH. */
#define BF_TSI_DATA_TSICH(v) ((uint32_t)((uint32_t)(v) << BP_TSI_DATA_TSICH) & BM_TSI_DATA_TSICH)

/*! @brief Set the TSICH field to a new value. */
#define BW_TSI_DATA_TSICH(x, v) (BME_BFI32(HW_TSI_DATA_ADDR(x), ((uint32_t)(v) << BP_TSI_DATA_TSICH), BP_TSI_DATA_TSICH, 4))
/*@}*/

/*******************************************************************************
 * HW_TSI_TSHD - TSI Threshold Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_TSHD - TSI Threshold Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_tshd
{
    uint32_t U;
    struct _hw_tsi_tshd_bitfields
    {
        uint32_t THRESL : 16;          /*!< [15:0] TSI Wakeup Channel Low-threshold */
        uint32_t THRESH : 16;          /*!< [31:16] TSI Wakeup Channel High-threshold
                                        * */
    } B;
} hw_tsi_tshd_t;

/*!
 * @name Constants and macros for entire TSI_TSHD register
 */
/*@{*/
#define HW_TSI_TSHD_ADDR(x)      ((uint32_t)(x) + 0x8U)

#define HW_TSI_TSHD(x)           (*(__IO hw_tsi_tshd_t *) HW_TSI_TSHD_ADDR(x))
#define HW_TSI_TSHD_RD(x)        (HW_TSI_TSHD(x).U)
#define HW_TSI_TSHD_WR(x, v)     (HW_TSI_TSHD(x).U = (v))
#define HW_TSI_TSHD_SET(x, v)    (BME_OR32(HW_TSI_TSHD_ADDR(x), (uint32_t)(v)))
#define HW_TSI_TSHD_CLR(x, v)    (BME_AND32(HW_TSI_TSHD_ADDR(x), (uint32_t)(~(v))))
#define HW_TSI_TSHD_TOG(x, v)    (BME_XOR32(HW_TSI_TSHD_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual TSI_TSHD bitfields
 */

/*!
 * @name Register TSI_TSHD, field THRESL[15:0] (RW)
 *
 * This half-word specifies the low threshold of the wakeup channel.
 */
/*@{*/
#define BP_TSI_TSHD_THRESL   (0U)          /*!< Bit position for TSI_TSHD_THRESL. */
#define BM_TSI_TSHD_THRESL   (0x0000FFFFU) /*!< Bit mask for TSI_TSHD_THRESL. */
#define BS_TSI_TSHD_THRESL   (16U)         /*!< Bit field size in bits for TSI_TSHD_THRESL. */

/*! @brief Read current value of the TSI_TSHD_THRESL field. */
#define BR_TSI_TSHD_THRESL(x) (BME_UBFX32(HW_TSI_TSHD_ADDR(x), BP_TSI_TSHD_THRESL, BS_TSI_TSHD_THRESL))

/*! @brief Format value for bitfield TSI_TSHD_THRESL. */
#define BF_TSI_TSHD_THRESL(v) ((uint32_t)((uint32_t)(v) << BP_TSI_TSHD_THRESL) & BM_TSI_TSHD_THRESL)

/*! @brief Set the THRESL field to a new value. */
#define BW_TSI_TSHD_THRESL(x, v) (BME_BFI32(HW_TSI_TSHD_ADDR(x), ((uint32_t)(v) << BP_TSI_TSHD_THRESL), BP_TSI_TSHD_THRESL, 16))
/*@}*/

/*!
 * @name Register TSI_TSHD, field THRESH[31:16] (RW)
 *
 * This half-word specifies the high threshold of the wakeup channel.
 */
/*@{*/
#define BP_TSI_TSHD_THRESH   (16U)         /*!< Bit position for TSI_TSHD_THRESH. */
#define BM_TSI_TSHD_THRESH   (0xFFFF0000U) /*!< Bit mask for TSI_TSHD_THRESH. */
#define BS_TSI_TSHD_THRESH   (16U)         /*!< Bit field size in bits for TSI_TSHD_THRESH. */

/*! @brief Read current value of the TSI_TSHD_THRESH field. */
#define BR_TSI_TSHD_THRESH(x) (BME_UBFX32(HW_TSI_TSHD_ADDR(x), BP_TSI_TSHD_THRESH, BS_TSI_TSHD_THRESH))

/*! @brief Format value for bitfield TSI_TSHD_THRESH. */
#define BF_TSI_TSHD_THRESH(v) ((uint32_t)((uint32_t)(v) << BP_TSI_TSHD_THRESH) & BM_TSI_TSHD_THRESH)

/*! @brief Set the THRESH field to a new value. */
#define BW_TSI_TSHD_THRESH(x, v) (BME_BFI32(HW_TSI_TSHD_ADDR(x), ((uint32_t)(v) << BP_TSI_TSHD_THRESH), BP_TSI_TSHD_THRESH, 16))
/*@}*/

