theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*******************************************************************************
 * hw_uart_t - module struct
 ******************************************************************************/
/*!
 * @brief All UART module registers.
 */
#pragma pack(1)
typedef struct _hw_uart
{
    __IO hw_uart_bdh_t BDH;                /*!< [0x0] UART Baud Rate Register: High */
    __IO hw_uart_bdl_t BDL;                /*!< [0x1] UART Baud Rate Register: Low */
    __IO hw_uart_c1_t C1;                  /*!< [0x2] UART Control Register 1 */
    __IO hw_uart_c2_t C2;                  /*!< [0x3] UART Control Register 2 */
    __I hw_uart_s1_t S1;                   /*!< [0x4] UART Status Register 1 */
    __IO hw_uart_s2_t S2;                  /*!< [0x5] UART Status Register 2 */
    __IO hw_uart_c3_t C3;                  /*!< [0x6] UART Control Register 3 */
    __IO hw_uart_d_t D;                    /*!< [0x7] UART Data Register */
    __IO hw_uart_c4_t C4;                  /*!< [0x8] UART Control Register 4 */
} hw_uart_t;
#pragma pack()

/*! @brief Macro to access all UART registers. */
/*! @param x UART module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_UART_REGS(UART1_BASE)</code>. */
#define HW_UART_REGS(x) (*(hw_uart_t *)(x))

/*
 * MKL46Z4 UART0
 *
 * Universal Asynchronous Receiver/Transmitter
 *
 * Registers defined in this header file:
 * - HW_UART0_BDH - UART Baud Rate Register High
 * - HW_UART0_BDL - UART Baud Rate Register Low
 * - HW_UART0_C1 - UART Control Register 1
 * - HW_UART0_C2 - UART Control Register 2
 * - HW_UART0_S1 - UART Status Register 1
 * - HW_UART0_S2 - UART Status Register 2
 * - HW_UART0_C3 - UART Control Register 3
 * - HW_UART0_D - UART Data Register
 * - HW_UART0_MA1 - UART Match Address Registers 1
 * - HW_UART0_MA2 - UART Match Address Registers 2
 * - HW_UART0_C4 - UART Control Register 4
 * - HW_UART0_C5 - UART Control Register 5
 *
 * - hw_uart0_t - Struct containing all module registers.
 */

#define HW_UART0_INSTANCE_COUNT (1U) /*!< Number of instances of the UART0 module. */
#define HW_UART0 (0U) /*!< Instance number for UART0. */

/*******************************************************************************
 * HW_UART0_BDH - UART Baud Rate Register High
 ******************************************************************************/

/*!
 * @brief HW_UART0_BDH - UART Baud Rate Register High (RW)
 *
 * Reset value: 0x00U
 *
 * This register, along with UART_BDL, controls the prescale divisor for UART
 * baud rate generation. The 13-bit baud rate setting [SBR12:SBR0] should only be
 * updated when the transmitter and receiver are both disabled.
 */
typedef union _hw_uart0_bdh
{
    uint8_t U;
    struct _hw_uart0_bdh_bitfields
    {
        uint8_t SBR : 5;               /*!< [4:0] Baud Rate Modulo Divisor. */
        uint8_t SBNS : 1;              /*!< [5] Stop Bit Number Select */
        uint8_t RXEDGIE : 1;           /*!< [6] RX Input Active Edge Interrupt Enable
                                        * (for RXEDGIF) */
        uint8_t LBKDIE : 1;            /*!< [7] LIN Break Detect Interrupt Enable (for
                                        * LBKDIF) */
    } B;
} hw_uart0_bdh_t;

/*!
 * @name Constants and macros for entire UART0_BDH register
 */
/*@{*/
#define HW_UART0_BDH_ADDR(x)     ((uint32_t)(x) + 0x0U)

#define HW_UART0_BDH(x)          (*(__IO hw_uart0_bdh_t *) HW_UART0_BDH_ADDR(x))
#define HW_UART0_BDH_RD(x)       (HW_UART0_BDH(x).U)
#define HW_UART0_BDH_WR(x, v)    (HW_UART0_BDH(x).U = (v))
#define HW_UART0_BDH_SET(x, v)   (BME_OR8(HW_UART0_BDH_ADDR(x), (uint8_t)(v)))
#define HW_UART0_BDH_CLR(x, v)   (BME_AND8(HW_UART0_BDH_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_BDH_TOG(x, v)   (BME_XOR8(HW_UART0_BDH_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_BDH bitfields
 */

/*!
 * @name Register UART0_BDH, field SBR[4:0] (RW)
 *
 * The 13 bits in SBR[12:0] are referred to collectively as BR, and they set the
 * modulo divide rate for the baud rate generator. When BR is 1 - 8191, the baud
 * rate equals baud clock / ((OSR+1) * BR).
 */
/*@{*/
#define BP_UART0_BDH_SBR     (0U)          /*!< Bit position for UART0_BDH_SBR. */
#define BM_UART0_BDH_SBR     (0x1FU)       /*!< Bit mask for UART0_BDH_SBR. */
#define BS_UART0_BDH_SBR     (5U)          /*!< Bit field size in bits for UART0_BDH_SBR. */

/*! @brief Read current value of the UART0_BDH_SBR field. */
#define BR_UART0_BDH_SBR(x)  (BME_UBFX8(HW_UART0_BDH_ADDR(x), BP_UART0_BDH_SBR, BS_UART0_BDH_SBR))

/*! @brief Format value for bitfield UART0_BDH_SBR. */
#define BF_UART0_BDH_SBR(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_BDH_SBR) & BM_UART0_BDH_SBR)

/*! @brief Set the SBR field to a new value. */
#define BW_UART0_BDH_SBR(x, v) (BME_BFI8(HW_UART0_BDH_ADDR(x), ((uint8_t)(v) << BP_UART0_BDH_SBR), BP_UART0_BDH_SBR, 5))
/*@}*/

/*!
 * @name Register UART0_BDH, field SBNS[5] (RW)
 *
 * SBNS determines whether data characters are one or two stop bits. This bit
 * should only be changed when the transmitter and receiver are both disabled.
 *
 * Values:
 * - 0 - One stop bit.
 * - 1 - Two stop bit.
 */
/*@{*/
#define BP_UART0_BDH_SBNS    (5U)          /*!< Bit position for UART0_BDH_SBNS. */
#define BM_UART0_BDH_SBNS    (0x20U)       /*!< Bit mask for UART0_BDH_SBNS. */
#define BS_UART0_BDH_SBNS    (1U)          /*!< Bit field size in bits for UART0_BDH_SBNS. */

/*! @brief Read current value of the UART0_BDH_SBNS field. */
#define BR_UART0_BDH_SBNS(x) (BME_UBFX8(HW_UART0_BDH_ADDR(x), BP_UART0_BDH_SBNS, BS_UART0_BDH_SBNS))

/*! @brief Format value for bitfield UART0_BDH_SBNS. */
#define BF_UART0_BDH_SBNS(v) ((uint8_t)((uint8_t)(v) << BP_UART0_BDH_SBNS) & BM_UART0_BDH_SBNS)

/*! @brief Set the SBNS field to a new value. */
#define BW_UART0_BDH_SBNS(x, v) (BME_BFI8(HW_UART0_BDH_ADDR(x), ((uint8_t)(v) << BP_UART0_BDH_SBNS), BP_UART0_BDH_SBNS, 1))
/*@}*/

/*!
 * @name Register UART0_BDH, field RXEDGIE[6] (RW)
 *
 * Values:
 * - 0 - Hardware interrupts from UART_S2[RXEDGIF] disabled (use polling).
 * - 1 - Hardware interrupt requested when UART_S2[RXEDGIF] flag is 1.
 */
/*@{*/
#define BP_UART0_BDH_RXEDGIE (6U)          /*!< Bit position for UART0_BDH_RXEDGIE. */
#define BM_UART0_BDH_RXEDGIE (0x40U)       /*!< Bit mask for UART0_BDH_RXEDGIE. */
#define BS_UART0_BDH_RXEDGIE (1U)          /*!< Bit field size in bits for UART0_BDH_RXEDGIE. */

/*! @brief Read current value of the UART0_BDH_RXEDGIE field. */
#define BR_UART0_BDH_RXEDGIE(x) (BME_UBFX8(HW_UART0_BDH_ADDR(x), BP_UART0_BDH_RXEDGIE, BS_UART0_BDH_RXEDGIE))

/*! @brief Format value for bitfield UART0_BDH_RXEDGIE. */
#define BF_UART0_BDH_RXEDGIE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_BDH_RXEDGIE) & BM_UART0_BDH_RXEDGIE)

/*! @brief Set the RXEDGIE field to a new value. */
#define BW_UART0_BDH_RXEDGIE(x, v) (BME_BFI8(HW_UART0_BDH_ADDR(x), ((uint8_t)(v) << BP_UART0_BDH_RXEDGIE), BP_UART0_BDH_RXEDGIE, 1))
/*@}*/

/*!
 * @name Register UART0_BDH, field LBKDIE[7] (RW)
 *
 * Values:
 * - 0 - Hardware interrupts from UART_S2[LBKDIF] disabled (use polling).
 * - 1 - Hardware interrupt requested when UART_S2[LBKDIF] flag is 1.
 */
/*@{*/
#define BP_UART0_BDH_LBKDIE  (7U)          /*!< Bit position for UART0_BDH_LBKDIE. */
#define BM_UART0_BDH_LBKDIE  (0x80U)       /*!< Bit mask for UART0_BDH_LBKDIE. */
#define BS_UART0_BDH_LBKDIE  (1U)          /*!< Bit field size in bits for UART0_BDH_LBKDIE. */

/*! @brief Read current value of the UART0_BDH_LBKDIE field. */
#define BR_UART0_BDH_LBKDIE(x) (BME_UBFX8(HW_UART0_BDH_ADDR(x), BP_UART0_BDH_LBKDIE, BS_UART0_BDH_LBKDIE))

/*! @brief Format value for bitfield UART0_BDH_LBKDIE. */
#define BF_UART0_BDH_LBKDIE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_BDH_LBKDIE) & BM_UART0_BDH_LBKDIE)

