theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Read current value of the UART0_C2_TE field. */
#define BR_UART0_C2_TE(x)    (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_TE, BS_UART0_C2_TE))

/*! @brief Format value for bitfield UART0_C2_TE. */
#define BF_UART0_C2_TE(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_C2_TE) & BM_UART0_C2_TE)

/*! @brief Set the TE field to a new value. */
#define BW_UART0_C2_TE(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_TE), BP_UART0_C2_TE, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field ILIE[4] (RW)
 *
 * Values:
 * - 0 - Hardware interrupts from IDLE disabled; use polling.
 * - 1 - Hardware interrupt requested when IDLE flag is 1.
 */
/*@{*/
#define BP_UART0_C2_ILIE     (4U)          /*!< Bit position for UART0_C2_ILIE. */
#define BM_UART0_C2_ILIE     (0x10U)       /*!< Bit mask for UART0_C2_ILIE. */
#define BS_UART0_C2_ILIE     (1U)          /*!< Bit field size in bits for UART0_C2_ILIE. */

/*! @brief Read current value of the UART0_C2_ILIE field. */
#define BR_UART0_C2_ILIE(x)  (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_ILIE, BS_UART0_C2_ILIE))

/*! @brief Format value for bitfield UART0_C2_ILIE. */
#define BF_UART0_C2_ILIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C2_ILIE) & BM_UART0_C2_ILIE)

/*! @brief Set the ILIE field to a new value. */
#define BW_UART0_C2_ILIE(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_ILIE), BP_UART0_C2_ILIE, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field RIE[5] (RW)
 *
 * Values:
 * - 0 - Hardware interrupts from RDRF disabled; use polling.
 * - 1 - Hardware interrupt requested when RDRF flag is 1.
 */
/*@{*/
#define BP_UART0_C2_RIE      (5U)          /*!< Bit position for UART0_C2_RIE. */
#define BM_UART0_C2_RIE      (0x20U)       /*!< Bit mask for UART0_C2_RIE. */
#define BS_UART0_C2_RIE      (1U)          /*!< Bit field size in bits for UART0_C2_RIE. */

/*! @brief Read current value of the UART0_C2_RIE field. */
#define BR_UART0_C2_RIE(x)   (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_RIE, BS_UART0_C2_RIE))

/*! @brief Format value for bitfield UART0_C2_RIE. */
#define BF_UART0_C2_RIE(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C2_RIE) & BM_UART0_C2_RIE)

/*! @brief Set the RIE field to a new value. */
#define BW_UART0_C2_RIE(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_RIE), BP_UART0_C2_RIE, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field TCIE[6] (RW)
 *
 * Values:
 * - 0 - Hardware interrupts from TC disabled; use polling.
 * - 1 - Hardware interrupt requested when TC flag is 1.
 */
/*@{*/
#define BP_UART0_C2_TCIE     (6U)          /*!< Bit position for UART0_C2_TCIE. */
#define BM_UART0_C2_TCIE     (0x40U)       /*!< Bit mask for UART0_C2_TCIE. */
#define BS_UART0_C2_TCIE     (1U)          /*!< Bit field size in bits for UART0_C2_TCIE. */

/*! @brief Read current value of the UART0_C2_TCIE field. */
#define BR_UART0_C2_TCIE(x)  (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_TCIE, BS_UART0_C2_TCIE))

/*! @brief Format value for bitfield UART0_C2_TCIE. */
#define BF_UART0_C2_TCIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C2_TCIE) & BM_UART0_C2_TCIE)

/*! @brief Set the TCIE field to a new value. */
#define BW_UART0_C2_TCIE(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_TCIE), BP_UART0_C2_TCIE, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field TIE[7] (RW)
 *
 * Values:
 * - 0 - Hardware interrupts from TDRE disabled; use polling.
 * - 1 - Hardware interrupt requested when TDRE flag is 1.
 */
/*@{*/
#define BP_UART0_C2_TIE      (7U)          /*!< Bit position for UART0_C2_TIE. */
#define BM_UART0_C2_TIE      (0x80U)       /*!< Bit mask for UART0_C2_TIE. */
#define BS_UART0_C2_TIE      (1U)          /*!< Bit field size in bits for UART0_C2_TIE. */

/*! @brief Read current value of the UART0_C2_TIE field. */
#define BR_UART0_C2_TIE(x)   (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_TIE, BS_UART0_C2_TIE))

/*! @brief Format value for bitfield UART0_C2_TIE. */
#define BF_UART0_C2_TIE(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C2_TIE) & BM_UART0_C2_TIE)

/*! @brief Set the TIE field to a new value. */
#define BW_UART0_C2_TIE(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_TIE), BP_UART0_C2_TIE, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_S1 - UART Status Register 1
 ******************************************************************************/

/*!
 * @brief HW_UART0_S1 - UART Status Register 1 (RW)
 *
 * Reset value: 0xC0U
 */
typedef union _hw_uart0_s1
{
    uint8_t U;
    struct _hw_uart0_s1_bitfields
    {
        uint8_t PF : 1;                /*!< [0] Parity Error Flag */
        uint8_t FE : 1;                /*!< [1] Framing Error Flag */
        uint8_t NF : 1;                /*!< [2] Noise Flag */
        uint8_t OR : 1;                /*!< [3] Receiver Overrun Flag */
        uint8_t IDLE : 1;              /*!< [4] Idle Line Flag */
        uint8_t RDRF : 1;              /*!< [5] Receive Data Register Full Flag */
        uint8_t TC : 1;                /*!< [6] Transmission Complete Flag */
        uint8_t TDRE : 1;              /*!< [7] Transmit Data Register Empty Flag */
    } B;
} hw_uart0_s1_t;

/*!
 * @name Constants and macros for entire UART0_S1 register
 */
/*@{*/
#define HW_UART0_S1_ADDR(x)      ((uint32_t)(x) + 0x4U)

#define HW_UART0_S1(x)           (*(__IO hw_uart0_s1_t *) HW_UART0_S1_ADDR(x))
#define HW_UART0_S1_RD(x)        (HW_UART0_S1(x).U)
#define HW_UART0_S1_WR(x, v)     (HW_UART0_S1(x).U = (v))
#define HW_UART0_S1_SET(x, v)    (BME_OR8(HW_UART0_S1_ADDR(x), (uint8_t)(v)))
#define HW_UART0_S1_CLR(x, v)    (BME_AND8(HW_UART0_S1_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_S1_TOG(x, v)    (BME_XOR8(HW_UART0_S1_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_S1 bitfields
 */

/*!
 * @name Register UART0_S1, field PF[0] (W1C)
 *
 * PF is set at the same time as RDRF when parity is enabled (PE = 1) and the
 * parity bit in the received character does not agree with the expected parity
 * value. To clear PF, write a logic one to the PF.
 *
 * Values:
 * - 0 - No parity error.
 * - 1 - Parity error.
 */
/*@{*/
#define BP_UART0_S1_PF       (0U)          /*!< Bit position for UART0_S1_PF. */
#define BM_UART0_S1_PF       (0x01U)       /*!< Bit mask for UART0_S1_PF. */
#define BS_UART0_S1_PF       (1U)          /*!< Bit field size in bits for UART0_S1_PF. */

/*! @brief Read current value of the UART0_S1_PF field. */
#define BR_UART0_S1_PF(x)    (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_PF, BS_UART0_S1_PF))

/*! @brief Format value for bitfield UART0_S1_PF. */
#define BF_UART0_S1_PF(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_S1_PF) & BM_UART0_S1_PF)

/*! @brief Set the PF field to a new value. */
#define BW_UART0_S1_PF(x, v) (BME_BFI8(HW_UART0_S1_ADDR(x), ((uint8_t)(v) << BP_UART0_S1_PF), BP_UART0_S1_PF, 1))
/*@}*/

/*!
 * @name Register UART0_S1, field FE[1] (W1C)
 *
 * FE is set at the same time as RDRF when the receiver detects a logic 0 where
 * a stop bit was expected. This suggests the receiver was not properly aligned
 * to a character frame. To clear FE, write a logic one to the FE flag.
 *
 * Values:
 * - 0 - No framing error detected. This does not guarantee the framing is
 *     correct.
 * - 1 - Framing error.
 */
/*@{*/
#define BP_UART0_S1_FE       (1U)          /*!< Bit position for UART0_S1_FE. */
#define BM_UART0_S1_FE       (0x02U)       /*!< Bit mask for UART0_S1_FE. */
#define BS_UART0_S1_FE       (1U)          /*!< Bit field size in bits for UART0_S1_FE. */

/*! @brief Read current value of the UART0_S1_FE field. */
#define BR_UART0_S1_FE(x)    (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_FE, BS_UART0_S1_FE))

