theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield UART0_S1_FE. */
#define BF_UART0_S1_FE(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_S1_FE) & BM_UART0_S1_FE)

/*! @brief Set the FE field to a new value. */
#define BW_UART0_S1_FE(x, v) (BME_BFI8(HW_UART0_S1_ADDR(x), ((uint8_t)(v) << BP_UART0_S1_FE), BP_UART0_S1_FE, 1))
/*@}*/

/*!
 * @name Register UART0_S1, field NF[2] (W1C)
 *
 * The advanced sampling technique used in the receiver takes three samples in
 * each of the received bits. If any of these samples disagrees with the rest of
 * the samples within any bit time in the frame, the flag NF is set at the same
 * time as RDRF is set for the character. To clear NF, write logic one to the NF.
 *
 * Values:
 * - 0 - No noise detected.
 * - 1 - Noise detected in the received character in UART_D.
 */
/*@{*/
#define BP_UART0_S1_NF       (2U)          /*!< Bit position for UART0_S1_NF. */
#define BM_UART0_S1_NF       (0x04U)       /*!< Bit mask for UART0_S1_NF. */
#define BS_UART0_S1_NF       (1U)          /*!< Bit field size in bits for UART0_S1_NF. */

/*! @brief Read current value of the UART0_S1_NF field. */
#define BR_UART0_S1_NF(x)    (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_NF, BS_UART0_S1_NF))

/*! @brief Format value for bitfield UART0_S1_NF. */
#define BF_UART0_S1_NF(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_S1_NF) & BM_UART0_S1_NF)

/*! @brief Set the NF field to a new value. */
#define BW_UART0_S1_NF(x, v) (BME_BFI8(HW_UART0_S1_ADDR(x), ((uint8_t)(v) << BP_UART0_S1_NF), BP_UART0_S1_NF, 1))
/*@}*/

/*!
 * @name Register UART0_S1, field OR[3] (W1C)
 *
 * OR is set when a new serial character is ready to be transferred to the
 * receive data buffer, but the previously received character has not been read from
 * UART_D yet. In this case, the new character, and all associated error
 * information, is lost because there is no room to move it into UART_D. To clear OR,
 * write a logic 1 to the OR flag.
 *
 * Values:
 * - 0 - No overrun.
 * - 1 - Receive overrun (new UART data lost).
 */
/*@{*/
#define BP_UART0_S1_OR       (3U)          /*!< Bit position for UART0_S1_OR. */
#define BM_UART0_S1_OR       (0x08U)       /*!< Bit mask for UART0_S1_OR. */
#define BS_UART0_S1_OR       (1U)          /*!< Bit field size in bits for UART0_S1_OR. */

/*! @brief Read current value of the UART0_S1_OR field. */
#define BR_UART0_S1_OR(x)    (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_OR, BS_UART0_S1_OR))

/*! @brief Format value for bitfield UART0_S1_OR. */
#define BF_UART0_S1_OR(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_S1_OR) & BM_UART0_S1_OR)

/*! @brief Set the OR field to a new value. */
#define BW_UART0_S1_OR(x, v) (BME_BFI8(HW_UART0_S1_ADDR(x), ((uint8_t)(v) << BP_UART0_S1_OR), BP_UART0_S1_OR, 1))
/*@}*/

/*!
 * @name Register UART0_S1, field IDLE[4] (W1C)
 *
 * IDLE is set when the UART receive line becomes idle for a full character time
 * after a period of activity. When ILT is cleared, the receiver starts counting
 * idle bit times after the start bit. If the receive character is all 1s, these
 * bit times and the stop bits time count toward the full character time of
 * logic high, 10 to 13 bit times, needed for the receiver to detect an idle line.
 * When ILT is set, the receiver doesn't start counting idle bit times until after
 * the stop bits. The stop bits and any logic high bit times at the end of the
 * previous character do not count toward the full character time of logic high
 * needed for the receiver to detect an idle line. To clear IDLE, write logic 1 to
 * the IDLE flag. After IDLE has been cleared, it cannot become set again until
 * after a new character has been received and RDRF has been set. IDLE is set only
 * once even if the receive line remains idle for an extended period.
 *
 * Values:
 * - 0 - No idle line detected.
 * - 1 - Idle line was detected.
 */
/*@{*/
#define BP_UART0_S1_IDLE     (4U)          /*!< Bit position for UART0_S1_IDLE. */
#define BM_UART0_S1_IDLE     (0x10U)       /*!< Bit mask for UART0_S1_IDLE. */
#define BS_UART0_S1_IDLE     (1U)          /*!< Bit field size in bits for UART0_S1_IDLE. */

/*! @brief Read current value of the UART0_S1_IDLE field. */
#define BR_UART0_S1_IDLE(x)  (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_IDLE, BS_UART0_S1_IDLE))

/*! @brief Format value for bitfield UART0_S1_IDLE. */
#define BF_UART0_S1_IDLE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_S1_IDLE) & BM_UART0_S1_IDLE)

/*! @brief Set the IDLE field to a new value. */
#define BW_UART0_S1_IDLE(x, v) (BME_BFI8(HW_UART0_S1_ADDR(x), ((uint8_t)(v) << BP_UART0_S1_IDLE), BP_UART0_S1_IDLE, 1))
/*@}*/

/*!
 * @name Register UART0_S1, field RDRF[5] (RO)
 *
 * RDRF becomes set whenever the receive data buffer is full. To clear RDRF,
 * read the UART data register ( UART_D).
 *
 * Values:
 * - 0 - Receive data buffer empty.
 * - 1 - Receive data buffer full.
 */
/*@{*/
#define BP_UART0_S1_RDRF     (5U)          /*!< Bit position for UART0_S1_RDRF. */
#define BM_UART0_S1_RDRF     (0x20U)       /*!< Bit mask for UART0_S1_RDRF. */
#define BS_UART0_S1_RDRF     (1U)          /*!< Bit field size in bits for UART0_S1_RDRF. */

/*! @brief Read current value of the UART0_S1_RDRF field. */
#define BR_UART0_S1_RDRF(x)  (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_RDRF, BS_UART0_S1_RDRF))
/*@}*/

/*!
 * @name Register UART0_S1, field TC[6] (RO)
 *
 * TC is set out of reset and when TDRE is set and no data, preamble, or break
 * character is being transmitted. TC is cleared automatically by one of the
 * following: Write to the UART data register ( UART_D) to transmit new data Queue a
 * preamble by changing TE from 0 to 1 Queue a break character by writing 1 to
 * UART_C2[SBK]
 *
 * Values:
 * - 0 - Transmitter active (sending data, a preamble, or a break).
 * - 1 - Transmitter idle (transmission activity complete).
 */
/*@{*/
#define BP_UART0_S1_TC       (6U)          /*!< Bit position for UART0_S1_TC. */
#define BM_UART0_S1_TC       (0x40U)       /*!< Bit mask for UART0_S1_TC. */
#define BS_UART0_S1_TC       (1U)          /*!< Bit field size in bits for UART0_S1_TC. */

/*! @brief Read current value of the UART0_S1_TC field. */
#define BR_UART0_S1_TC(x)    (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_TC, BS_UART0_S1_TC))
/*@}*/

/*!
 * @name Register UART0_S1, field TDRE[7] (RO)
 *
 * TDRE is set out of reset and whenever there is room to write data to the
 * transmit data buffer. To clear TDRE, write to the UART data register ( UART_D).
 *
 * Values:
 * - 0 - Transmit data buffer full.
 * - 1 - Transmit data buffer empty.
 */
/*@{*/
#define BP_UART0_S1_TDRE     (7U)          /*!< Bit position for UART0_S1_TDRE. */
#define BM_UART0_S1_TDRE     (0x80U)       /*!< Bit mask for UART0_S1_TDRE. */
#define BS_UART0_S1_TDRE     (1U)          /*!< Bit field size in bits for UART0_S1_TDRE. */

/*! @brief Read current value of the UART0_S1_TDRE field. */
#define BR_UART0_S1_TDRE(x)  (BME_UBFX8(HW_UART0_S1_ADDR(x), BP_UART0_S1_TDRE, BS_UART0_S1_TDRE))
/*@}*/

