theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the BRK13 field to a new value. */
#define BW_UART0_S2_BRK13(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_BRK13), BP_UART0_S2_BRK13, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field RWUID[3] (RW)
 *
 * RWUID controls whether the idle character that wakes up the receiver sets the
 * IDLE bit. This bit should only be changed when the receiver is disabled.
 *
 * Values:
 * - 0 - During receive standby state (RWU = 1), the IDLE bit does not get set
 *     upon detection of an idle character.
 * - 1 - During receive standby state (RWU = 1), the IDLE bit gets set upon
 *     detection of an idle character.
 */
/*@{*/
#define BP_UART0_S2_RWUID    (3U)          /*!< Bit position for UART0_S2_RWUID. */
#define BM_UART0_S2_RWUID    (0x08U)       /*!< Bit mask for UART0_S2_RWUID. */
#define BS_UART0_S2_RWUID    (1U)          /*!< Bit field size in bits for UART0_S2_RWUID. */

/*! @brief Read current value of the UART0_S2_RWUID field. */
#define BR_UART0_S2_RWUID(x) (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_RWUID, BS_UART0_S2_RWUID))

/*! @brief Format value for bitfield UART0_S2_RWUID. */
#define BF_UART0_S2_RWUID(v) ((uint8_t)((uint8_t)(v) << BP_UART0_S2_RWUID) & BM_UART0_S2_RWUID)

/*! @brief Set the RWUID field to a new value. */
#define BW_UART0_S2_RWUID(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_RWUID), BP_UART0_S2_RWUID, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field RXINV[4] (RW)
 *
 * Setting this bit reverses the polarity of the received data input. Setting
 * RXINV inverts the UART_RXD input for all cases: data bits, start and stop bits,
 * break, and idle.
 *
 * Values:
 * - 0 - Receive data not inverted.
 * - 1 - Receive data inverted.
 */
/*@{*/
#define BP_UART0_S2_RXINV    (4U)          /*!< Bit position for UART0_S2_RXINV. */
#define BM_UART0_S2_RXINV    (0x10U)       /*!< Bit mask for UART0_S2_RXINV. */
#define BS_UART0_S2_RXINV    (1U)          /*!< Bit field size in bits for UART0_S2_RXINV. */

/*! @brief Read current value of the UART0_S2_RXINV field. */
#define BR_UART0_S2_RXINV(x) (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_RXINV, BS_UART0_S2_RXINV))

/*! @brief Format value for bitfield UART0_S2_RXINV. */
#define BF_UART0_S2_RXINV(v) ((uint8_t)((uint8_t)(v) << BP_UART0_S2_RXINV) & BM_UART0_S2_RXINV)

/*! @brief Set the RXINV field to a new value. */
#define BW_UART0_S2_RXINV(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_RXINV), BP_UART0_S2_RXINV, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field MSBF[5] (RW)
 *
 * Setting this bit reverses the order of the bits that are transmitted and
 * received on the wire. This bit does not affect the polarity of the bits, the
 * location of the parity bit or the location of the start or stop bits. This bit
 * should only be changed when the transmitter and receiver are both disabled.
 *
 * Values:
 * - 0 - LSB (bit0) is the first bit that is transmitted following the start
 *     bit. Further, the first bit received after the start bit is identified as
 *     bit0.
 * - 1 - MSB (bit9, bit8, bit7 or bit6) is the first bit that is transmitted
 *     following the start bit depending on the setting of C1[M], C1[PE] and
 *     C4[M10]. Further, the first bit received after the start bit is identified as
 *     bit9, bit8, bit7 or bit6 depending on the setting of C1[M] and C1[PE].
 */
/*@{*/
#define BP_UART0_S2_MSBF     (5U)          /*!< Bit position for UART0_S2_MSBF. */
#define BM_UART0_S2_MSBF     (0x20U)       /*!< Bit mask for UART0_S2_MSBF. */
#define BS_UART0_S2_MSBF     (1U)          /*!< Bit field size in bits for UART0_S2_MSBF. */

/*! @brief Read current value of the UART0_S2_MSBF field. */
#define BR_UART0_S2_MSBF(x)  (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_MSBF, BS_UART0_S2_MSBF))

/*! @brief Format value for bitfield UART0_S2_MSBF. */
#define BF_UART0_S2_MSBF(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_S2_MSBF) & BM_UART0_S2_MSBF)

/*! @brief Set the MSBF field to a new value. */
#define BW_UART0_S2_MSBF(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_MSBF), BP_UART0_S2_MSBF, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field RXEDGIF[6] (RW)
 *
 * RXEDGIF is set when an active edge, falling if RXINV = 0, rising if RXINV=1,
 * on the UART_RX pin occurs. RXEDGIF is cleared by writing a 1 to it.
 *
 * Values:
 * - 0 - No active edge on the receive pin has occurred.
 * - 1 - An active edge on the receive pin has occurred.
 */
/*@{*/
#define BP_UART0_S2_RXEDGIF  (6U)          /*!< Bit position for UART0_S2_RXEDGIF. */
#define BM_UART0_S2_RXEDGIF  (0x40U)       /*!< Bit mask for UART0_S2_RXEDGIF. */
#define BS_UART0_S2_RXEDGIF  (1U)          /*!< Bit field size in bits for UART0_S2_RXEDGIF. */

/*! @brief Read current value of the UART0_S2_RXEDGIF field. */
#define BR_UART0_S2_RXEDGIF(x) (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_RXEDGIF, BS_UART0_S2_RXEDGIF))

/*! @brief Format value for bitfield UART0_S2_RXEDGIF. */
#define BF_UART0_S2_RXEDGIF(v) ((uint8_t)((uint8_t)(v) << BP_UART0_S2_RXEDGIF) & BM_UART0_S2_RXEDGIF)

/*! @brief Set the RXEDGIF field to a new value. */
#define BW_UART0_S2_RXEDGIF(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_RXEDGIF), BP_UART0_S2_RXEDGIF, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field LBKDIF[7] (RW)
 *
 * LBKDIF is set when the LIN break detect circuitry is enabled and a LIN break
 * character is detected. LBKDIF is cleared by writing a 1 to it.
 *
 * Values:
 * - 0 - No LIN break character has been detected.
 * - 1 - LIN break character has been detected.
 */
/*@{*/
#define BP_UART0_S2_LBKDIF   (7U)          /*!< Bit position for UART0_S2_LBKDIF. */
#define BM_UART0_S2_LBKDIF   (0x80U)       /*!< Bit mask for UART0_S2_LBKDIF. */
#define BS_UART0_S2_LBKDIF   (1U)          /*!< Bit field size in bits for UART0_S2_LBKDIF. */

/*! @brief Read current value of the UART0_S2_LBKDIF field. */
#define BR_UART0_S2_LBKDIF(x) (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_LBKDIF, BS_UART0_S2_LBKDIF))

