theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield UART0_S2_LBKDIF. */
#define BF_UART0_S2_LBKDIF(v) ((uint8_t)((uint8_t)(v) << BP_UART0_S2_LBKDIF) & BM_UART0_S2_LBKDIF)

/*! @brief Set the LBKDIF field to a new value. */
#define BW_UART0_S2_LBKDIF(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_LBKDIF), BP_UART0_S2_LBKDIF, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_C3 - UART Control Register 3
 ******************************************************************************/

/*!
 * @brief HW_UART0_C3 - UART Control Register 3 (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart0_c3
{
    uint8_t U;
    struct _hw_uart0_c3_bitfields
    {
        uint8_t PEIE : 1;              /*!< [0] Parity Error Interrupt Enable */
        uint8_t FEIE : 1;              /*!< [1] Framing Error Interrupt Enable */
        uint8_t NEIE : 1;              /*!< [2] Noise Error Interrupt Enable */
        uint8_t ORIE : 1;              /*!< [3] Overrun Interrupt Enable */
        uint8_t TXINV : 1;             /*!< [4] Transmit Data Inversion */
        uint8_t TXDIR : 1;             /*!< [5] UART_TX Pin Direction in Single-Wire Mode
                                        * */
        uint8_t R9T8 : 1;              /*!< [6] Receive Bit 9 / Transmit Bit 8 */
        uint8_t R8T9 : 1;              /*!< [7] Receive Bit 8 / Transmit Bit 9 */
    } B;
} hw_uart0_c3_t;

/*!
 * @name Constants and macros for entire UART0_C3 register
 */
/*@{*/
#define HW_UART0_C3_ADDR(x)      ((uint32_t)(x) + 0x6U)

#define HW_UART0_C3(x)           (*(__IO hw_uart0_c3_t *) HW_UART0_C3_ADDR(x))
#define HW_UART0_C3_RD(x)        (HW_UART0_C3(x).U)
#define HW_UART0_C3_WR(x, v)     (HW_UART0_C3(x).U = (v))
#define HW_UART0_C3_SET(x, v)    (BME_OR8(HW_UART0_C3_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C3_CLR(x, v)    (BME_AND8(HW_UART0_C3_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C3_TOG(x, v)    (BME_XOR8(HW_UART0_C3_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C3 bitfields
 */

/*!
 * @name Register UART0_C3, field PEIE[0] (RW)
 *
 * This bit enables the parity error flag (PF) to generate hardware interrupt
 * requests.
 *
 * Values:
 * - 0 - PF interrupts disabled; use polling).
 * - 1 - Hardware interrupt requested when PF is set.
 */
/*@{*/
#define BP_UART0_C3_PEIE     (0U)          /*!< Bit position for UART0_C3_PEIE. */
#define BM_UART0_C3_PEIE     (0x01U)       /*!< Bit mask for UART0_C3_PEIE. */
#define BS_UART0_C3_PEIE     (1U)          /*!< Bit field size in bits for UART0_C3_PEIE. */

/*! @brief Read current value of the UART0_C3_PEIE field. */
#define BR_UART0_C3_PEIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_PEIE, BS_UART0_C3_PEIE))

/*! @brief Format value for bitfield UART0_C3_PEIE. */
#define BF_UART0_C3_PEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_PEIE) & BM_UART0_C3_PEIE)

/*! @brief Set the PEIE field to a new value. */
#define BW_UART0_C3_PEIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_PEIE), BP_UART0_C3_PEIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field FEIE[1] (RW)
 *
 * This bit enables the framing error flag (FE) to generate hardware interrupt
 * requests.
 *
 * Values:
 * - 0 - FE interrupts disabled; use polling.
 * - 1 - Hardware interrupt requested when FE is set.
 */
/*@{*/
#define BP_UART0_C3_FEIE     (1U)          /*!< Bit position for UART0_C3_FEIE. */
#define BM_UART0_C3_FEIE     (0x02U)       /*!< Bit mask for UART0_C3_FEIE. */
#define BS_UART0_C3_FEIE     (1U)          /*!< Bit field size in bits for UART0_C3_FEIE. */

/*! @brief Read current value of the UART0_C3_FEIE field. */
#define BR_UART0_C3_FEIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_FEIE, BS_UART0_C3_FEIE))

/*! @brief Format value for bitfield UART0_C3_FEIE. */
#define BF_UART0_C3_FEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_FEIE) & BM_UART0_C3_FEIE)

/*! @brief Set the FEIE field to a new value. */
#define BW_UART0_C3_FEIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_FEIE), BP_UART0_C3_FEIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field NEIE[2] (RW)
 *
 * This bit enables the noise flag (NF) to generate hardware interrupt requests.
 *
 * Values:
 * - 0 - NF interrupts disabled; use polling.
 * - 1 - Hardware interrupt requested when NF is set.
 */
/*@{*/
#define BP_UART0_C3_NEIE     (2U)          /*!< Bit position for UART0_C3_NEIE. */
#define BM_UART0_C3_NEIE     (0x04U)       /*!< Bit mask for UART0_C3_NEIE. */
#define BS_UART0_C3_NEIE     (1U)          /*!< Bit field size in bits for UART0_C3_NEIE. */

/*! @brief Read current value of the UART0_C3_NEIE field. */
#define BR_UART0_C3_NEIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_NEIE, BS_UART0_C3_NEIE))

/*! @brief Format value for bitfield UART0_C3_NEIE. */
#define BF_UART0_C3_NEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_NEIE) & BM_UART0_C3_NEIE)

/*! @brief Set the NEIE field to a new value. */
#define BW_UART0_C3_NEIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_NEIE), BP_UART0_C3_NEIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field ORIE[3] (RW)
 *
 * This bit enables the overrun flag (OR) to generate hardware interrupt
 * requests.
 *
 * Values:
 * - 0 - OR interrupts disabled; use polling.
 * - 1 - Hardware interrupt requested when OR is set.
 */
/*@{*/
#define BP_UART0_C3_ORIE     (3U)          /*!< Bit position for UART0_C3_ORIE. */
#define BM_UART0_C3_ORIE     (0x08U)       /*!< Bit mask for UART0_C3_ORIE. */
#define BS_UART0_C3_ORIE     (1U)          /*!< Bit field size in bits for UART0_C3_ORIE. */

/*! @brief Read current value of the UART0_C3_ORIE field. */
#define BR_UART0_C3_ORIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_ORIE, BS_UART0_C3_ORIE))

/*! @brief Format value for bitfield UART0_C3_ORIE. */
#define BF_UART0_C3_ORIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_ORIE) & BM_UART0_C3_ORIE)

