theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the ORIE field to a new value. */
#define BW_UART0_C3_ORIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_ORIE), BP_UART0_C3_ORIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field TXINV[4] (RW)
 *
 * Setting this bit reverses the polarity of the transmitted data output.
 * Setting TXINV inverts the UART_TXD output for all cases: data bits, start and stop
 * bits, break, and idle.
 *
 * Values:
 * - 0 - Transmit data not inverted.
 * - 1 - Transmit data inverted.
 */
/*@{*/
#define BP_UART0_C3_TXINV    (4U)          /*!< Bit position for UART0_C3_TXINV. */
#define BM_UART0_C3_TXINV    (0x10U)       /*!< Bit mask for UART0_C3_TXINV. */
#define BS_UART0_C3_TXINV    (1U)          /*!< Bit field size in bits for UART0_C3_TXINV. */

/*! @brief Read current value of the UART0_C3_TXINV field. */
#define BR_UART0_C3_TXINV(x) (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_TXINV, BS_UART0_C3_TXINV))

/*! @brief Format value for bitfield UART0_C3_TXINV. */
#define BF_UART0_C3_TXINV(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C3_TXINV) & BM_UART0_C3_TXINV)

/*! @brief Set the TXINV field to a new value. */
#define BW_UART0_C3_TXINV(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_TXINV), BP_UART0_C3_TXINV, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field TXDIR[5] (RW)
 *
 * When the UART is configured for single-wire half-duplex operation (LOOPS =
 * RSRC = 1), this bit determines the direction of data at the UART_TXD pin. When
 * clearing TXDIR, the transmitter will finish receiving the current character (if
 * any) before the receiver starts receiving data from the UART_TXD pin.
 *
 * Values:
 * - 0 - UART_TXD pin is an input in single-wire mode.
 * - 1 - UART_TXD pin is an output in single-wire mode.
 */
/*@{*/
#define BP_UART0_C3_TXDIR    (5U)          /*!< Bit position for UART0_C3_TXDIR. */
#define BM_UART0_C3_TXDIR    (0x20U)       /*!< Bit mask for UART0_C3_TXDIR. */
#define BS_UART0_C3_TXDIR    (1U)          /*!< Bit field size in bits for UART0_C3_TXDIR. */

/*! @brief Read current value of the UART0_C3_TXDIR field. */
#define BR_UART0_C3_TXDIR(x) (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_TXDIR, BS_UART0_C3_TXDIR))

/*! @brief Format value for bitfield UART0_C3_TXDIR. */
#define BF_UART0_C3_TXDIR(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C3_TXDIR) & BM_UART0_C3_TXDIR)

/*! @brief Set the TXDIR field to a new value. */
#define BW_UART0_C3_TXDIR(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_TXDIR), BP_UART0_C3_TXDIR, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field R9T8[6] (RW)
 *
 * When the UART is configured for 9-bit data (M = 1), T8 may be thought of as a
 * ninth transmit data bit to the left of the msb of the data in the UART_D
 * register. When writing 9-bit data, the entire 9-bit value is transferred to the
 * UART transmit buffer after UART_D is written so T8 should be written, if it
 * needs to change from its previous value, before UART_D is written. If T8 does not
 * need to change in the new value, such as when it is used to generate mark or
 * space parity, it need not be written each time UART_D is written. When the UART
 * is configured for 10-bit data (M10 = 1), R9 can be thought of as a tenth
 * receive data bit. When reading 10-bit data, read R9 and R8 before reading UART_D
 * because reading UART_D completes automatic flag clearing sequences that could
 * allow R8, R9 and UART_D to be overwritten with new data.
 */
/*@{*/
#define BP_UART0_C3_R9T8     (6U)          /*!< Bit position for UART0_C3_R9T8. */
#define BM_UART0_C3_R9T8     (0x40U)       /*!< Bit mask for UART0_C3_R9T8. */
#define BS_UART0_C3_R9T8     (1U)          /*!< Bit field size in bits for UART0_C3_R9T8. */

/*! @brief Read current value of the UART0_C3_R9T8 field. */
#define BR_UART0_C3_R9T8(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_R9T8, BS_UART0_C3_R9T8))

/*! @brief Format value for bitfield UART0_C3_R9T8. */
#define BF_UART0_C3_R9T8(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_R9T8) & BM_UART0_C3_R9T8)

/*! @brief Set the R9T8 field to a new value. */
#define BW_UART0_C3_R9T8(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_R9T8), BP_UART0_C3_R9T8, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field R8T9[7] (RW)
 *
 * When the UART is configured for 9-bit data (M = 1), R8 can be thought of as a
 * ninth receive data bit to the left of the msb of the buffered data in the
 * UART_D register. When reading 9-bit data, read R8 before reading UART_D because
 * reading UART_D completes automatic flag clearing sequences that could allow R8
 * and UART_D to be overwritten with new data. When the UART is configured for
 * 10-bit data (M10 = 1), T9 may be thought of as a tenth transmit data bit. When
 * writing 10-bit data, the entire 10-bit value is transferred to the UART
 * transmit buffer when UART_D is written so T9 and T8 should be written, if it needs to
 * change from its previous value, before UART_D is written. If T9 and T8 do not
 * need to change in the new value, such as when it is used to generate mark or
 * space parity, they need not be written each time UART_D is written.
 */
/*@{*/
#define BP_UART0_C3_R8T9     (7U)          /*!< Bit position for UART0_C3_R8T9. */
#define BM_UART0_C3_R8T9     (0x80U)       /*!< Bit mask for UART0_C3_R8T9. */
#define BS_UART0_C3_R8T9     (1U)          /*!< Bit field size in bits for UART0_C3_R8T9. */

/*! @brief Read current value of the UART0_C3_R8T9 field. */
#define BR_UART0_C3_R8T9(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_R8T9, BS_UART0_C3_R8T9))

/*! @brief Format value for bitfield UART0_C3_R8T9. */
#define BF_UART0_C3_R8T9(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_R8T9) & BM_UART0_C3_R8T9)

/*! @brief Set the R8T9 field to a new value. */
#define BW_UART0_C3_R8T9(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_R8T9), BP_UART0_C3_R8T9, 1))
/*@}*/

