theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Set the R5T5 field to a new value. */
#define BW_UART0_D_R5T5(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R5T5), BP_UART0_D_R5T5, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R6T6[6] (RW)
 *
 * Read receive data buffer 6 or write transmit data buffer 6.
 */
/*@{*/
#define BP_UART0_D_R6T6      (6U)          /*!< Bit position for UART0_D_R6T6. */
#define BM_UART0_D_R6T6      (0x40U)       /*!< Bit mask for UART0_D_R6T6. */
#define BS_UART0_D_R6T6      (1U)          /*!< Bit field size in bits for UART0_D_R6T6. */

/*! @brief Read current value of the UART0_D_R6T6 field. */
#define BR_UART0_D_R6T6(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R6T6, BS_UART0_D_R6T6))

/*! @brief Format value for bitfield UART0_D_R6T6. */
#define BF_UART0_D_R6T6(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R6T6) & BM_UART0_D_R6T6)

/*! @brief Set the R6T6 field to a new value. */
#define BW_UART0_D_R6T6(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R6T6), BP_UART0_D_R6T6, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R7T7[7] (RW)
 *
 * Read receive data buffer 7 or write transmit data buffer 7.
 */
/*@{*/
#define BP_UART0_D_R7T7      (7U)          /*!< Bit position for UART0_D_R7T7. */
#define BM_UART0_D_R7T7      (0x80U)       /*!< Bit mask for UART0_D_R7T7. */
#define BS_UART0_D_R7T7      (1U)          /*!< Bit field size in bits for UART0_D_R7T7. */

/*! @brief Read current value of the UART0_D_R7T7 field. */
#define BR_UART0_D_R7T7(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R7T7, BS_UART0_D_R7T7))

/*! @brief Format value for bitfield UART0_D_R7T7. */
#define BF_UART0_D_R7T7(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R7T7) & BM_UART0_D_R7T7)

/*! @brief Set the R7T7 field to a new value. */
#define BW_UART0_D_R7T7(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R7T7), BP_UART0_D_R7T7, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_MA1 - UART Match Address Registers 1
 ******************************************************************************/

/*!
 * @brief HW_UART0_MA1 - UART Match Address Registers 1 (RW)
 *
 * Reset value: 0x00U
 *
 * The MA1 and MA2 registers are compared to input data addresses when the most
 * significant bit is set and the associated C4[MAEN] bit is set. If a match
 * occurs, the following data is transferred to the data register. If a match fails,
 * the following data is discarded. Software should only write a MA register when
 * the associated C4[MAEN] bit is clear.
 */
typedef union _hw_uart0_ma1
{
    uint8_t U;
    struct _hw_uart0_ma1_bitfields
    {
        uint8_t MA : 8;                /*!< [7:0] Match Address */
    } B;
} hw_uart0_ma1_t;

/*!
 * @name Constants and macros for entire UART0_MA1 register
 */
/*@{*/
#define HW_UART0_MA1_ADDR(x)     ((uint32_t)(x) + 0x8U)

#define HW_UART0_MA1(x)          (*(__IO hw_uart0_ma1_t *) HW_UART0_MA1_ADDR(x))
#define HW_UART0_MA1_RD(x)       (HW_UART0_MA1(x).U)
#define HW_UART0_MA1_WR(x, v)    (HW_UART0_MA1(x).U = (v))
#define HW_UART0_MA1_SET(x, v)   (BME_OR8(HW_UART0_MA1_ADDR(x), (uint8_t)(v)))
#define HW_UART0_MA1_CLR(x, v)   (BME_AND8(HW_UART0_MA1_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_MA1_TOG(x, v)   (BME_XOR8(HW_UART0_MA1_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_MA1 bitfields
 */

/*!
 * @name Register UART0_MA1, field MA[7:0] (RW)
 */
/*@{*/
#define BP_UART0_MA1_MA      (0U)          /*!< Bit position for UART0_MA1_MA. */
#define BM_UART0_MA1_MA      (0xFFU)       /*!< Bit mask for UART0_MA1_MA. */
#define BS_UART0_MA1_MA      (8U)          /*!< Bit field size in bits for UART0_MA1_MA. */

/*! @brief Read current value of the UART0_MA1_MA field. */
#define BR_UART0_MA1_MA(x)   (HW_UART0_MA1(x).U)

/*! @brief Format value for bitfield UART0_MA1_MA. */
#define BF_UART0_MA1_MA(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_MA1_MA) & BM_UART0_MA1_MA)

/*! @brief Set the MA field to a new value. */
#define BW_UART0_MA1_MA(x, v) (HW_UART0_MA1_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART0_MA2 - UART Match Address Registers 2
 ******************************************************************************/

/*!
 * @brief HW_UART0_MA2 - UART Match Address Registers 2 (RW)
 *
 * Reset value: 0x00U
 *
 * The MA1 and MA2 registers are compared to input data addresses when the most
 * significant bit is set and the associated C4[MAEN] bit is set. If a match
 * occurs, the following data is transferred to the data register. If a match fails,
 * the following data is discarded. Software should only write a MA register when
 * the associated C4[MAEN] bit is clear.
 */
typedef union _hw_uart0_ma2
{
    uint8_t U;
    struct _hw_uart0_ma2_bitfields
    {
        uint8_t MA : 8;                /*!< [7:0] Match Address */
    } B;
} hw_uart0_ma2_t;

/*!
 * @name Constants and macros for entire UART0_MA2 register
 */
/*@{*/
#define HW_UART0_MA2_ADDR(x)     ((uint32_t)(x) + 0x9U)

#define HW_UART0_MA2(x)          (*(__IO hw_uart0_ma2_t *) HW_UART0_MA2_ADDR(x))
#define HW_UART0_MA2_RD(x)       (HW_UART0_MA2(x).U)
#define HW_UART0_MA2_WR(x, v)    (HW_UART0_MA2(x).U = (v))
#define HW_UART0_MA2_SET(x, v)   (BME_OR8(HW_UART0_MA2_ADDR(x), (uint8_t)(v)))
#define HW_UART0_MA2_CLR(x, v)   (BME_AND8(HW_UART0_MA2_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_MA2_TOG(x, v)   (BME_XOR8(HW_UART0_MA2_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_MA2 bitfields
 */

/*!
 * @name Register UART0_MA2, field MA[7:0] (RW)
 */
/*@{*/
#define BP_UART0_MA2_MA      (0U)          /*!< Bit position for UART0_MA2_MA. */
#define BM_UART0_MA2_MA      (0xFFU)       /*!< Bit mask for UART0_MA2_MA. */
#define BS_UART0_MA2_MA      (8U)          /*!< Bit field size in bits for UART0_MA2_MA. */

/*! @brief Read current value of the UART0_MA2_MA field. */
#define BR_UART0_MA2_MA(x)   (HW_UART0_MA2(x).U)

