theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield UART0_MA2_MA. */
#define BF_UART0_MA2_MA(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_MA2_MA) & BM_UART0_MA2_MA)

/*! @brief Set the MA field to a new value. */
#define BW_UART0_MA2_MA(x, v) (HW_UART0_MA2_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART0_C4 - UART Control Register 4
 ******************************************************************************/

/*!
 * @brief HW_UART0_C4 - UART Control Register 4 (RW)
 *
 * Reset value: 0x0FU
 */
typedef union _hw_uart0_c4
{
    uint8_t U;
    struct _hw_uart0_c4_bitfields
    {
        uint8_t OSR : 5;               /*!< [4:0] Over Sampling Ratio */
        uint8_t M10 : 1;               /*!< [5] 10-bit Mode select */
        uint8_t MAEN2 : 1;             /*!< [6] Match Address Mode Enable 2 */
        uint8_t MAEN1 : 1;             /*!< [7] Match Address Mode Enable 1 */
    } B;
} hw_uart0_c4_t;

/*!
 * @name Constants and macros for entire UART0_C4 register
 */
/*@{*/
#define HW_UART0_C4_ADDR(x)      ((uint32_t)(x) + 0xAU)

#define HW_UART0_C4(x)           (*(__IO hw_uart0_c4_t *) HW_UART0_C4_ADDR(x))
#define HW_UART0_C4_RD(x)        (HW_UART0_C4(x).U)
#define HW_UART0_C4_WR(x, v)     (HW_UART0_C4(x).U = (v))
#define HW_UART0_C4_SET(x, v)    (BME_OR8(HW_UART0_C4_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C4_CLR(x, v)    (BME_AND8(HW_UART0_C4_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C4_TOG(x, v)    (BME_XOR8(HW_UART0_C4_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C4 bitfields
 */

/*!
 * @name Register UART0_C4, field OSR[4:0] (RW)
 *
 * This field configures the oversampling ratio for the receiver between 4x
 * (00011) and 32x (11111). Writing an invalid oversampling ratio will default to an
 * oversampling ratio of 16 (01111). This field should only be changed when the
 * transmitter and receiver are both disabled.
 */
/*@{*/
#define BP_UART0_C4_OSR      (0U)          /*!< Bit position for UART0_C4_OSR. */
#define BM_UART0_C4_OSR      (0x1FU)       /*!< Bit mask for UART0_C4_OSR. */
#define BS_UART0_C4_OSR      (5U)          /*!< Bit field size in bits for UART0_C4_OSR. */

/*! @brief Read current value of the UART0_C4_OSR field. */
#define BR_UART0_C4_OSR(x)   (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_OSR, BS_UART0_C4_OSR))

/*! @brief Format value for bitfield UART0_C4_OSR. */
#define BF_UART0_C4_OSR(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C4_OSR) & BM_UART0_C4_OSR)

/*! @brief Set the OSR field to a new value. */
#define BW_UART0_C4_OSR(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_OSR), BP_UART0_C4_OSR, 5))
/*@}*/

/*!
 * @name Register UART0_C4, field M10[5] (RW)
 *
 * The M10 bit causes a tenth bit to be part of the serial transmission. This
 * bit should only be changed when the transmitter and receiver are both disabled.
 *
 * Values:
 * - 0 - Receiver and transmitter use 8-bit or 9-bit data characters.
 * - 1 - Receiver and transmitter use 10-bit data characters.
 */
/*@{*/
#define BP_UART0_C4_M10      (5U)          /*!< Bit position for UART0_C4_M10. */
#define BM_UART0_C4_M10      (0x20U)       /*!< Bit mask for UART0_C4_M10. */
#define BS_UART0_C4_M10      (1U)          /*!< Bit field size in bits for UART0_C4_M10. */

/*! @brief Read current value of the UART0_C4_M10 field. */
#define BR_UART0_C4_M10(x)   (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_M10, BS_UART0_C4_M10))

/*! @brief Format value for bitfield UART0_C4_M10. */
#define BF_UART0_C4_M10(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C4_M10) & BM_UART0_C4_M10)

/*! @brief Set the M10 field to a new value. */
#define BW_UART0_C4_M10(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_M10), BP_UART0_C4_M10, 1))
/*@}*/

/*!
 * @name Register UART0_C4, field MAEN2[6] (RW)
 *
 * Refer to Match address operation for more information.
 *
 * Values:
 * - 0 - All data received is transferred to the data buffer if MAEN1 is cleared.
 * - 1 - All data received with the most significant bit cleared, is discarded.
 *     All data received with the most significant bit set, is compared with
 *     contents of MA2 register. If no match occurs, the data is discarded. If match
 *     occurs, data is transferred to the data buffer.
 */
/*@{*/
#define BP_UART0_C4_MAEN2    (6U)          /*!< Bit position for UART0_C4_MAEN2. */
#define BM_UART0_C4_MAEN2    (0x40U)       /*!< Bit mask for UART0_C4_MAEN2. */
#define BS_UART0_C4_MAEN2    (1U)          /*!< Bit field size in bits for UART0_C4_MAEN2. */

/*! @brief Read current value of the UART0_C4_MAEN2 field. */
#define BR_UART0_C4_MAEN2(x) (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_MAEN2, BS_UART0_C4_MAEN2))

/*! @brief Format value for bitfield UART0_C4_MAEN2. */
#define BF_UART0_C4_MAEN2(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C4_MAEN2) & BM_UART0_C4_MAEN2)

/*! @brief Set the MAEN2 field to a new value. */
#define BW_UART0_C4_MAEN2(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_MAEN2), BP_UART0_C4_MAEN2, 1))
/*@}*/

/*!
 * @name Register UART0_C4, field MAEN1[7] (RW)
 *
 * Refer to Match address operation for more information.
 *
 * Values:
 * - 0 - All data received is transferred to the data buffer if MAEN2 is cleared.
 * - 1 - All data received with the most significant bit cleared, is discarded.
 *     All data received with the most significant bit set, is compared with
 *     contents of MA1 register. If no match occurs, the data is discarded. If match
 *     occurs, data is transferred to the data buffer.
 */
/*@{*/
#define BP_UART0_C4_MAEN1    (7U)          /*!< Bit position for UART0_C4_MAEN1. */
#define BM_UART0_C4_MAEN1    (0x80U)       /*!< Bit mask for UART0_C4_MAEN1. */
#define BS_UART0_C4_MAEN1    (1U)          /*!< Bit field size in bits for UART0_C4_MAEN1. */

/*! @brief Read current value of the UART0_C4_MAEN1 field. */
#define BR_UART0_C4_MAEN1(x) (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_MAEN1, BS_UART0_C4_MAEN1))

