theatrus/ksdk/platform/CMSIS/Include/device/MKL46Z4/MKL46Z4_registers.h
/*! @brief Format value for bitfield UART0_C4_MAEN1. */
#define BF_UART0_C4_MAEN1(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C4_MAEN1) & BM_UART0_C4_MAEN1)

/*! @brief Set the MAEN1 field to a new value. */
#define BW_UART0_C4_MAEN1(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_MAEN1), BP_UART0_C4_MAEN1, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_C5 - UART Control Register 5
 ******************************************************************************/

/*!
 * @brief HW_UART0_C5 - UART Control Register 5 (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart0_c5
{
    uint8_t U;
    struct _hw_uart0_c5_bitfields
    {
        uint8_t RESYNCDIS : 1;         /*!< [0] Resynchronization Disable */
        uint8_t BOTHEDGE : 1;          /*!< [1] Both Edge Sampling */
        uint8_t RESERVED0 : 3;         /*!< [4:2]  */
        uint8_t RDMAE : 1;             /*!< [5] Receiver Full DMA Enable */
        uint8_t RESERVED1 : 1;         /*!< [6]  */
        uint8_t TDMAE : 1;             /*!< [7] Transmitter DMA Enable */
    } B;
} hw_uart0_c5_t;

/*!
 * @name Constants and macros for entire UART0_C5 register
 */
/*@{*/
#define HW_UART0_C5_ADDR(x)      ((uint32_t)(x) + 0xBU)

#define HW_UART0_C5(x)           (*(__IO hw_uart0_c5_t *) HW_UART0_C5_ADDR(x))
#define HW_UART0_C5_RD(x)        (HW_UART0_C5(x).U)
#define HW_UART0_C5_WR(x, v)     (HW_UART0_C5(x).U = (v))
#define HW_UART0_C5_SET(x, v)    (BME_OR8(HW_UART0_C5_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C5_CLR(x, v)    (BME_AND8(HW_UART0_C5_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C5_TOG(x, v)    (BME_XOR8(HW_UART0_C5_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C5 bitfields
 */

/*!
 * @name Register UART0_C5, field RESYNCDIS[0] (RW)
 *
 * When set, disables the resynchronization of the received data word when a
 * data one followed by data zero transition is detected. This bit should only be
 * changed when the receiver is disabled.
 *
 * Values:
 * - 0 - Resynchronization during received data word is supported
 * - 1 - Resynchronization during received data word is disabled
 */
/*@{*/
#define BP_UART0_C5_RESYNCDIS (0U)         /*!< Bit position for UART0_C5_RESYNCDIS. */
#define BM_UART0_C5_RESYNCDIS (0x01U)      /*!< Bit mask for UART0_C5_RESYNCDIS. */
#define BS_UART0_C5_RESYNCDIS (1U)         /*!< Bit field size in bits for UART0_C5_RESYNCDIS. */

/*! @brief Read current value of the UART0_C5_RESYNCDIS field. */
#define BR_UART0_C5_RESYNCDIS(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_RESYNCDIS, BS_UART0_C5_RESYNCDIS))

/*! @brief Format value for bitfield UART0_C5_RESYNCDIS. */
#define BF_UART0_C5_RESYNCDIS(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_RESYNCDIS) & BM_UART0_C5_RESYNCDIS)

/*! @brief Set the RESYNCDIS field to a new value. */
#define BW_UART0_C5_RESYNCDIS(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_RESYNCDIS), BP_UART0_C5_RESYNCDIS, 1))
/*@}*/

/*!
 * @name Register UART0_C5, field BOTHEDGE[1] (RW)
 *
 * Enables sampling of the received data on both edges of the baud rate clock,
 * effectively doubling the number of times the receiver samples the input data
 * for a given oversampling ratio. This bit must be set for oversampling ratios
 * between x4 and x7 and is optional for higher oversampling ratios. This bit should
 * only be changed when the receiver is disabled.
 *
 * Values:
 * - 0 - Receiver samples input data using the rising edge of the baud rate
 *     clock.
 * - 1 - Receiver samples input data using the rising and falling edge of the
 *     baud rate clock.
 */
/*@{*/
#define BP_UART0_C5_BOTHEDGE (1U)          /*!< Bit position for UART0_C5_BOTHEDGE. */
#define BM_UART0_C5_BOTHEDGE (0x02U)       /*!< Bit mask for UART0_C5_BOTHEDGE. */
#define BS_UART0_C5_BOTHEDGE (1U)          /*!< Bit field size in bits for UART0_C5_BOTHEDGE. */

/*! @brief Read current value of the UART0_C5_BOTHEDGE field. */
#define BR_UART0_C5_BOTHEDGE(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_BOTHEDGE, BS_UART0_C5_BOTHEDGE))

/*! @brief Format value for bitfield UART0_C5_BOTHEDGE. */
#define BF_UART0_C5_BOTHEDGE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_BOTHEDGE) & BM_UART0_C5_BOTHEDGE)

/*! @brief Set the BOTHEDGE field to a new value. */
#define BW_UART0_C5_BOTHEDGE(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_BOTHEDGE), BP_UART0_C5_BOTHEDGE, 1))
/*@}*/

/*!
 * @name Register UART0_C5, field RDMAE[5] (RW)
 *
 * RDMAE configures the receiver data register full flag, S1[RDRF], to generate
 * a DMA request.
 *
 * Values:
 * - 0 - DMA request disabled.
 * - 1 - DMA request enabled.
 */
/*@{*/
#define BP_UART0_C5_RDMAE    (5U)          /*!< Bit position for UART0_C5_RDMAE. */
#define BM_UART0_C5_RDMAE    (0x20U)       /*!< Bit mask for UART0_C5_RDMAE. */
#define BS_UART0_C5_RDMAE    (1U)          /*!< Bit field size in bits for UART0_C5_RDMAE. */

/*! @brief Read current value of the UART0_C5_RDMAE field. */
#define BR_UART0_C5_RDMAE(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_RDMAE, BS_UART0_C5_RDMAE))

/*! @brief Format value for bitfield UART0_C5_RDMAE. */
#define BF_UART0_C5_RDMAE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_RDMAE) & BM_UART0_C5_RDMAE)

/*! @brief Set the RDMAE field to a new value. */
#define BW_UART0_C5_RDMAE(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_RDMAE), BP_UART0_C5_RDMAE, 1))
/*@}*/

/*!
 * @name Register UART0_C5, field TDMAE[7] (RW)
 *
 * TDMAE configures the transmit data register empty flag, S1[TDRE], to generate
 * a DMA request.
 *
 * Values:
 * - 0 - DMA request disabled.
 * - 1 - DMA request enabled.
 */
/*@{*/
#define BP_UART0_C5_TDMAE    (7U)          /*!< Bit position for UART0_C5_TDMAE. */
#define BM_UART0_C5_TDMAE    (0x80U)       /*!< Bit mask for UART0_C5_TDMAE. */
#define BS_UART0_C5_TDMAE    (1U)          /*!< Bit field size in bits for UART0_C5_TDMAE. */

/*! @brief Read current value of the UART0_C5_TDMAE field. */
#define BR_UART0_C5_TDMAE(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_TDMAE, BS_UART0_C5_TDMAE))

/*! @brief Format value for bitfield UART0_C5_TDMAE. */
#define BF_UART0_C5_TDMAE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_TDMAE) & BM_UART0_C5_TDMAE)

/*! @brief Set the TDMAE field to a new value. */
#define BW_UART0_C5_TDMAE(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_TDMAE), BP_UART0_C5_TDMAE, 1))
/*@}*/

